{"text": "I was unable to find any news relating to the stock symbol XLI in the past week. However, here is some general information about XLI that may be relevant to your buy/sell decision:\n\n- XLI is an exchange-traded fund (ETF) that tracks a market-cap-weighted index of industrial-sector stocks drawn from the S&P 500.\n- XLI provides investors with broad US industrial exposure, selecting companies from industry groups such as capital goods, commercial and professional services, and transportation.\n- XLI has a Morningstar Fund Comparison tool that can be used to compare its performance with other funds.\n- XLI has a Gross Expense Ratio of 0.09% as of April 24, 2024.\n- XLI's top holdings as of April 23, 2024, include UBER TECHNOLOGIES INC, HONEYWELL INTERNATIONAL INC, and UNITED PARCEL SERVICE CL B.", "documents": [{"id": "web-search_1", "snippet": "Skip to main content\n\nXLIIndustrial Select Sector SPDR Fund\n\nEquity: U.S. Industrials\n\nPopular XLI Comparisons: XLI vs VIS, XLI vs IYJ, XLI vs FIDU, XLI vs PSCI, XLI vs AMER\n\nRelated ETF Channels: Broad-based, Equity, Sectors, U.S., North America, Vanilla, Industrials\n\nFind more ETFs with our ETF Screener and Database\n\n*Unless otherwise stated, data provided by FactSet.\n\nXLI Fund Description\n\nXLI tracks a market-cap-weighted index of industrial-sector stocks drawn from the S&P 500.\n\nXLI Factset Analytics Insight\n\nXLI provides investors with broad US industrial exposure. The fund selects from the S&P 500, limiting its small- and midcap exposure and producing a more concentrated portfolio. Because smaller firms make up only a fraction of the industrial sector, the effects of the exclusion are mild. Included companies are those from the industry groups of industrial sector, such as capital goods, commercial & professional services, and transportation. Holdings are weighted by market cap, subject to a capping methodology that ensures no single security exceeds 25% at each quarterly rebalance.\n\nXLI MSCI ESG Analytics Insight\n\nIndustrial Select Sector SPDR Fund has an MSCI ESG Fund Rating of A based on a score of 6.39 out of 10. The MSCI ESG Fund Rating measures the resiliency of portfolios to long-term risks and opportunities arising from environmental, social, and governance factors. ESG Fund Ratings range from best (AAA) to worst (CCC). Highly rated funds consist of companies that tend to show strong and/or improving management of financially relevant environmental, social and governance issues. These companies may be more resilient to disruptions arising from ESG events. The fund’s Peer Rank reflects the ranking of a fund’s MSCI ESG Fund Quality Score against the scores of other funds within the same peer group, as defined by the Thomson Reuters Lipper Global Classification. Industrial Select Sector SPDR Fund ranks in the 63th percentile within its peer group and in the 64th percentile within the global universe of all funds covered by MSCI ESG Fund Ratings.\n\nXLI MSCI FaCS and Factor Box\n\nMSCI FaCS is a standard method for evaluating and reporting the Factor characteristics of equity portfolios including ETFs. The Factor Box includes 6 Factors that MSCI has identified that historically provided a return premium. On the vertical axis, the Factor Groups, are displayed and the horizontal axis displays the Factor exposure, overweight, underweight or neutral.\n\nCheap Small Cap & Sector ETFs Soar\n\nBest & Worst Sector ETFs Of The Year\n\nWeekly Inflows Nearly $12B As Stocks Approach Records\n\nBest & Worst Sector ETFs: 2Q 2020\n\nSectors In Review: April 2020\n\nSectors In Review: March 2020\n\nSectors In Review: February 2020\n\nStrong ETF Inflows For 1st Week Of 2020\n\nSectors In Review: January 2020\n\nWeekly ETF Inflows Total $16B\n\nXLI Charts And Performance\n\nTotal Return Chart (%)\n\nSelect ETFs to compare their performance:\n\nPERFORMANCE [as of 12/24/20] 1 MONTH 3 MONTHS YTD 1 YEAR 3 YEARS 5 YEARS 10 YEARS\n\nXLI 0.28% 17.42% 10.26% 9.40% 7.41% 12.74% 12.00%\n\nXLI (NAV) -1.49% 17.25% 10.16% 9.81% 7.40% 12.74% 12.00%\n\nS&P Industrial Select Sector Index -1.48% 17.31% 10.23% 9.88% 7.52% 12.90% 12.23%\n\nThomson Reuters US Industrials -0.15% 18.21% 9.95% 9.63% 8.31% 12.72% 12.51%\n\nAll returns over 1 year are annualized. All returns are total returns unless otherwise stated.\n\nIssuer State Street Global Advisors\n\nInception Date 12/16/98\n\nLegal Structure Open-Ended Fund\n\nAssets Under Management $16.07B\n\nAverage Daily $ Volume $931.97M\n\nAverage Spread (%) 0.01%\n\nVIS, IYJ, FIDU, PSCI, AMER\n\nWeighted Average Market Cap $59.10B\n\nPrice / Earnings Ratio 45.83\n\nPrice / Book Ratio 4.68\n\nDistribution Yield 1.56%\n\nNext Ex-Dividend Date 12/21/20\n\nNumber of Holdings 74\n\nIndex Tracked S&P Industrial Select Sector Index\n\nIndex Weighting Methodology Market Cap\n\nIndex Selection Methodology Committee\n\nSegment Benchmark Thomson Reuters US Industrials\n\nXLI Portfolio Management\n\nMedian Tracking Difference (12 Mo) -0.06%\n\nMax. Upside Deviation (12 Mo) 0.01%\n\nMax. Downside Deviation (12 Mo) -0.28%\n\nMax LT/ST Capital Gains Rate 20.00% / 39.60%\n\nCapital Gains Distributions (3 Year) --\n\nTax on Distributions Qualified dividends\n\nLegal Structure Open-Ended Fund\n\nOTC Derivative Use No\n\nSecurities Lending Active Yes\n\nSecurities Lending Split (Fund/Issuer) 70% / 30%\n\nETN Counterparty N/A\n\nETN Counterparty Risk N/A\n\nFund Closure Risk Low\n\nPortfolio Disclosure Daily\n\nBats BZX Real-time Quote -\n\nXLI Factset Analytics Block Liquidity\n\nThis measurement shows how easy it is to trade a $1 million USD block of XLI. XLI is rated a 5 out of 5.\n\nAvg. Daily Share Volume 11,007,428\n\nAverage Daily $ Volume $931.97M\n\nMedian Daily Share Volume 10,675,884\n\nMedian Daily Volume ($) $894.99M\n\nAverage Spread (%) 0.01%\n\nAverage Spread ($) $0.01\n\nMedian Premium / Discount (12 Mo) 0.00%\n\nMax. Premium / Discount (12 Mo) 0.41% / -0.69%\n\nImpediment to Creations None\n\nMarket Hours Overlap 100.00%\n\nCreation Unit Size (Shares) 50,000\n\nCreation Unit/Day (45 Day Average) 213.52\n\nCreation Unit Cost (%) 0.00%\n\nUnderlying Volume / Unit 0.03%\n\nOpen Interest on ETF Options 322,468\n\nNet Asset Value (Yesterday) $87.96\n\nETF.com Implied Liquidity 5\n\nXLI Sector/Industry Breakdown\n\nMachinery, Equipment & Components\n\nFreight & Logistics Services\n\nIndustrial Conglomerates\n\nProfessional & Commercial Services\n\nSoftware & IT Services\n\nPassenger Transportation Services\n\nAutomobiles & Auto Parts\n\nHomebuilding & Construction Supplies\n\nOther Specialty Retailers\n\nXLI Top 10 Holdings[View All]\n\nHoneywell International Inc. 5.56%\n\nUnion Pacific Corporation 5.12%\n\nUnited Parcel Service, Inc. Class B 4.66%\n\nBoeing Company 4.40%\n\nRaytheon Technologies Corporation 4.05%\n\nCaterpillar Inc. 3.66%\n\nGeneral Electric Company 3.59%\n\nLockheed Martin Corporation 3.27%\n\nDeere & Company 3.17%\n\nTotal Top 10 Weighting 41.27%\n\nXLI Economic Development\n\nXLI Performance Statistics\n\nGoodness of Fit (R2) 0.99\n\nDownside Standard Deviation 0.21%\n\nSegment Benchmark Thomson Reuters US Industrials\n\nXLI MSCI ESG Ratings\n\nMSCI ESG Quality Score 6.39 / 10\n\nPeer Group Percentile Rank 63.92\n\nGlobal Percentile Rank 62.57\n\nSRI Screening Criteria Exposure 26.54%\n\nExposure to Sustainable Impact Solutions 1.96%\n\nWeighted Average Carbon Intensity (t CO2e/$M Sales) 158.27\n\nXLI Benchmark Comparison Holdings\n\nXLI Number of Holdings 74\n\nBenchmark Constituents 295\n\nShared Holdings Weight 64.64%\n\nXLI Benchmark Comparison Summary\n\nWeighted Average Market Cap\n\nPrice / Earnings Ratio\n\nXLI Benchmark Comparison Market Cap Size\n\nOptions Strategies for Outcome Investing\n\nOptions allow you to customize investment outcomes. Using the strategy builders provided by Cboe Vest Technologies, you can construct some of the most common option strategies. Check out our user guide for more information on how to use the tool.\n\nCollar Strategy Protection Strategy\n\nCovered Call Strategy Income Strategy\n\nA collar strategy is a protective option strategy constructed by writing a call and buying a put with the same expiration date while being long the underlying security.\n\nA covered call is an income strategy constructed by writing a call option against a holding of the underlying security.\n\nThe data and information contained herein is not intended to be investment or tax advice. A reference to a particular investment or security, a credit rating, or any observation concerning a security or investment provided in the ETF.com Service is not a recommendation to buy, sell, or hold such investment or security or to make any other investment decisions. You should not use such information for purposes of any actual transaction without consulting an investment or tax professional. ETF.com DOES NOT TAKE RESPONSIBILITY FOR YOUR INVESTMENT OR OTHER ACTIONS NOR SHALL ETF.com HAVE ANY LIABILITY, CONTINGENT OR OTHERWISE, FOR THE ACCURACY, COMPLETENESS, TIMELINESS, OR CORRECT SEQUENCING OF ANY INFORMATION PROVIDED BY ETF.com OR FOR ANY DECISION MADE OR ACTION TAKEN BY YOU IN RELIANCE UPON SUCH INFORMATION OR ETF.com. [ETF.com DOES NOT PROVIDE ANY RESEARCH OPINIONS.] ETF.com MAKES NO REPRESENTATIONS ABOUT THE SUITABILITY OF THE INFORMATION, PRODUCTS OR SERVICES CONTAINED HEREIN. PAST PERFORMANCE IS NOT INDICATIVE OF FUTURE RESULTS.\n\nData provider: Terms of Use\n\nMSCI ESG Research LLC’s (\"MSCI ESG\") Fund Metrics products (the \"Information\") provide environmental, social and governance data with respect to underlying securities within more than 24,000 multi-asset class Mutual Funds and ETFs globally. MSCI ESG is a Registered Investment Adviser under the Investment Advisers Act of 1940. MSCI ESG materials have not been submitted to, nor received approval from, the US SEC or any other regulatory body. None of the Information constitutes an offer to buy or sell, or a promotion or recommendation of, any security, financial instrument or product or trading strategy, nor should it be taken as an indication or guarantee of any future performance, analysis, forecast or prediction. None of the Information can be used to determine which securities to buy or sell or when to buy or sell them. The Information is provided \"as is\" and the user of the Information assumes the entire risk of any use it may make or permit to be made of the Information.", "timestamp": "2024-04-01T16:03:22", "title": "XLI ETF Report: Ratings, Analysis, Quotes, Holdings | ETF.com", "url": "https://www.etf.com/XLI"}, {"id": "web-search_2", "snippet": "Skip to main content\n\nFrom Sectors and Smart Beta to Fixed Income, SPDR Exchange Traded Funds (ETFs) give you wide access to diverse investment opportunities. Find out more.\n\nThe Industrial Select Sector SPDR® Fund XLI\n\nMorningstar Fund Comparison\n\nImportant Risk Disclosure\n\nIn general, ETFs can be expected to move up or down in value with the value of the applicable index. Although ETF shares may be bought and sold on the exchange through any brokerage account, ETF shares are not individually redeemable from the Fund. Investors may acquire ETFs and tender them for redemption through the Fund in Creation Unit Aggregations only. Please see the prospectus for more details.\n\nEquity securities may fluctuate in value and can decline significantly in response to the activities of individual companies and general market and economic conditions.\n\nAll ETFs are subject to risk, including possible loss of principal. Sector ETF products are also subject to sector risk and non-diversification risk, which generally result in greater price fluctuations than the overall market.\n\nSelect Sector SPDR Funds bear a higher level of risk than more broadly diversified funds.\n\nNon-diversified funds that focus on a relatively small number of securities tend to be more volatile than diversified funds and the market as a whole.\n\nPassively managed funds invest by sampling the index, holding a range of securities that, in the aggregate, approximates the full Index in terms of key risk factors and other characteristics. This may cause the fund to experience tracking errors relative to performance of the index.\n\nWhile the shares of ETFs are tradable on secondary markets, they may not readily trade in all market conditions and may trade at significant discounts in periods of market stress.\n\nETFs trade like stocks, are subject to investment risk, fluctuate in market value and may trade at prices above or below the ETFs net asset value. Brokerage commissions and ETF expenses will reduce returns.\n\nIntellectual Property Information: The S&P 500® Index is a product of S&P Dow Jones Indices LLC or its affiliates (“S&P DJI”) and have been licensed for use by State Street Global Advisors. S&P®, SPDR®, S&P 500®,US 500 and the 500 are trademarks of Standard & Poor’s Financial Services LLC (“S&P”); Dow Jones® is a registered trademark of Dow Jones Trademark Holdings LLC (“Dow Jones”) and has been licensed for use by S&P Dow Jones Indices; and these trademarks have been licensed for use by S&P DJI and sublicensed for certain purposes by State Street Global Advisors. The fund is not sponsored, endorsed, sold or promoted by S&P DJI, Dow Jones, S&P, their respective affiliates, and none of such parties make any representation regarding the advisability of investing in such product(s) nor do they have any liability for any errors, omissions, or interruptions of these indices.\n\nBefore investing, consider the funds' investment objectives, risks, charges and expenses. To obtain a prospectus or summary prospectus which contains this and other information, call 1-866-787-2257 download a prospectus or summary prospectus now, or talk to your financial advisor. Read it carefully before investing.\n\nThe Fund's investments are subject to changes in general economic conditions, general market fluctuations and the risks inherent in investment in securities markets. Investment markets can be volatile and prices of investments can change substantially due to various factors including, but not limited to, economic growth or recession, changes in interest rates, changes in the actual or perceived creditworthiness of issuers, and general market liquidity. The Fund is subject to the risk that geopolitical events will disrupt securities markets and adversely affect global economies and markets. Local, regional or global events such as war, acts of terrorism, the spread of infectious illness or other public health issues, or other events could have a significant impact on the Fund and its investments.\n\nOverview Performance Holdings Documents Purchase Information More Insights\n\nMorningstar Fund Comparison\n\nThe market value of a mutual fund's or ETFs total assets, minus liabilities, divided by the number of shares outstanding.\n\nAssets Under Management\n\n﻿Gross Expense Ratio\n\nThe fund's total annual operating expense ratio. It is gross of any fee waivers or expense reimbursements. It can be found in the fund's most recent prospectus.\n\nETF Historical Distributions\n\nThe Industrial Select Sector SPDR® Fund seeks to provide investment results that, before expenses, correspond generally to the price and yield performance of the Industrial Select Sector Index (the “Index”)\n\nThe Index seeks to provide an effective representation of the industrial sector of the S&P 500 Index\n\nSeeks to provide precise exposure to companies in the following industries: aerospace and defense; industrial conglomerates; marine transportation; transportation infrastructure; machinery; ground transportation; air freight and logistics; commercial services and supplies; professional services; electrical equipment; construction and engineering; trading companies and distributors; passenger airlines; and building products.\n\nAllows investors to take strategic or tactical positions at a more targeted level than traditional style based investing\n\nAbout this Benchmark\n\nThe companies included in each Select Sector Index are selected on the basis of general industry classification from a universe of companies defined by the Standard & Poor’s 500 Composite Stock® Index (“S&P 500®”). The eleven Select Sector Indexes (each a “Select Sector Index”) upon which the Select Sector SPDR Funds are based together comprise all of the companies in the S&P 500.\n\nThe Industrials Select Sector Index seeks to provide an effective representation of the industrial sector of the S&P 500 Index. The Index includes companies from the following industries: aerospace and defense; industrial conglomerates; marine transportation; transportation infrastructure; machinery; ground transportation; air freight and logistics; commercial services and supplies; professional services; electrical equipment; construction and engineering; trading companies and distributors; passenger airlines; and building products.\n\nFund Information as of Apr 24 2024\n\nIndustrial Select Sector Index\n\n﻿Gross Expense Ratio\n\nThe fund's total annual operating expense ratio. It is gross of any fee waivers or expense reimbursements. It can be found in the fund's most recent prospectus.\n\nState Street Global Advisors Funds Management Inc.\n\nSSGA Funds Management, Inc.\n\nGlobal Equity Beta Solutions\n\nALPS Portfolio Solutions Distributor, Inc.\n\nDistribution Frequency\n\nListing Information as of Apr 24 2024\n\nFund Characteristics as of Apr 23 2024\n\nEst. 3-5 Year EPS Growth\n\n﻿Estimated 3-5 Year EPS Growth\n\nBased on the underlying holdings of the fund. The actual earnings estimates for the underlying holdings are provided by FactSet, First Call, I/B/E/S Consensus, and Reuters and are used to calculate a mean 3-5 year EPS growth rate estimate.\n\nThe weighted harmonic average of closing market price divided by the most recent reported book value for each security in the fund's portfolio as calculated for the last twelve months.\n\nPrice/Earnings Ratio FY1\n\n﻿Price/Earnings Ratio FY1\n\nThe weighted harmonic average of current share price divided by the forecasted one year earnings per share for each security in the fund. Negative and positive outliers are included in the calculation.\n\nWeighted Average Market Cap\n\nIndex Characteristics as of Apr 23 2024\n\nEst. 3-5 Year EPS Growth\n\nPrice/Earnings Ratio FY1\n\nIndex Statistics as of Apr 23 2024\n\nWeighted Average Market Cap\n\nYields as of Apr 23 2024\n\n(Also known as Standardized Yield) An annualized yield that is calculated by dividing the net investment income earned by the fund over the most recent 30-day period by the current maximum offering price.\n\n30 Day SEC Yield (Unsubsidized)\n\n﻿30 Day SEC Yield (Unsubsidized)\n\nAn annualized yield that is calculated by dividing the net investment income earned by the fund over the most recent 30-day period by the current maximum offering price that does not account for expense ratio waivers.\n\nFund Distribution Yield\n\nFund Distribution Yield\n\nThe sum of the most recent 12 distributions within the past 365 days divided by Net Asset Value per share, expressed as a percentage.\n\nIndex Dividend Yield\n\nIndex Dividend Yield\n\nThe weighted average of the underlyings' indicated annual dividend divided by price, expressed as a percentage.\n\nFund Market Price as of Apr 23 2024\n\n﻿Bid/Ask Mid Point\n\n(Also known as Mid Price) The price between the best price of the sellers for a trading unit of a given security and the best price of the buyer of a trading unit of a given security.\n\nMarket Price of last reported trade on the exchange.\n\nExchange Volume (Shares)\n\nExchange Volume (shares)\n\nRepresents the volume of shares traded on the ETF's primary exchange throughout the previous business day.\n\n﻿Premium/Discount to NAV\n\nShows the comparison of the daily net asset value (NAV) and the Midpoint of the closing bid/ask for each of the funds calculated as ((4PM Bid/Ask - Closing NAV) / Closing NAV * 100)\n\n30-Day Median Bid/Ask Spread\n\nThe median bid-ask spread is calculated by identifying national best bid and national best offer (\"NBBO\") for each Fund as of the end of each 10 second interval during each trading day of the last 30 calendar days and dividing the difference between each such bid and offer by the midpoint of the NBBO. The median of those values is identified and posted on each business day.\n\nPremium Discount to NAV Graph and Summary\n\nThe line graph and table below show historical information about the differences between the daily closing price for shares of the fund (as determined by the fund’s listing exchange) and the fund’s net asset value over certain periods. The vertical axis of the line graph shows the premium/discount expressed as a percentage of NAV. The horizontal axis indicates the date at which the premium/discount occurred. The table shows the number of trading days in which the fund traded at a premium or at a discount to NAV.\n\nNumber of Days Summary\n\nFirst Quarter of 2024\n\nDays Traded at Premium\n\nNumber of days the ETF 4PM Bid/Ask was above the NAV.\n\nDays Traded at Discount\n\nNumber of days the ETF 4PM Bid/Ask was below the NAV.\n\nBecause ETFs trade like stocks at current market prices, shareholders may pay more than a fund’s NAV when purchasing fund shares and may receive less than a fund’s NAV when selling fund shares.\n\nBefore investing, consider the funds' investment objectives, risks, charges and expenses. To obtain a prospectus or summary prospectus which contains this and other information, call 1-866-787-2257 download a prospectus or summary prospectus now, or talk to your financial advisor. Read it carefully before investing.\n\nFund Net Cash Amount as of Apr 23 2024\n\nFund Net Asset Value as of Apr 23 2024\n\nThe market value of a mutual fund's or ETFs total assets, minus liabilities, divided by the number of shares outstanding.\n\nAssets Under Management\n\nMost Recent NAV / NAV History\n\nFund Inception Date: Dec 16 1998\n\nMonth End Quarter End\n\nSince Inception Dec 16 1998\n\nIndustrial Select Sector Index\n\nReturn after Taxes on Distributions\n\nReturn after Taxes on Distributions and Sale of Fund Shares\n\nIndustrial Select Sector Index\n\nSince Inception Dec 16 1998\n\nIndustrial Select Sector Index\n\nReturn after Taxes on Distributions\n\nReturn after Taxes on Distributions and Sale of Fund Shares\n\nIndustrial Select Sector Index\n\nPast performance is not a reliable indicator of future performance. Investment return and principal value will fluctuate, so you may have a gain or loss when shares are sold. Current performance may be higher or lower than that quoted. Performance of an index is not illustrative of any particular investment. All results are historical and assume the reinvestment of dividends and capital gains. It is not possible to invest directly in an index.\n\nPerformance returns for periods of less than one year are not annualized. Performance is shown net of fees.\n\nIndex returns are unmanaged and do not reflect the deduction of any fees or expenses. Index returns reflect all items of income, gain and loss and the reinvestment of dividends and other income as applicable.\n\nThe market price used to calculate the Market Value return is the midpoint between the highest bid and the lowest offer on the exchange on which the shares of the Fund are listed for trading, as of the time that the Fund's NAV is calculated. If you trade your shares at another time, your return may differ.\n\nGross Expense Ratio: 0.09%\n\nFund Top Holdings as of Apr 23 2024\n\nIndex Top Holdings as of Apr 23 2024\n\nFund Top Holdings as of Apr 23 2024\n\nUBER TECHNOLOGIES INC\n\nHONEYWELL INTERNATIONAL INC\n\nUNITED PARCEL SERVICE CL B\n\nAUTOMATIC DATA PROCESSING\n\nDownload All Holdings: Daily\n\nIndex Top Holdings as of Apr 23 2024\n\nUber Technologies Inc.\n\nUnion Pacific Corporation\n\nHoneywell International Inc.\n\nUnited Parcel Service Inc. Class B\n\nAutomatic Data Processing Inc.\n\nFund Industry Allocation as of Apr 23 2024\n\nIndex Industry Allocation as of Apr 23 2024\n\nFund Industry Allocation as of Apr 23 2024\n\nGround Transportation\n\nElectrical Equipment\n\nProfessional Services\n\nCommercial Services & Supplies\n\nAir Freight & Logistics\n\nIndustrial Conglomerates\n\nTrading Companies & Distributors\n\nConstruction & Engineering\n\nIndex Industry Allocation as of Apr 23 2024\n\nGround Transportation\n\nElectrical Equipment\n\nProfessional Services\n\nCommercial Services & Supplies\n\nAir Freight & Logistics\n\nIndustrial Conglomerates\n\nTrading Companies & Distributors\n\nConstruction & Engineering\n\nSummary Prospectus pdf\n\nSemi-Annual Report pdf\n\nFirst Quarter Holdings pdf\n\nThird Quarter Holdings pdf\n\nProxy Voting Results pdf\n\nETF Historical Distributions\n\nInformation & Schedules\n\nDownload Product Data xlsx\n\nSPDR Dividend Distribution Schedule pdf\n\nSPDR® ETF Listing pdf\n\nInsights & Resources\n\nSector Business Cycle Analysis pdf\n\nPurchase Information\n\nBuying and Selling ETFs\n\nETFs are flexible and easy to trade. Investors buy and sell them like stocks, typically through a brokerage account. Investors can also employ traditional stock trading techniques; including stop orders, limit orders, margin purchases, and short sales using ETFs. They are listed on major US Stock Exchanges.\n\nETFs are subject to risk similar to those of stocks including those regarding short-selling and margin account maintenance.\n\nOrdinary brokerage commissions apply.\n\nThere are no sales loads on Select Sector SPDR shares but ordinary brokerage commissions apply and this expense is not reflected in performance calculations.\n\nIn general, ETFs can be expected to move up or down in value with the value of the applicable index. Although ETF shares may be bought and sold on the exchange through any brokerage account, ETF shares are not individually redeemable from the Fund. Investors may acquire ETFs and tender them for redemption through the Fund in Creation Unit Aggregations only. Please see the prospectus for more details.\n\nAfter-tax returns are calculated based on NAV using the historical highest individual federal marginal income tax rates and do not reflect the impact of state and local taxes. Actual after-tax returns depend on the investor's tax situation and may differ from those shown. The after-tax returns shown are not relevant to investors who hold their fund shares through tax-deferred arrangements such as 401(k) plans or individual retirement accounts.\n\nUnless otherwise noted all information contained herein is that of The Industrial Select Sector SPDR ETF.\n\nPerformance of an index is not illustrative of any particular investment. It is not possible to invest directly in an index.\n\nHoldings and sectors shown are as of the date indicated and are subject to change. This information should not be considered a recommendation to invest in a particular sector or to buy or sell any security shown. It is not known whether the sectors or securities shown will be profitable in the future.\n\nAs with all stocks, you may be required to deposit more money or securities into your margin account if the equity, including the amount attributable to your ETF shares, declines.\n\nAll total return figures assume reinvestment of dividend and capital gains at net assets value; actual returns may differ.", "timestamp": "2024-04-27T20:24:43", "title": "XLI: The Industrial Select Sector SPDR® Fund", "url": "https://www.ssga.com/us/en/intermediary/etfs/funds/the-industrial-select-sector-spdr-fund-xli"}, {"id": "web-search_3", "snippet": "Entering text into the input field will update the search result below\n\nSearch for Symbols, analysts, keywords\n\nXLI Industrial Select Sector SPDR® Fund ETF\n\nETF Price & OverviewFollow\n\n$111.95-0.90 (-0.79%)9:53 AM 01/03/24\n\nNYSEARCA | $USD | Realtime\n\nExpand For Key Data »\n\nXLI: S&P500 Industrial ETF rises in 2023, GE, RTX, LUV among top movers for the year\n\nBig buying opportunities in the financial and industrial sectors - analyst\n\nS&P 500 posts best weekly win streak in over six years as Wall Street rally powers on\n\nHealthcare, industrials and materials are favored by Wells Fargo for 2024\n\nMarket pullbacks should be expected and bought into - analyst\n\nIndustrial Select Sector SPDR ETF declares quarterly distribution of $0.6146\n\nS&P 500 posts best week in over a month after long-awaited Fed pivot finally arrives\n\nThe S&P sectors with the best and worst prospects, as ranked by SA Quant Ratings\n\nXLI: The Forgotten Industrial Sector ETF Just Hit A New All-Time High\n\nInvestment takeaways from the 2024 presidential election - BCA Research\n\nMore News And Analysis »\n\nLocked. Go Premium to see thisview ratings\n\nNot CoveredRating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nNot CoveredRating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nSee XLI ratings with Premium.\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nDividend Growth History\n\nMore On Dividend Growth »\n\nTo ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser.\n\nIs this happening to you frequently? Please report it on our feedback forum.\n\nIf you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh.", "timestamp": "2024-04-25T19:37:27", "title": "Industrial Select Sector SPDR® Fund ETF (XLI) Stock Price, Quote, News & Analysis", "url": "https://seekingalpha.com/symbol/XLI"}, {"id": "web-search_5", "snippet": "Industrial Select Sector SPDR® ETF\n\nSEE FULL INTERACTIVE CHART\n\nAbout Industrial Select Sector SPDR® ETF\n\nThe investment seeks to provide investment results that, before expenses, correspond generally to the price and yield performance of publicly traded equity securities of companies in the Industrial Select Sector Index. Under normal market conditions, the fund generally invests substantially all, but at least 95%, of its total assets in the securities comprising the index. The index includes companies that have been identified as Industrial companies by the Global Industry Classification Standard, including securities of companies from the following industries: aerospace and defense; industrial conglomerates; marine transportation. It is non-diversified.\n\nU.S. News evaluated 30 Industrials ETFs and 15 make our Best Fit list. Our list highlights the best passively managed funds for long-term investors. Rankings are assigned based on comparisons with Best Fit funds in this category.\n\n#3in IndustrialsSEE ALL ETF RATINGS\n\nTracking Error Excellent\n\nBid/Ask Ratio Typical\n\nHoldings Diversity Good\n\nHOW WE RANK BEST FIT FUNDS\n\nLow commission rates start at $0 for U.S. listed stocks & ETFs*. Margin loan rates from 5.83% to 6.83%.\n\nNo commission fees to trade stocks, options or crypto, and no account minimums to start.\n\n$0 for stocks and ETFs\n\nInvest in stocks, fractional shares, and crypto all in one place.\n\nCaterpillar Inc. CAT\n\nUnion Pacific Corp. UNP\n\nUber Technologies Inc UBER\n\nEaton Corporation plc ETN\n\nHoneywell International Inc HON\n\nUnited Parcel Service, Inc. - Ordinary Shares - Class B UPS\n\nAutomatic Data Processing Inc. ADP\n\nBasic Materials SECTOR\n\nCommunication Services SECTOR\n\nConsumer Cyclical SECTOR\n\nConsumer Defensive SECTOR\n\nFinancial Services SECTOR\n\nCommunication Services\n\nGeographic Breakdown\n\nSee Full Interactive Chart\n\nQuotes delayed at least 15 minutes. Market data provided by Xignite. Fund data provided by Xignite and Morningstar. See Disclaimer. Contact U.S. News Best Funds. Use of this website constitutes acceptance of the Best Funds Terms and Conditions of Use.\n\nHighest Returns in Industrials 1 YEAR\n\nInvesco Building & Construction ETF PKB\n\nInvesco Dorsey Wright IndustrialsMomtETF PRN\n\nFirst Trust RBA Amer Indl RenaisTM ETF AIRR\n\nInvesco S&P SmallCap Industrials ETF PSCI\n\nFidelity MSCI Industrials ETF FIDUSee More Highest Returns\n\nAdvice, rankings and one great story every day.\n\nSign up to receive the latest updates from U.S. News & World Report and our trusted partners and sponsors. By clicking submit, you are agreeing to our Terms and Conditions & Privacy Policy.\n\nBest Fit Industrials\n\nVanguard Industrials ETF VIS\n\nFidelity MSCI Industrials ETF FIDU\n\nIndustrial Select Sector SPDR® ETF XLI\n\niShares US Industrials ETF IYJ\n\nSEE FULL RATINGS LIST\n\n7 Best Cryptocurrency ETFs to Buy\n\nCryptocurrency ETFs can currently hold spot Bitcoin, Ethereum futures or even shares of blockchain companies and crypto exchanges.\n\nTony DongApril 30, 2024\n\n10 Best Low-Cost Index Funds to Buy\n\nIndex funds offer great performance at a low price. Here are some of the top index funds in the market.\n\nTony DongApril 29, 2024\n\n5 Best Gold ETFs for 2024\n\nWhen inflation refuses to abate, gold can be a good store of value. Here are five exchange-traded funds that track the price of gold.\n\nCoryanne HicksApril 26, 2024\n\nBest Tax-Free Muni Bond Funds\n\nLooking to lower volatility while keeping taxes under control? These municipal bond funds may be ideal.\n\nTony DongApril 25, 2024\n\n7 Best High-Dividend ETFs to Buy Now\n\nThese seven high-dividend ETFs provide a steady stream of passive income and the opportunity for growth.\n\nGlenn FydenkevezApril 25, 2024\n\n7 Best Long-Term ETFs to Buy and Hold\n\nThese no-nonsense funds are diversified ways to play stocks over the years to come.\n\nJeff ReevesApril 24, 2024\n\n7 Best Electric Vehicle ETFs to Buy\n\nLooking for exposure to the leading electric vehicle manufacturers? These exchange-traded funds have you covered.\n\nTony DongApril 23, 2024\n\n7 Best Energy ETFs to Buy Now\n\nEnergy stocks have strongly surged this year due to heightened geopolitical risk in the Middle East.\n\nTony DongApril 22, 2024\n\nSmall-Cap ETFs to Buy for Growth\n\nSmall-cap stocks have more room to grow compared with larger companies.\n\nGlenn FydenkevezApril 22, 2024\n\n7 Best Dividend ETFs to Buy Now\n\nThese funds offer income alternatives outside the bond market.\n\nJeff ReevesApril 19, 2024\n\nBest Tech ETFs to Buy\n\nThese exchange-traded funds are top picks if you want to invest in the technology industry.\n\nCoryanne HicksApril 19, 2024\n\nETF vs. Index Funds: What to Know\n\nHere's what the experts say on how to decide between ETFs and index mutual funds.\n\nTony DongApril 18, 2024\n\nBest Actively Managed ETFs\n\nIf you're looking to beat the benchmarks, consider these seven actively managed ETFs.\n\nGlenn FydenkevezApril 18, 2024\n\n5 Cloud ETFs to Buy Now\n\nCloud computing ETFs offer high risk and high reward.\n\nCoryanne HicksApril 17, 2024\n\n7 Best Semiconductor ETFs to Buy in 2024\n\nSemiconductor ETFs can help investors tap into tailwinds such as demand from artificial intelligence, government grants and a re-shoring movement.\n\nTony DongApril 16, 2024\n\nMoney Market Funds to Buy for Safety\n\nLooking for a blend of capital preservation and income potential? These funds may be ideal.\n\nTony DongApril 15, 2024\n\n6 Best Nasdaq 100 ETFs\n\nThese Nasdaq-100 ETFs can provide diversified exposure to top-tier technology stocks.\n\nWayne DugganApril 15, 2024\n\nWater Stocks and ETFs\n\nThese water stocks and ETFs focus on a precious resource that's becoming more scarce.\n\nMatt WhittakerApril 12, 2024\n\n6 of the Best AI ETFs to Buy Now\n\nWith AI ETFs, investors can mitigate individual company risks while still capitalizing on overall growth potential.\n\nTony DongApril 9, 2024\n\n9 of the Best Bond ETFs to Buy Now\n\nInvesting in bond ETFs doesn't have to be complicated. Here's what the experts recommend.\n\nTony DongApril 8, 2024", "timestamp": "2024-04-30T19:57:46", "title": "Everything You Need to Know About Investing in Industrial Select Sector SPDR® ETF", "url": "https://money.usnews.com/funds/etfs/industrials/industrial-select-sector-spdr-etf/xli"}]}