{"text": "Here is a summary of recent news and events relating to Amazon (AMZN) that may influence a buy/sell decision:\n\n- Amazon's profits and cash flow have increased as its investments during the pandemic have paid off.\n- Amazon's cloud computing headwinds are no longer a concern for analysts.\n- Amazon's Q1 2024 earnings were solid, and some analysts consider it a 'buy'.\n- Amazon is not paying dividends and is instead focusing on heavy capex spending.\n- Amazon is going all-in on generative AI, calling it a 'multi-billion dollar business'.\n- Amazon's AWS revenue climbed 17% year-over-year.\n- Amazon's Zoox robotaxis will drive faster, farther, and at night in Las Vegas.\n- Amazon's stock price as of April 23, 2024, was $155.18, with a 52-week range of $88.12 - $157.17.\n- 89% of articles about AMZN in the last week were positive, compared to a sector average of 63%.\n- Amazon's P/E ratio is 80.73 as of January 12, 2024.", "documents": [{"id": "web-search_1", "snippet": "PopularTop Smart Score Stocks\n\nPopularTop Insiders StocksTop Gainers/ Losers/ Active StocksMost Visited WebsitesDividend StocksChatGPT StocksLargest Companies by Market Cap\n\nNewTop ETFs by Smart ScoreTop Gainers/ Losers/ Active ETFs\n\nUnusual Options Activity\n\nStock ScreenerETF Screener\n\nPopularTrending StocksDaily Analyst RatingsCompare StocksCompare ETFsPenny Stock ScreenerTechnical Analysis ScreenerDaily Insider Trading Tracker\n\nEarnings CalendarDividend CalendarEconomic CalendarIPO CalendarStock SplitsStock BuybacksMarket Holidays\n\nDividend CalculatorDividend Yield CalculatorOptions Profit Calculator\n\nInflation RateUnemployment Rate\n\nDividend CenterBest Dividend Stocks\n\nPopularBest High Yield Dividend StocksDividend AristocratsDividend Stock Comparison\n\nNewDividend CalculatorDividend Returns ComparisonDividend Calendar\n\nMy ExpertsTop AnalystsTop Financial BloggersTop-Performing Corporate InsidersTop Hedge Fund ManagersTop Research FirmsTop Individual Investors\n\nPersonal Finance CenterMortgagesLoansInvesting & RetirementSpending & Savings\n\n401k Retirement CalculatorMortgage Calculator\n\nPopularCompound Interest CalculatorDollar Cost Averaging\n\nNewStudent Loan CalculatorAuto Loan Calculator\n\nEnterprise Solutions\n\nHow To Use TipRanksTipRanks LabsWebinar CenterGlossaryFAQs\n\nAbout TipRanksTipRanks CommunityContact UsCareersReviewsMobile APP\n\nWorking with TipRanks\n\nEnterprise SolutionsTop Online BrokersBecome an Affiliate\n\nDaily Analyst Ratings\n\nInvest Like a Pro with Unique Data & Simplifed ToolsTry Now\n\nTop Smart Score Stocks\n\nTop Gainers/ Losers/ Active Stocks\n\nMost Visited Websites\n\nLargest Companies by Market Cap\n\nTop ETFs by Smart Score\n\nTop Gainers/ Losers/ Active ETFs\n\nOptions Market Overview\n\nUnusual Options Activity\n\nOptions Volume Leaders\n\nDaily Analyst Ratings\n\nPenny Stock Screener\n\nTechnical Analysis Screener\n\nDaily Insider Trading Tracker\n\nEconomic Indicators Center\n\nDividend Yield Calculator\n\nOptions Profit Calculator\n\nDollar Cost Averaging\n\nBest Dividend Stocks\n\nBest High Yield Dividend Stocks\n\nDividend Aristocrats\n\nDividend Stock Comparison\n\nDividend Returns Comparison\n\nTop Financial Bloggers\n\nTop-Performing Corporate Insiders\n\nTop Hedge Fund Managers\n\nTop Individual Investors\n\nPersonal Finance Center\n\nInvesting & Retirement\n\nCompound Interest Calculator\n\nAuto Loan Calculator\n\nStudent Loan Calculator\n\n401k Retirement Calculator\n\nEnterprise Solutions\n\nWorking with TipRanks\n\nEnterprise Solutions\n\nTop Smart Score Stocks\n\nStock Screenerreports\n\nAmazon (AMZN) Stock News & Sentiment\n\n108,831 FollowersPortfolio\n\nAMZN News on the Web\n\nStocks Fall on Bearish US Economic Reports and Sharp T-note Yield Rise\n\n25 Poorest States in the US in 2024\n\nPagerDuty's (NYSE:PD) Q4 Earnings Results: Revenue In Line With Expectations But Stock Drops\n\nU.S. shares lower at close of trade; Dow Jones Industrial Average down 0.35%\n\nU.S. stocks lower at close of trade; Dow Jones Industrial Average down 0.35%\n\nMicrosoft singles out Google's competitive edge in generative AI\n\nTech Trailblazers: 7 Stocks Poised to Redefine Their Industries\n\nAmazon's Zoox robotaxis to drive faster, farther, at night in Las Vegas\n\nNews Score - Last 7 Days\n\nThis Week242 articles\n\nWeekly Average294.5 articles\n\nSee how Bullish or Bearish a stock is based on its recent media coverage. This score is generated using a formula that combines Media Buzz and News Sentiment.\n\nMedia Coverage Analysis\n\nThe historical news coverage of this asset in the last three months.\n\nWhat is AMZN’s Media Buzz Sentiment?\n\n242 articles about AMZN were published this week. In an average week, 294.5 articles are published.\n\nWhat is AMZN’s weekly average amount of articles?\n\nIn an average week, 294.5 articles about AMZN are published.\n\nWhat is AMZN’s News Sentiment?\n\n89% of articles about AMZN were positive this week, compared to its sector average of 63%.\n\nConsumer Cyclical Stocks that are Trending in the News\n\nPRPLPurple Innovation\n\nShowing the stocks with the most bullish news sentiment over the past week\n\nSee the stocks with the most bullish news sentiment in the sector\n\nGet More with TipRanks Premium\n\nWhat's Included in PREMIUM?\n\nMake informed decisions based on Top Analysts' activity\n\nKnow what industry insiders are buying\n\nGet actionable alerts from top Wall Street Analysts\n\nFind out before anyone else which stock is going to shoot up\n\nGet powerful stock screeners & detailed portfolio analysis\n\nSubscribe NowSee Plans & Pricing", "timestamp": "2024-03-15T12:57:09", "title": "Amazon (AMZN) Stock News Today - TipRanks.com", "url": "https://www.tipranks.com/stocks/amzn/stock-news"}, {"id": "web-search_3", "snippet": "Accessibility Log In Help Join The Motley Fool\n\nAmazon (NASDAQ: AMZN)\n\nPrice as of April 23, 2024, 12:56 p.m. ET\n\nAmazon Return vs. S&P\n\nAmazon.com is virtually synonymous with online retail, selling its own inventory while also offering third-party sales and fulfillment. It also has fast-growing operations in subscriptions, advertising, and Web hosting.\n\nThe Fool has written over 10,400 articles on Amazon.\n\nPrediction: This \"Magnificent Seven\" Stock Will Be the Biggest Winner of the AI Boom\n\nThis company has a track record of benefiting from its investments.\n\nAdria Cimino | Apr 23, 2024\n\nThis Is Hands Down My Pick for the Best \"Magnificent Seven\" Stock Right Now. (Hint: It's Not Nvidia.)\n\nThe \"Magnificent Seven\" garner a lot of hype in artificial intelligence (AI). But one company sticks out thanks to savvy investments and strong financials.\n\nAdam Spatacco | Apr 23, 2024\n\nWhere Will Amazon Stock Be in 2024?\n\nParkev Tatevosian, CFA | Apr 22, 2024\n\nAmazon's profits and cash flow have soared as it has grown into investments made during the pandemic.\n\nOpinion: These 2 \"Magnificent Seven\" Stocks Will Be the Largest Companies in the World by 2030\n\nBrett Schafer | Apr 21, 2024\n\nThere is still a lot of growth left for these technology giants, despite their immense size.\n\nIs Amazon Stock a Buy in 2024?\n\nLawrence Nga | Apr 21, 2024\n\nThis e-commerce giant has good reasons to keep performing in the years to come.\n\n2 Warren Buffett Stocks You Can Buy With This Year's Average $3,011 Tax Refund\n\nWill Healy | Apr 20, 2024\n\nInvestors can find Buffett-owned stocks without leaving the consumer sector.\n\nThese 3 Top E-Commerce Stocks Are No-Brainer Buys, but Not for the Reasons You Think\n\nWill Healy | Apr 20, 2024\n\nOnline sales are not the top growth driver for these e-commerce conglomerates.\n\nPrediction: This Artificial Intelligence (AI) Stock Could Be Worth More Than Microsoft 5 Years From Now\n\nHarsh Chauhan | Apr 19, 2024\n\nMicrosoft has been one of the pioneers in the field of AI, but this tech giant is also set to win big time from the growing adoption of this technology. View More AMZN Articles\n\nMaking Sense of Amazon CEO Andy Jassy's Latest Letter\n\nAnd that's just part of the interesting news for investors to dig into.\n\nMotley Fool Staff | Apr 22, 2024\n\nThe Unsinkable Shopper\n\nBlack Friday showed consumers are still ready to buy.\n\nMotley Fool Staff | Dec 5, 2023\n\nMatchmaking, Break-Ups, and a Survivor\n\nWe've got an exclusive interview with \"Survivor\" 45 contestant Emily Flippen, conducted before viewers got to meet her. Find out which three stocks she'd take to a desert island.\n\nMotley Fool Staff | Oct 4, 2023\n\nThe Business of Nightclubs\n\nRCI Hospitality CEO Eric Langan on consumer spending, capital allocation, and getting into the casino business.\n\nMotley Fool Staff | Sep 30, 2023 View More AMZN Podcasts\n\nEarnings Transcripts\n\nAmazon.com (AMZN) Q4 2023 Earnings Call Transcript\n\nAMZN earnings call for the period ending December 31, 2023.\n\nMotley Fool Transcribing | Feb 1, 2024\n\nAmazon.com (AMZN) Q3 2023 Earnings Call Transcript\n\nAMZN earnings call for the period ending September 30, 2023.\n\nMotley Fool Transcribing | Oct 26, 2023\n\nAmazon.com (AMZN) Q2 2023 Earnings Call Transcript\n\nAMZN earnings call for the period ending June 30, 2023.\n\nMotley Fool Transcribing | Aug 3, 2023\n\nAmazon.com (AMZN) Q1 2023 Earnings Call Transcript\n\nAMZN earnings call for the period ending March 31, 2023.\n\nMotley Fool Transcribing | Apr 28, 2023 View More AMZN Earnings Transcripts\n\nPremium Investing Services\n\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n\nView Premium Services", "timestamp": "2024-04-30T11:48:19", "title": "Amazon (AMZN) Stock Price, News & Info | The Motley Fool", "url": "https://www.fool.com/quote/nasdaq/amzn/"}, {"id": "web-search_4", "snippet": "Entering text into the input field will update the search result below\n\nSearch for Symbols, analysts, keywords\n\nAMZN Amazon.com, Inc.\n\nStock Price & OverviewFollow\n\n$180.125.12 (+2.92%)9:36 AM 05/01/24\n\nNASDAQ | $USD | Realtime\n\nExpand For Key Data »\n\nAmazon's cloud computing headwinds are firmly in the past: analysts\n\nAmazon Q1 2024 Earnings Update\n\nAmazon Stock Barely Moves After Solid Q1 Earnings, But It's A 'Buy'\n\nAmazon sticks with the master plan of no dividend payouts, heavy capex spending\n\nAmazon.com, Inc. (AMZN) Q1 2024 Earnings Call Transcript\n\nAmazon going all in on generative AI as 'multi-billion dollar business'\n\nAmazon Q1 Review: Best Of Big Tech Bunch\n\nAmazon: Easy Double Beat In Q1\n\nAmazon.com, Inc. 2024 Q1 - Results - Earnings Call Presentation\n\nAmazon in charts: AWS revenue climbs 17% Y/Y\n\nMore News And Analysis »\n\nAMZN Company Profile\n\nAmazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Echo, Ring, Blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company’s products offered through its stores include merchandise and content purchased for resale and products offered by third-party sellers. It serves consumers, sellers, developers, enterprises, content creators, advertisers, and employees. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.Hide\n\nConsumer Discretionary\n\n410 Terry Avenue North\n\nSeattle, WA, 98109-5210\n\nAMZN Earnings Per Share\n\nInvestor Presentations\n\nSee All SEC Filings »\n\nSee All Press Releases »\n\nAMZN Income Statement\n\nAMZN Cash Flow Statement\n\nAMZN Long Term Solvency\n\nYou may be interested in:\n\nAmazon.com, Inc. (AMZN) Frequently Asked Questions\n\nTo ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser.\n\nIs this happening to you frequently? Please report it on our feedback forum.\n\nIf you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh.", "timestamp": "2024-05-01T13:43:09", "title": "Amazon.com, Inc. (AMZN) Stock Price, Quote, News & Analysis", "url": "https://seekingalpha.com/symbol/AMZN"}, {"id": "web-search_2", "snippet": "Skip to Main ContentSkip to Search\n\nThe Wall Street Journal\n\n日本語 (Japanese)\n\nOther Products from WSJ\n\nAmazon.com Inc.AMZN (U.S.: Nasdaq)\n\nAT CLOSE 4:00 PM EST 01/12/24\n\nAFTER HOURS 7:59 PM EST 01/12/24\n\nAFTER HOURS Vol 3,643,641\n\n65 Day Avg Vol50,669,057\n\n1 Day Range154.01 - 156.20\n\n52 Week Range88.12 - 157.17(03/13/23 - 01/11/24)\n\nAdvanced ChartingCompare\n\nPrior Close 155.18(01/11/24)\n\nRetail/Wholesale 1.11%\n\nNewsAmazon.com Inc.AMZN\n\nNo significant news for AMZN in the past two years.\n\nThe Price to Earnings (P/E) ratio, a key valuation measure, is calculated by dividing the stock's most recent closing price by the sum of the diluted earnings per share from continuing operations for the trailing 12 month period.\n\nEarnings Per Share (TTM)\n\nA company's net income for the trailing twelve month period expressed as a dollar amount per fully diluted shares outstanding.\n\nMarket Capitalization\n\nReflects the total market value of a company. Market Cap is calculated by multiplying the number of shares outstanding by the stock's price. For companies with multiple common share classes, market capitalization includes both classes.\n\nNumber of shares that are currently held by investors, including restricted shares owned by the company's officers and insiders as well as those held by the public.\n\nThe number of shares in the hands of public investors and available to trade. To calculate, start with total shares outstanding and subtract the number of restricted shares. Restricted stock typically is that issued to company insiders with limits on when it may be traded.\n\nA company's dividend expressed as a percentage of its current stock price.\n\nP/E Ratio (TTM)80.73(01/12/24)\n\nShares Outstanding10.33 B\n\nYieldAMZN is not currently paying a regular dividend.\n\nThe total number of shares of a security that have been sold short and not yet repurchased.\n\nPercentage change in short interest from the previous report to the most recent report. Exchanges report short interest twice a month.\n\nTotal short positions relative to the number of shares available to trade.\n\nShort Interest (12/29/23)\n\nShares Sold Short86.33 M\n\nChange from Last-4.09%\n\nPercent of Float0.95%\n\nMoney Flow Uptick/Downtick Ratio\n\nMoney flow measures the relative buying and selling pressure on a stock, based on the value of trades made on an \"uptick\" in price and the value of trades made on a \"downtick\" in price. The up/down ratio is calculated by dividing the value of uptick trades by the value of downtick trades. Net money flow is the value of uptick trades minus the value of downtick trades. Our calculations are based on comprehensive, delayed quotes.\n\nResearch & Ratings Amazon.com Inc.(AMZN)\n\nPer-Share Earnings, Actuals and Estimates\n\nQuarterlyAnnualAMZN will report Q4 earnings on 04/25/2024\n\nActual Analyst Range Consensus\n\nQ4 2023 Estimate Trends\n\nQ1 2024 Estimate Trends\n\nFinancials Amazon.com Inc.(AMZN)\n\nSep2022Dec2022Mar2023Jun2023Sep2023\n\nSales or Revenue Growth\n\nCostco Wholesale Corp.\n\nAmazon.com, Inc. is a multinational technology company, which engages in the provision of online retail shopping services. It operates through the following segments: North America, International, and Amazon Web Services (AWS). The North America segment is involved...\n\n410 Terry Avenue North Seattle Washington 98109 United States\n\nSector Mixed Retailing\n\nSales or Revenue 513.98 B\n\nIndustry Retail/Wholesale\n\n1Y Sales Change 9.40%\n\nFiscal Year Ends December 31 Download Reports\n\nJeffrey P. Bezos Executive Chairman\n\nAndrew R. Jassy President, Chief Executive Officer & Director\n\nJohn Felton Senior Vice President-Worldwide Operations\n\nBrian T. Olsavsky Chief Financial Officer & Senior Vice President\n\nNotes & Data Providers\n\nStocks: Real-time U.S. stock quotes reflect trades reported through Nasdaq only; comprehensive quotes and volume reflect trading in all markets and are delayed at least 15 minutes. International stock quotes are delayed as per exchange requirements. Fundamental company data and analyst estimates provided by FactSet. Copyright 2019© FactSet Research Systems Inc. All rights reserved. Source: FactSet\n\nIndexes: Index quotes may be real-time or delayed as per exchange requirements; refer to time stamps for information on any delays. Source: FactSet\n\nMarkets Diary: Data on U.S. Overview page represent trading in all U.S. markets and updates until 8 p.m. See Closing Diaries table for 4 p.m. closing data. Sources: FactSet, Dow Jones\n\nStock Movers: Gainers, decliners and most actives market activity tables are a combination of NYSE, Nasdaq, NYSE American and NYSE Arca listings. Sources: FactSet, Dow Jones\n\nETF Movers: Includes ETFs & ETNs with volume of at least 50,000. Sources: FactSet, Dow Jones\n\nBonds: Bond quotes are updated in real-time. Sources: FactSet, Tullett Prebon\n\nCurrencies: Currency quotes are updated in real-time. Sources: FactSet, Tullett Prebon\n\nCommodities & Futures: Futures prices are delayed at least 10 minutes as per exchange requirements. Change value during the period between open outcry settle and the commencement of the next day's trading is calculated as the difference between the last trade and the prior day's settle. Change value during other periods is calculated as the difference between the last trade and the most recent settle. Source: FactSet\n\nData are provided 'as is' for informational purposes only and are not intended for trading purposes. FactSet (a) does not make any express or implied warranties of any kind regarding the data, including, without limitation, any warranty of merchantability or fitness for a particular purpose or use; and (b) shall not be liable for any errors, incompleteness, interruption or delay, action taken in reliance on any data, or for any damages resulting therefrom. Data may be intentionally delayed pursuant to supplier requirements.\n\nMutual Funds & ETFs: All of the mutual fund and ETF information contained in this display, with the exception of the current price and price history, was supplied by Lipper, A Refinitiv Company, subject to the following: Copyright 2019© Refinitiv. All rights reserved. Any copying, republication or redistribution of Lipper content, including by caching, framing or similar means, is expressly prohibited without the prior written consent of Lipper. Lipper shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon.\n\nCryptocurrencies: Cryptocurrency quotes are updated in real-time. Sources: CoinDesk (Bitcoin), Kraken (all other cryptocurrencies)\n\nCalendars and Economy: 'Actual' numbers are added to the table after economic reports are released. Source: Kantar Media", "timestamp": "2024-04-29T16:09:35", "title": "AMZN | Amazon.com Inc. Stock Price & News - WSJ", "url": "https://www.wsj.com/market-data/quotes/AMZN"}]}