{"text": "Here is a summary of news relating to the stock symbol PG in the past week:\n\n- Procter & Gamble has raised its dividend for the 68th consecutive year.\n- The company reported a marginal increase in its net sales – a 1% increase of $20.2 billion in its 2024 third-quarter results.\n- Procter & Gamble's stock price is predicted to increase by 4.40% from its latest price to $169.88 in the next 12 months.\n- The company has recalled over 8 million Tide Pods and other laundry detergent packets due to safety concerns.", "documents": [{"id": "web-search_2", "snippet": "Accessibility Log In Help Join The Motley Fool\n\nProcter & Gamble (NYSE: PG)\n\nPrice as of April 26, 2024, 4:00 p.m. ET\n\nProcter & Gamble Return vs. S&P\n\nProcter & Gamble Company Info\n\nProcter & Gamble Co. engages in the provision of branded consumer packaged goods. It operates through the following segments: Beauty, Grooming, Health Care, Fabric & Home Care, and Baby, Feminine & Family Care. The Beauty segment offers hair, skin, and personal care. The Grooming segment consists of shave care like female and male blades and razors, pre and post shave products, and appliances. The Health Care segment includes oral care products like toothbrushes, toothpaste, and personal health care such as gastrointestinal, rapid diagnostics, respiratory, and vitamins, minerals, and supplements. The Fabric and Home care segment consists of fabric enhancers, laundry additives and detergents, and air, dish, and surface care. The Baby, Feminine and Family Care segment sells baby wipes, diapers, and pants, adult incontinence, feminine care, paper towels, tissues, and toilet paper. The company was founded by William Procter and James Gamble in 1837 and is headquartered in Cincinnati, OH.\n\nThe Fool has written over 2,100 articles on Procter & Gamble.\n\n2 Magnificent Dividend Stocks That I'm \"Never\" Selling\n\nProcter & Gamble is an easy stock to love today, but I'm also a huge fan of Hormel Foods, which is down and out.\n\nReuben Gregg Brewer | Apr 27, 2024\n\n3 New Reasons to Like This Magnificent Dividend Stock\n\nProcter & Gamble just hiked its dividend for the 68th consecutive year.\n\nDemitri Kalogeropoulos | Apr 26, 2024\n\n1 Dominant Company That Just Raised Its Dividend for the 68th Straight Year: Time to Buy the Stock?\n\nNeil Patel | Apr 20, 2024\n\nA history of rising payouts has made this a favorite among income investors.\n\n3 Stocks That Could Create Lasting Generational Wealth\n\nReuben Gregg Brewer | Apr 20, 2024\n\nThese are boring companies, but boring can be powerful when you look to create wealth that lasts for generations.\n\nIs Procter & Gamble's New Dividend Too Good to Pass Up?\n\nDemitri Kalogeropoulos | Apr 17, 2024\n\nThe company just announced its 67th consecutive annual dividend hike.\n\n1 Wall Street Analyst Thinks Procter & Gamble Stock Is Going to $172. Is It a buy?\n\nEric Volkman | Apr 4, 2024\n\nA reliable and generous dividend anchors one of the strongest consumer goods businesses on the scene.\n\n3 Reasons to Buy Procter & Gamble Stock Like There's No Tomorrow\n\nJames Brumley | Mar 30, 2024\n\nIt's never going to be a high-growth name, but what P&G lacks in growth it more than makes up for in other ways.\n\nBetter Dividend Stock: Procter & Gamble vs. Walmart\n\nDemitri Kalogeropoulos | Mar 25, 2024\n\nLet's compare two of the Dow's biggest dividend payers. View More PG Articles\n\nWhat's Happening With Netflix?\n\nFind out what may have caused the big jump in this video streaming giant's growth.\n\nChris Hill | Jan 27, 2021\n\n4 Biggest Consumer Goods Trends in 2020\n\nHow we shop, what we buy, and even what we think about brands has shifted significantly this year, and some companies were better-prepared for the changes than others.\n\nAsit Sharma | Oct 16, 2020\n\nWhat's Procter & Gamble Doing Right? Essentially, Everything.\n\nRestructuring has reinvigorated the company.\n\nMotley Fool Staff | Aug 4, 2019\n\nDividends' Importance, Pinterest's Caution, and Sports Betting's Potential\n\nWith P&G hitting a new share price high, the social media niche player preparing to IPO, and March Madness reaching its finale, investors have a lot to consider.\n\nChris Hill | Apr 10, 2019\n\nEarnings Transcripts\n\nThe Procter & Gamble Company (PG) Q1 2022 Earnings Call Transcript\n\nPG earnings call for the period ending September 30, 2021.\n\nMotley Fool Transcribers | Oct 19, 2021\n\nThe Procter & Gamble Company (PG) Q4 2021 Earnings Call Transcript\n\nPG earnings call for the period ending June 30, 2021.\n\nMotley Fool Transcribers | Jul 30, 2021\n\nProcter & Gamble Co (PG) Q3 2021 Earnings Call Transcript\n\nPG earnings call for the period ending March 31, 2021.\n\nMotley Fool Transcribers | Apr 20, 2021\n\nProcter & Gamble Co (PG) Q2 2021 Earnings Call Transcript\n\nPG earnings call for the period ending December 31, 2020.\n\nMotley Fool Transcribers | Jan 20, 2021 View More PG Earnings Transcripts\n\nReckitt Benckiser Group Plc\n\nPremium Investing Services\n\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n\nView Premium Services", "timestamp": "2024-04-28T15:08:22", "title": "Procter & Gamble (PG) Stock Price, News & Info | The Motley Fool", "url": "https://www.fool.com/quote/nyse/pg/"}, {"id": "web-search_5", "snippet": "Skip to main content\n\nThe Procter & Gamble Company (PG)\n\nNYSE: PG · IEX Real-Time Price · USD\n\nApr 25, 2024, 2:21 PM EDT - Market open\n\nThe Procter & Gamble Company provides branded consumer packaged goods worldwide. It operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, and SK-II brands. The Grooming segment provides shave care products and... [Read more]\n\nIndustry Household & Personal Products\n\nSector Consumer Staples\n\nTicker Symbol PG Full Company Profile\n\nFinancial Performance\n\nIn 2023, PG's revenue was $82.01 billion, an increase of 2.27% compared to the previous year's $80.19 billion. Earnings were $14.65 billion, a decrease of -0.60%.\n\nFinancial Statements\n\nAccording to 18 analysts, the average rating for PG stock is \"Buy.\" The 12-month stock price forecast is $169.88, which is an increase of 4.40% from the latest price.\n\nAnalyst Consensus: Buy\n\nGillette Venus Supports The Saltwater Collective to Launch New Size-inclusive Swimwear Collection\n\nTORONTO--(BUSINESS WIRE)-- #AnyBodyIsABeachBody--Gillette Venus announced today a new partnership with Canadian swimwear brand, The Saltwater Collective, expanding on their ‘Any Body is a Beach Body' ...\n\n1 day ago - Business Wire\n\nIs Procter & Gamble Stock Appropriately Priced At $160?\n\nProcter & Gamble Procter & Gamble (NYSE: PG) recently reported its Q3'24 results (P&G's fiscal ends in June), with revenues missing but earnings exceeding street estimates. The company reported revenu...\n\nTide and Walmart Team Up to Expand Adoption of Washing in Cold with Consumers: For the Love of Their Laundry, Their Wallets and the Planet\n\nCINCINNATI--(BUSINESS WIRE)--Tide®, America's #1 trusted laundry detergent1, and Walmart, America's largest retailer2, announced a joint effort today to help Americans make a smart, more sustainable c...\n\n3 days ago - Business Wire\n\nP&G: Shoppers Are Done Trading Down to Private-Label\n\nMany consumers may have traded down to private-label brands in earlier stages of the current period of high inflation, but now, according to Procter & Gamble, shoppers are consistently staying loyal t...\n\nFinal Trades: Micron, P&G and Uber\n\nThe Investment Committee give you their top stocks to watch for the second half.\n\nOther symbols: MUUBER\n\n6 days ago - CNBC Television\n\nProcter & Gamble Stock Slips Despite Earnings Beat as Q3 Sales Miss Estimates\n\nProcter & Gamble (PG) reported third-quarter earnings Friday that beat estimates, though its revenue missed expectations, sending shares 1% lower in pre-market trading.\n\n6 days ago - Investopedia\n\nP&G CEO Jon Moeller on Q3 results: A complicated but very encouraging picture\n\nP&G chairman, president and CEO Jon Moeller joins 'Squawk Box' to break down the company's quarterly earnings results, strength of the consumer, growth outlook and more.\n\n6 days ago - CNBC Television\n\nProcter & Gamble Turns in Mixed Quarter as Earnings Beat but Sales Miss\n\nThe consumer product goods company raises fiscal-year earnings guidance.\n\n6 days ago - Barrons\n\nProcter & Gamble (P&G) sees lackluster sales increase in latest earnings, but sweetens the deal with EPS\n\nProcter & Gamble (NYSE:PG) announced their 2024 third quarter results today on April 19th. The company managed a marginal increase in its net sales – a 1% increase of $20.2 billion.\n\nProcter & Gamble raises earnings forecast but quarterly sales disappoint\n\nProcter & Gamble raises earnings forecast but quarterly sales disappoint\n\nProcter & Gamble's stock slips after profit beat expectations but revenue came up short\n\nShares of Procter & Gamble Co. PG, +0.86% slipped 0.5% in premarket trading Friday, after the consumer packaged-goods company reported fiscal third-quarter profit that rose above expectations and lift...\n\n6 days ago - Market Watch\n\nP&G Announces Fiscal Year 2024 Third Quarter Results\n\nCINCINNATI--(BUSINESS WIRE)--The Procter & Gamble Company (NYSE:PG) reported third quarter fiscal year 2024 net sales of $20.2 billion, an increase of one percent versus the prior year. Organic sales,...\n\n6 days ago - Business Wire\n\nTechnical Support: PG, AXP & NFLX\n\nJessica Inskip, Options Play director of product, joins 'Power Lunch' to give the read on chart technicals for a few stocks.\n\nOther symbols: NFLXAXP\n\n8 days ago - CNBC Television\n\nWhat You Need To Know Ahead of Procter & Gamble's Earnings Report\n\nWhile Procter & Gamble (PG) is expected to continue to report higher revenue when it releases quarterly earnings on Friday, analysts are anticipating that the consumer products maker will slow its pri...\n\n8 days ago - Investopedia\n\nP&G Professional Helps Restaurants Work Smarter, Not Harder with Dawn Professional Products They Can Trust to Clean More Efficiently\n\nCINCINNATI--(BUSINESS WIRE)--For foodservice professionals, it's time to work smarter, not harder. According to a recent SWNS Survey, 56% of small business and restaurant professionals wish they could...\n\n9 days ago - Business Wire\n\nTide's Loads of Hope Celebrates National Laundry Day with Donation to Ronald McDonald House Charities® (RMHC) Canada\n\nTORONTO--(BUSINESS WIRE)--To celebrate national laundry day, Tide, Canada's #1 trusted laundry detergent brand*, has announced a two-year commitment to RMHC Canada. As part of the brand's Ambition 203...\n\n10 days ago - Business Wire\n\nEarnings setup: UnitedHealth, Johnson & Johnson, Genuine Parts, P&G, Taiwan Semi & American Express\n\nThe Investment Committee give you their earnings setup for next week.\n\nOther symbols: AXPGPCJNJTSMUNH\n\n13 days ago - CNBC Television\n\nFor Real Life. Pampers Easy Ups Launches New Prints Featuring Bluey\n\nCINCINNATI--(BUSINESS WIRE)--Parents look forward to celebrating many milestones with their babies, but potty training is one milestone that can feel more like a challenge, leaving parents and kids di...\n\n15 days ago - Business Wire\n\nP&G Declares Dividend Increase\n\nCINCINNATI--(BUSINESS WIRE)--The Board of Directors of The Procter & Gamble Company (NYSE:PG) declared an increased quarterly dividend of $1.0065 per share on the Common Stock and on the Series A and ...\n\n15 days ago - Business Wire\n\nOver 8 million bags of Tide, Gain laundry detergent packets recalled due to ‘serious injury' risk\n\nThe recall includes certain lot codes of Tide Pods, Gain Flings, Ace Pods, and Ariel Pods liquid laundry detergent packets\n\nTide Pods and other Procter & Gamble detergents recalled due to faulty packaging\n\nProcter & Gamble Co. on Friday recalled 8.2 million packages of Tide Pods and other laundry detergents in packet format sold in the U.S., blaming the recall on faulty bags.\n\n19 days ago - Market Watch\n\nProcter & Gamble Recalls More Than 8 Million Tide Pods And Other Laundry Detergent Packets\n\nProcter & Gamble announced a voluntary recall Friday of more than 8 million defective bags of Tide Pod and other laundry detergent packets amid safety concerns, after receiving multiple reports of chi...\n\n20 days ago - Forbes\n\nP&G recalls 8.2 mln defective laundry pod bags in US amid safety concerns\n\nProcter & Gamble is recalling 8.2 million defective bags of some of its laundry detergent pods in the U.S. due to a packaging flaw that could pose a risk of injury to children, the Tide maker said on ...\n\n20 days ago - Reuters\n\nProcter & Gamble Voluntarily Recalling Some Laundry Detergent Packets\n\nThe recall affects Tide Pods, Gain Flings, Ace Pods and Ariel Pods liquid laundry detergent packets packaged in flexible film bags.\n\nProcter & Gamble Recalls 8.2 Million Defective Bags of Tide, Gain, Ace and Ariel Laundry Detergent Packets Distributed in US Due to Risk of Serious Injury\n\nCINCINNATI--(BUSINESS WIRE)--Procter & Gamble (NYSE:PG) today announced a voluntary packaging recall of Tide Pods, Gain Flings, Ace Pods and Ariel Pods liquid laundry detergent packets packaged in fle...\n\n20 days ago - Business Wire", "timestamp": "2024-04-25T18:28:07", "title": "The Procter & Gamble Company (PG) Stock Price, Quote & News - Stock Analysis", "url": "https://stockanalysis.com/stocks/pg/"}, {"id": "web-search_3", "snippet": "Entering text into the input field will update the search result below\n\nSearch for Symbols, analysts, keywords\n\nJoin the Seeking Alpha community\n\nCreate a free account to gain access to news, analysis, and real-time alerts on the stocks you follow. Create free account\n\nJoin the Seeking Alpha community\n\nCreate a free account to gain access to news, analysis, and real-time alerts on the stocks you follow. Create free account\n\nJoin the Seeking Alpha community\n\nCreate a free account to gain access to news, analysis, and real-time alerts on the stocks you follow. Create free account\n\nPG The Procter & Gamble Company\n\nStock Price & OverviewFollow\n\n$148.07-0.07 (-0.05%)2:51 PM 01/19/24\n\nNYSE | $USD | Realtime\n\nExpand For Key Data »\n\nProcter & Gamble Is Set For An Earnings Surprise\n\nDividend Roundup: Proctor & Gamble, Citigroup, Caterpillar, CVS Health, and more\n\nConsumer Staples stocks on radar ahead of Q4 earnings\n\nProcter & Gamble declares $0.9407 dividend\n\nProcter & Gamble: Navigating The Shift From Price To Volumes\n\nProcter & Gamble: Time To Load Up On This 2.5% Yielding Dividend King\n\nProcter & Gamble: Still A Sell Heading Into 2024\n\nProcter & Gamble: Price And Volume Growth Mix Might Shift Back To Normal Soon\n\n30 Stocks shunned by hedge and mutual funds - GS\n\nTop stocks with highest hedge fund + mutual fund positions, according to GS\n\nMore News And Analysis »\n\nLocked. Go Premium to see thisview ratings\n\nNot CoveredRating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nNot CoveredRating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nNot CoveredRating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nSee PG ratings with Premium.\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nLocked. Go Premium to see thisview ratings\n\nLocked. Go Premium to see thisview ratings\n\n-Rating: Not Covered\n\nThe Procter & Gamble Company provides branded consumer packaged goods worldwide. It operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, and SK-II brands. The Grooming segment provides shave care products and appliances under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, rapid diagnostics, respiratory, vitamins/minerals/supplements, pain relief, and other personal health care products under the Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, taped diapers, and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. The company sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The Procter & Gamble Company was founded in 1837 and is headquartered in Cincinnati, Ohio.Hide\n\nOne Procter & Gamble Plaza\n\nCincinnati, OH, 45202\n\nTo ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser.\n\nIs this happening to you frequently? Please report it on our feedback forum.\n\nIf you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh.", "timestamp": "2024-03-19T20:25:16", "title": "The Procter & Gamble Company (PG) Stock Price, Quote, News & Analysis", "url": "https://seekingalpha.com/symbol/PG"}]}