{"text": "Here is a summary of recent news relating to META that may influence a buy/sell decision:\n- Meta's stock price has been on an uptrend, with 17 out of 19 weeks of upside movement.\n- Meta is one of the \"Magnificent Four\" tech stocks, along with Nvidia, Microsoft, and Amazon, that continue to spearhead gains.\n- Meta gets billions from China without the headaches many U.S. companies face there.\n- Meta's Q1 earnings preview: there are questions about whether ad growth can keep up with AI spending.\n- Mark Zuckerberg announced that Meta will offer its virtual reality OS to hardware companies, creating an iPhone versus Android dynamic.", "documents": [{"id": "web-search_0", "snippet": "Futures & Commodities\n\nEquity and Opportunity\n\nHelp for Low Credit Scores\n\nFind the Credit Card for You\n\nBest Rewards Credit Cards\n\nBest Travel Credit Cards\n\nBest 0% APR Credit Cards\n\nBest Balance Transfer Credit Cards\n\nBest Cash Back Credit Cards\n\nBest Credit Card Welcome Bonuses\n\nBest Credit Cards to Build Credit\n\nFind the Best Personal Loan for You\n\nBest Debt Consolidation Loans\n\nBest Loans to Refinance Credit Card Debt\n\nBest Loans with Fast Funding\n\nBest Small Personal Loans\n\nBest Large Personal Loans\n\nBest Personal Loans to Apply Online\n\nBest Student Loan Refinance\n\nFind the Savings Account for You\n\nBest High Yield Savings Accounts\n\nBest Big Bank Savings Accounts\n\nBest Big Bank Checking Accounts\n\nBest No Fee Checking Accounts\n\nNo Overdraft Fee Checking Accounts\n\nBest Checking Account Bonuses\n\nBest Money Market Accounts\n\nBest Mortgages for Small Down Payment\n\nBest Mortgages for No Down Payment\n\nBest Mortgages with No Origination Fee\n\nBest Mortgages for Average Credit Score\n\nAdjustable Rate Mortgages\n\nAffording a Mortgage\n\nBest Homeowners Insurance\n\nBest Renters Insurance\n\nAll Credit Monitoring\n\nBest Credit Monitoring Services\n\nBest Identity Theft Protection\n\nHow to Boost Your Credit Score\n\nCredit Repair Services\n\nAll Personal Finance\n\nBest Expense Tracker Apps\n\nBest Money Transfer Apps\n\nBest Resale Apps and Sites\n\nBuy Now Pay Later (BNPL) Apps\n\nBest Small Business Savings Accounts\n\nBest Small Business Checking Accounts\n\nBest Credit Cards for Small Business\n\nBest Small Business Loans\n\nBest Tax Software for Small Business\n\nBest Tax Software for Small Businesses\n\nAll Help for Low Credit Scores\n\nBest Credit Cards for Bad Credit\n\nBest Personal Loans for Bad Credit\n\nBest Debt Consolidation Loans for Bad Credit\n\nPersonal Loans if You Don't Have Credit\n\nBest Credit Cards for Building Credit\n\nPersonal Loans for 580 Credit Score or Lower\n\nPersonal Loans for 670 Credit Score or Lower\n\nBest Mortgages for Bad Credit\n\nHow to Boost Your Credit Score\n\nBest Roth IRA Accounts\n\nBest Free Stock Trading Platforms\n\nSearch quotes, news & videos\n\nMeta Platforms Inc META:NASDAQ\n\nRT Quote | Last NASDAQ LS, VOL From CTA | USD\n\n482.76+1.69 (+0.35%)\n\n52 Week High Date04/08/24\n\n52 Week Low Date04/25/23\n\n10 Day Average Volume13.35M\n\nYTD % Change37.7Show Ratios / Profitability & Events\n\nSummaryNewsProfileEarningsPeersFinancialsOptionsOwnership\n\n52 Week High Date04/08/24\n\n52 Week Low Date04/25/23\n\n10 Day Average Volume13.35M\n\nRATIOS/PROFITABILITY\n\nRevenue (TTM)134.901B\n\nGross Margin (TTM)80.72%\n\nNet Margin (TTM)29.83%\n\nDebt To Equity (MRQ)12.45%\n\nEarnings Date04/24/2024\n\nEx Div Date02/21/2024\n\nLatest On Meta Platforms Inc\n\nALL CNBCINVESTING CLUBPRO\n\nJim Cramer's top 10 things to watch in the stock market Monday49 Min AgoCNBC.com\n\nMonday's top analyst calls: Apple, Nvidia, Tesla, Meta, Amazon, Spotify, Ferrari2 Hours AgoCNBC.com\n\n5 things to know before the stock market opens Monday3 Hours AgoCNBC.com\n\nMeta gets billions from China without headaches many U.S. companies face there4 Hours AgoCNBC.com\n\nS&P 500 rises to start the week, tries to snap 6-day decline16 Hours AgoCNBC.com\n\nContent From Our Affiliates\n\nAnalysts Are Neutral on These Communication Services Stocks: Meta Platforms (META), Snap (SNAP)3 Hours AgoTipRanks\n\nMGK, XLG: 2 Best “Magnificent Seven” ETFs with Over 15% Upside, According to Analysts4 Hours AgoTipRanks\n\nOptimistic Outlook for Meta Platforms: A Comprehensive Analysis of Growth Potential and Strategic AI Initiatives4 Hours AgoTipRanks\n\nJMP Securities Sticks to Its Buy Rating for Meta Platforms (META)9 Hours AgoTipRanks\n\nTikTok to remove executive tasked with fending off U.S. claims, Bloomberg saysApril 21, 2024TipRanks\n\nFinal Trade: UNH, XLU, EXC, META\n\nMeta Platforms, Inc. builds technology that helps people connect and share, find communities, and grow businesses. The Company’s products enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality (VR) and mixed reality (MR) headsets, and wearables. It operates through two segments: Family of Apps (FoA) and Reality Labs (RL). The FoA segment includes Facebook, Instagram, Messenger, Threads and WhatsApp. The RL...More\n\nChairman of the Board, Chief Executive Officer, Founder\n\nChief Operating Officer\n\nChief Financial Officer\n\nChief Technology Officer\n\nJennifer Newstead J.D.\n\nhttps://www.meta.com/", "timestamp": "2024-04-25T20:42:21", "title": "META: Meta Platforms Inc - Stock Price, Quote and News - CNBC", "url": "https://www.cnbc.com/quotes/META"}, {"id": "web-search_1", "snippet": "Skip to Main Content\n\nSkip to Related Content\n\nSign in to view your mail\n\nU.S. markets open in 1 hour 50 minutes\n\nRussell 2000 Futures\n\nMeta Platforms, Inc. (META)\n\nNasdaqGS - NasdaqGS Real Time Price. Currency in USD\n\nVisitors trend2W10W9M\n\nAt close: 04:00PM EDT\n\n(-0.28%) Pre-Market:\n\nTrade prices are not sourced from all markets\n\nGain actionable insight from technical analysis on financial instruments, to help optimize your trading strategies\n\nBearishpattern detected\n\nInside Bar (Bearish)\n\nView all chart patterns\n\nNasdaq Bid/Ask data are currently unavailable.\n\nNasdaq Bid/Ask data are currently unavailable.\n\nForward Dividend & Yield\n\nFair Value is the appropriate price for the shares of a company, based on its earnings and growth rate also interpreted as when P/E Ratio = Growth Rate. Estimated return represents the projected annual return you might expect after purchasing shares in the company and holding them over the default time horizon of 5 years, based on the EPS growth rate that we have projected.\n\nSubscribe to Yahoo Finance Plus to view Fair Value for METALearn more\n\nResearch that delivers an independent perspective, consistent methodology and actionable insight\n\nMeta Platforms, Inc.\n\nTechnical Assessment: Neutral in the Intermediate-TermWe are one session away from making it 17 out of 19 weeks in which stocks have moved to the upside. We've been throwing grenades at this move for a while, based on overbought and divergent momentum readings and excessive sentiment readings -- and it just does not matter. Yes, price is the final arbiter!\n\n25 days agoArgus Research\n\nTechnical Assessment: Neutral in the Intermediate-TermWe are one session away from making it 17 out of 19 weeks in which stocks have moved to the upside. We've been throwing grenades at this move for a while, based on overbought and divergent momentum readings and excessive sentiment readings -- and it just does not matter. Yes, price is the final arbiter!\n\n25 days ago•Argus ResearchView more\n\nHow the 'Magnificent 7' became the 'Mag 4'\n\nAs the first quarter of 2024 draws to a close, the once-dominant \"Magnificent Seven\" tech stocks appear to be fragmenting. The group, which previously consisted of seven leading technology companies, has now dwindled to the \"Magnificent Four.\" Nvidia (NVDA), Microsoft (MSFT), Meta (META), and Amazon (AMZN) continue to spearhead gains, while Tesla (TSLA), Apple (AAPL), and Alphabet (GOOG, GOOGL) have underperformed compared to their peers. Yahoo Finance's Jared Blikre and Madison Mills discuss the details. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith\n\nAdTheCapitalReport.com\n\nTop AI Stocks Trending in 2024\n\nWhich A.I. stocks are better for investors right now?\n\nAI-powered stocks will face increasingly stiff competition: Analyst\n\nThe tech sector has been on a run with chip powerhouse Nvidia (NVDA) leading the charge with an incredible 86% gain year-to-date. Many of the big names in tech — Amazon (AMZN), Apple (AAPL), Alphabet (GOOG, GOOGL), Nvidia (NVDA), Meta (META), Microsoft (MSFT), and Tesla (TSLA) — have been grouped together and referred to as The Magnificent Seven, but some, like Apple and Tesla, have fallen off from great heights. Now, investors are chattering over whether or not tech can weather any potential storms in the market. TECHnalysis Research President and Chief Analyst Bob O'Donnell joins Yahoo Finance to break down the recent movements in the tech sector and how its major players can operate moving forward. O'Donnell talks about potential leaders in tech for the long-term: \"The one thing is, Nvidia's got 90% share. Anybody who's got 90% share is going to lose a little share. But, that doesn't mean they still can't grow organically from where they are. You're just going to see a lot more competitors. If we look at it collectively, I still think there is several years of growth in the collective semiconductor market for AI-powered stuff. So, you're going to see, as I said, I talked about AMD (AMD). Intel (INTC) will be interesting to see.\" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino\n\nData DisclaimerHelpSuggestions\n\nTermsandPrivacy Policy\n\nAbout Our AdsSitemap\n\n© 2024 Yahoo. All rights reserved.", "timestamp": "2024-04-25T23:44:54", "title": "Meta Platforms, Inc. (META) Stock Price, News, Quote & History - Yahoo Finance", "url": "https://finance.yahoo.com/quote/META/"}, {"id": "web-search_2", "snippet": "Range Dropdown Markets\n\nLatest News All Times Eastern\n\nscroll up scroll down\n\n5:23p Blizzard closes key Northern California highway, with more snow in the forecast\n\n5:16p Netanyahu rival visits U.S., signaling wider cracks in Israel’s wartime leadership\n\n4:58p Trader Joe’s chicken soup dumplings recalled for possibly containing hard plastic\n\n4:54p Voting rights are under attack, Attorney General Merrick Garland says in Alabama on anniversary of ‘Bloody Sunday’\n\n4:50p Taylor Swift, ‘3 Body Problem,’ ‘Shōgun’ highlight a blockbuster March for streaming\n\n4:25p Barron's ‘Dune: Part Two’ Soars Past Box Office Expectations\n\n4:03p OPEC+ extends oil-production cuts, signaling no rush to restore lost volume\n\n3:52p Iowa’s Caitlin Clark breaks Pete Maravich’s NCAA Division I scoring record\n\n3:48p Supreme Court decision on banning Trump from 2024 ballot could come Monday\n\n3:40p February job report and Powell’s visit to Capitol Hill are on investors’ radar this week\n\nSet a price target alert\n\nMar 1, 2024 7:59 p.m. EST Delayed quote\n\nToggle Chart Options\n\nVolume: 15.88M 65 Day Avg: 18.7M\n\n491.85 Day Range 504.25\n\n174.82 52 Week Range 504.25\n\nCustomize MarketWatch\n\nHave Watchlists? Log in to see them here or sign up to get started.\n\nCreate Account … or Log In\n\n(Go to Your Watchlist)\n\nNo Items in Watchlist\n\nThere are currently no items in this Watchlist.\n\nCreate a list of the investments you want to track.\n\nCreate Watchlist …or learn more\n\nSomething went wrong while loading Watchlist.\n\nRecently Viewed Tickers\n\nVisit a quote page and your recently viewed tickers will be displayed here.\n\nOverview More Content\n\nDay Range 491.85 - 504.25\n\n52 Week Range 174.82 - 504.25\n\nShares Outstanding 2.21B\n\nRev. per Employee $2.004M\n\nEx-Dividend Date Feb 21, 2024\n\nShort Interest 29.87M 02/15/24\n\n% of Float Shorted 1.36%\n\nAverage Volume 18.7M\n\nBuy Number of Ratings 63 Full Ratings\n\nMarketWatch Dow Jones\n\nOpinion How the U.S. economy could slide into a Japan-like ‘lost decade’\n\nMar. 2, 2024 at 11:44 a.m. ET by Peter Morici\n\nOpinion AI, software and semiconductor stocks are too popular for their own good\n\nMar. 2, 2024 at 7:36 a.m. ET by Cody Willard\n\nAI is fueling a gold rush in new data centers, the hottest buildings in real estate\n\nMar. 2, 2024 at 5:44 a.m. ET by Joy Wiltermuth\n\nMeta Platforms Inc. stock outperforms competitors on strong trading day\n\nMar. 1, 2024 at 4:30 p.m. ET by MarketWatch Automation\n\nCompanies are pulling back on DEI. What will be lost in the process?\n\nMar. 1, 2024 at 3:44 p.m. ET by Bill Peters\n\nCompanies Google Faces a Real AI Threat in Search. Why It Might Be Time to Worry.\n\nMar. 1, 2024 at 3:36 p.m. ET by Barron's\n\nIPOs Reddit’s IPO Is Generating Buzz. Why One Analyst Sees a Valuation Above $10 Billion.\n\nMar. 1, 2024 at 12:51 p.m. ET by Barron's\n\nMeet the new 'AI factories'\n\nMar. 1, 2024 at 12:34 p.m. ET by Joy Wiltermuth\n\nMeta Says It Won't Renew Deals With News Publishers in Australia, U.S.\n\nMar. 1, 2024 at 12:17 a.m. ET\n\nMeta Platforms Inc. stock outperforms competitors on strong trading day\n\nFeb. 29, 2024 at 4:30 p.m. ET by MarketWatch Automation\n\nTechnology Duolingo Stock Is Surging. Its TikTok Videos Crushed AI Fears.\n\nFeb. 29, 2024 at 10:59 a.m. ET by Barron's\n\nMeta Platforms Inc. stock outperforms competitors despite losses on the day\n\nFeb. 28, 2024 at 4:30 p.m. ET by MarketWatch Automation\n\nTechnology Meta Turns to LG to Hit Back at Apple Vision Pro, and Other Technology News Today\n\nFeb. 28, 2024 at 9:58 a.m. ET by Barron's\n\nMeta Platforms Inc. stock outperforms competitors on strong trading day\n\nFeb. 27, 2024 at 4:30 p.m. ET by MarketWatch Automation\n\nTechnology Microsoft Partners With an OpenAI Rival, and Other Technology News Today\n\nFeb. 27, 2024 at 10:58 a.m. ET by Barron's\n\nTechnology Micro-Bubbles Are Lurking in the Stock Market. How to Steer Clear of Iffy Picks.\n\nFeb. 27, 2024 at 9:04 a.m. ET by Barron's\n\nTechnology Alphabet Stock Is ‘Cheap for a Reason.’ It’s Losing Its Competitive Advantage, Analyst Says.\n\nFeb. 26, 2024 at 10:20 a.m. ET by Barron's\n\nMarkets Amazon, Alphabet, Meta, and 12 More Stocks Wall Street Loves for 2024\n\nSep. 12, 2023 at 9:12 a.m. ET by Barron's\n\nTechnology The ‘Godfather of AI’ Says Doomsayers Are Wrong and ChatGPT Isn’t All That Innovative\n\nApr. 13, 2023 at 8:58 a.m. ET by Barron's\n\nMarkets How Big Tech Became the New Defensive Stock Play\n\nMar. 18, 2023 at 12:28 p.m. ET by Barron's\n\nNo Headlines Available\n\nNo Headlines Available\n\nNo Headlines Available\n\nOther News Press Releases\n\nCathie Wood's Ark Invest Is Selling Nvidia Stock and Buying This Artificial Intelligence (AI) Stock\n\nMar. 3, 2024 at 2:58 p.m. ET on Motley Fool\n\nBillionaire Dan Loeb Has 27% of His Third Point Portfolio in 3 Brilliant \"Magnificent Seven\" Stocks, but Completely Sold Out of Another\n\nMar. 3, 2024 at 1:08 p.m. ET on Motley Fool\n\nPortfolio Pillars: 3 Dividend Growers for Enduring Wealth\n\nMar. 3, 2024 at 1:00 p.m. ET on InvestorPlace.com\n\nWill Meta Platforms Be Worth More Than Apple by 2030?\n\nMar. 2, 2024 at 11:30 a.m. ET on Motley Fool\n\nMichael Dell Is Now Part Of The $100 Billion Club Thanks To Soaring Shares Fueled By AI Craze: Report\n\nMar. 2, 2024 at 11:08 a.m. ET on Benzinga.com\n\nMeta Platform Stock's New Dividend: Everything You Need to Know\n\nMar. 2, 2024 at 9:31 a.m. ET on Motley Fool\n\nThe Only 7 Tech Stocks You Should Be Watching Now\n\nMar. 2, 2024 at 6:15 a.m. ET on InvestorPlace.com\n\nUp 181%, You Might Think It's Too Late to Buy Meta Platforms Stock. Here's Why There's Still Time.\n\nMar. 2, 2024 at 6:00 a.m. ET on Motley Fool\n\nBillionaires David Tepper and George Soros Both Own These \"Magnificent Seven\" Stocks. Should You?\n\nMar. 2, 2024 at 5:49 a.m. ET on Motley Fool\n\nBuying This Tech Stock Could Be Like Buying Meta Platforms in 2022\n\nMar. 2, 2024 at 5:15 a.m. ET on Motley Fool\n\nAndreas Halvorsen Increases Stake in APi Group Corp\n\nAndreas Halvorsen Increases Stake in APi Group Corp\n\nMar. 1, 2024 at 11:38 p.m. ET on GuruFocus.com\n\nMeme Stocks or Blue Chips? The 7 Best Places to Put Your Money in 2024 \n\nMar. 1, 2024 at 4:00 p.m. ET on InvestorPlace.com\n\nTech Rally Or Dotcom Déjà Vu? The Magnificent Seven's Secret Sauce Unveiled\n\nMar. 1, 2024 at 3:06 p.m. ET on Benzinga.com\n\nWhat's Going On With Meta Stock?\n\nMar. 1, 2024 at 2:04 p.m. ET on Benzinga.com\n\nS&P 500, Nasdaq 100 Hit Record Highs As Dollar, Treasury Yields Weaken, Chipmakers Shine, NYCB Sinks: What's Driving Markets Friday?\n\nMar. 1, 2024 at 1:30 p.m. ET on Benzinga.com\n\nMeta (NASDAQ:META) Enrages Australia over News\n\nMar. 1, 2024 at 1:18 p.m. ET on TipRanks.com\n\n3 Metaverse Innovators: The AI Stocks to Own Now\n\nMar. 1, 2024 at 1:04 p.m. ET on InvestorPlace.com\n\nMore Rally Awaits ETFs as Nvidia Hovers Around $2Tn Market Cap?\n\nMar. 1, 2024 at 1:00 p.m. ET on Zacks.com\n\nTop Analyst Reports for Apple, Meta Platforms & Intel\n\nMar. 1, 2024 at 12:46 p.m. ET on Zacks.com\n\nGamma Squeeze In AMD, Musk Sues OpenAI, Unthinkable Move On Apple\n\nMar. 1, 2024 at 12:34 p.m. ET on Benzinga.com\n\nNo Headlines Available\n\nNo Headlines Available\n\nNo Headlines Available\n\nMeta Platforms, Inc. engages in the development of social media applications. It builds technology that helps people connect and share, find communities, and grow businesses. It operates through the Family of Apps (FoA) and Reality Labs (RL) segments. The FoA segment consists of Facebook, Instagram, Messenger, WhatsApp, and other services. The RL segment includes augmented, mixed and virtual reality related consumer hardware, software, and content. The company was founded by Mark Elliot Zuckerberg, Dustin Moskovitz, Chris R. Hughes, Andrew McCollum, and Eduardo P. Saverin on February 4, 2004, and is headquartered in Menlo Park, CA.\n\nClose Trending Tickers bar\n\nAbove average volume.\n\nAccess Premium Tools\n\nRecently Viewed Tickers\n\nVisit a quote page and your recently viewed tickers will be displayed here.\n\nAll News Articles Video Podcasts\n\nThis browser is no longer supported at MarketWatch. For the best MarketWatch.com experience, please update to a modern browser.\n\nChrome Safari Firefox Edge", "timestamp": "2024-04-25T20:42:04", "title": "META Stock Price | Meta Platforms Inc. Stock Quote (U.S.: Nasdaq) | MarketWatch", "url": "https://www.marketwatch.com/investing/stock/meta"}, {"id": "web-search_3", "snippet": "Marathon Digital Holdings Inc\n\nDow Jones Today: U.S. Stock Futures Tick Up as Earnings Season Rolls On• Investopedia• 2 hours ago\n\nApr 23, 10:53:08 AM GMT-4 · USD · NASDAQ · Disclaimer\n\nKey events shows relevant news articles on days with large price movements\n\nKey events shows relevant news articles on days with large price movements\n\nKey eventsarrow_forward_ios\n\nKey events shows relevant news articles on days with large price movements\n\nAlphabet Inc Class C\n\nAlphabet Inc Class A\n\nSuper Micro Computer Inc\n\nPalantir Technologies Inc\n\nUnfortunate News for Meta Stock and Apple Stock Investors\n\nMeta Platforms: Expect Shares To Pop On Strong Earnings, Again (NASDAQ:META)\n\nInvestor's Business Daily\n\nMeta Stock Q1 Preview: Can Ads Growth Keep Up With AI Spending?\n\nTesla earnings report\n\nTesla, Meta And Other Earnings Will Test Stocks' Recent Selloff\n\nWeekly Preview: Earnings to Watch This Week 4-21-24 (GOOG, META, MSFT, TSLA)\n\nAI To Take Center Stage in This Week's Big Tech Earnings\n\nQ1 earnings forecast for Meta\n\nMeta (NASDAQ:META) Q1 Earnings: Here's What to Expect - TipRanks.com\n\nMeta faces ‘extraordinarily high expectations.’ Can earnings clear the bar?\n\nmarkets.businessinsider.com\n\nTech Earnings: What Wall Street Is Eyeing for Mega-Cap Firms\n\nElon Musk's 'not bad' review thrusts Meta's Llama 3 AI into spotlight\n\n3 Must-Watch AI Stocks With Massive Long-Haul Potential\n\nMicrosoft, Meta, AMD, Palantir, and Other Tech Stocks in Focus Today\n\nMark Zuckerberg says Meta will offer its virtual reality OS to hardware companies, creating iPhone versus Android dynamic\n\nFiscal Q4 2023 ended 12/31/23. Reported on 2/1/24.\n\nThe total amount of income generated by the sale of goods or services related to the company's primary operations\n\nRepresents the total incurred expenses through normal operations\n\nCompany’s earnings for a period net of operating costs, taxes, and interest\n\nMeasures how much net income or profit is generated as a percentage of revenue.\n\nRepresents the company's profit divided by the outstanding shares of its common stock.\n\nEarnings before interest, taxes, depreciation, and amortization, is a measure of a company's overall financial performance and is used as an alternative to net income in some circumstances\n\nThe percent of their income that a corporation pays in taxes\n\nFiscal Q4 2023 ended 12/31/23. Reported on 2/1/24.\n\nCash and short-term investments\n\nInvestments that are relatively liquid and have maturities between 3 months and one year\n\nThe total amount of assets owned by a company\n\nSum of the combined debts a company owes\n\nThe value of subtracting the total liabilities from the total assets of a company\n\nTotal number of common shares outstanding as of the latest date disclosed in a financial filing\n\nA ratio used to determine if a company’s market value is in line with the value of its assets less liabilities and preferred stock\n\nA financial ratio that shows a company’s profitability compared to its assets\n\nCompany’s return above the average cost it pays for its debt and equity capital\n\nFiscal Q4 2023 ended 12/31/23. Reported on 2/1/24.\n\nCompany’s earnings for a period net of operating costs, taxes, and interest\n\nCash from operations\n\nNet cash used or generated for core business activities\n\nNet cash used or generated in investing activities such as purchasing assets\n\nNet cash used or generated in financing activities such as dividend payments and loans\n\nThe amount by which a company's cash balance increases or decreases in an accounting period\n\nAmount of cash a business has after it has met its financial obligations such as debt and outstanding payments\n\nequalizerMost active\n\nOne of the most heavily traded stocks during the last trading sessionStock\n\nOwnership of a fraction of a corporation and the right to claim a share of the corporation's assets and profits equal to the amount of stock ownedUS listed security\n\nThe last closing price\n\nThe range between the high and low prices over the past day\n\nThe range between the high and low prices over the past 52 weeks\n\nA valuation method that multiplies the price of a company's stock by the total number of outstanding shares.\n\nThe average number of shares traded each day over the past 30 days\n\nThe ratio of current share price to trailing twelve month EPS that signals if the price is high or low compared to other stocks\n\nThe ratio of annual dividend to current share price that estimates the dividend return of a stock\n\nListed exchange for this security\n\nCDP Climate Change Score\n\nA score provided by CDP (formerly the Carbon Disclosure Project) that rates a company on its climate transparency and performance\n\nMeta Platforms, Inc., doing business as Meta, and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns and operates Facebook, Instagram, Threads, and WhatsApp, among other products and services. Meta ranks among the largest American information technology companies, alongside other Big Five corporations Alphabet, Amazon, Apple, and Microsoft. The company was ranked #31 on the Forbes Global 2000 ranking in 2023. Meta has also acquired Oculus, Mapillary, CTRL-Labs, and a 9.99% stake in Jio Platforms; the company additionally endeavored into non-VR hardware, such as the discontinued Meta Portal smart displays line and presently partners with Luxottica through the Ray-Ban Stories series of smartglasses. Despite endeavors into hardware, the company relies on advertising for a vast majority of its revenue, amounting to 97.8 percent in 2023. Parent company Facebook, Inc. rebranded as Meta Platforms, Inc. on October 28, 2021, to \"reflect its focus on building the metaverse\", an integrated environment linking the company's products and services. Wikipedia\n\nYou may be interested in\n\nThis list is generated from recent searches, followed securities, and other activity. Learn more All data and information is provided “as is” for personal informational purposes only, and is not intended to be financial advice nor is it for trading purposes or investment, tax, legal, accounting or other advice. Google is not an investment adviser nor is it a financial adviser and expresses no view, recommendation or opinion with respect to any of the companies included in this list or any securities issued by those companies. Please consult your broker or financial representative to verify pricing before executing any trades. Learn more\n\nDow Jones Industrial Average\n\nAlibaba Group Holding Ltd - ADR\n\nNexstar Media Group Inc\n\nSPDR S&P 500 ETF Trust\n\nPeople also search for\n\nAlphabet Inc Class C\n\nAlphabet Inc Class A\n\nSuper Micro Computer Inc\n\nPalantir Technologies Inc\n\nSPDR S&P 500 ETF Trust\n\nAdvanced Micro Devices, Inc.\n\nHelpSend feedbackPrivacyTermsDisclaimer", "timestamp": "2024-04-25T17:05:55", "title": "Meta Platforms Inc (META) Stock Price & News - Google Finance", "url": "https://www.google.com/finance/quote/META:NASDAQ?hl=en"}, {"id": "web-search_5", "snippet": "Skip to Main Content\n\nSkip to Related Content\n\nSign in to view your mail\n\nU.S. markets open in 4 hours 27 minutes\n\nRussell 2000 Futures\n\nMeta Platforms, Inc. (META)\n\nNasdaqGS - NasdaqGS Real Time Price. Currency in USD\n\nVisitors trend2W10W9M\n\nAt close: 04:00PM EDT\n\n(+0.99%) Pre-Market:\n\nTrade prices are not sourced from all markets\n\nGain actionable insight from technical analysis on financial instruments, to help optimize your trading strategies\n\nBearishpattern detected\n\nCommodity Channel Index\n\nView all chart patterns\n\nForward Dividend & Yield\n\nFair Value is the appropriate price for the shares of a company, based on its earnings and growth rate also interpreted as when P/E Ratio = Growth Rate. Estimated return represents the projected annual return you might expect after purchasing shares in the company and holding them over the default time horizon of 5 years, based on the EPS growth rate that we have projected.\n\nSubscribe to Yahoo Finance Plus to view Fair Value for METALearn More\n\nResearch that delivers an independent perspective, consistent methodology and actionable insight\n\nMeta Platforms, Inc.\n\nTechnical Assessment: Neutral in the Intermediate-TermEver so quietly, commodity prices are starting to percolate and, impressively, this action is occurring with a rising U.S. Dollar Index (USD). What would be happening if the USD was in a downtrend or reversing lower? We might be back in the 1970s, which was not a pretty time for the stock market, inflation, and interest rates.\n\n19 days agoArgus Research\n\nTechnical Assessment: Neutral in the Intermediate-TermEver so quietly, commodity prices are starting to percolate and, impressively, this action is occurring with a rising U.S. Dollar Index (USD). What would be happening if the USD was in a downtrend or reversing lower? We might be back in the 1970s, which was not a pretty time for the stock market, inflation, and interest rates.\n\n19 days ago•Argus ResearchView more\n\nFed's favorite inflation gauge and Big Tech earnings greet a slumping stock market: What to know this week\n\nWith the stock market rally at its most fragile stage in months, big tech earnings, a reading on economic growth and a fresh inflation print are set to greet investors in the week ahead.\n\nAdExpertsInHealth | Blood Sugar\n\nOne Bite Of This Could Help Keep Blood Sugar Below 100...\n\nBillionaire Ken Griffin Recently More Than Doubled His Holdings of These 2 \"Magnificent Seven\" Artificial Intelligence (AI) Giants.\n\nThese players are making AI investment a priority.\n\nData DisclaimerHelpSuggestions\n\nTermsandPrivacy Policy\n\nAbout Our AdsSitemap\n\n© 2024 Yahoo. All rights reserved.", "timestamp": "2024-05-01T03:36:06", "title": "Meta Platforms, Inc. (META) Latest Stock News & Headlines - Yahoo Finance", "url": "https://finance.yahoo.com/quote/META/news/"}]}