{"text": "Here is a summary of recent news relating to LLY stock:\n\n- LLY stock is not currently considered a buy. Shares recently fell below their 50-day line, which is considered a bearish sign.\n- Eli Lilly's weight-loss drug, tirzepatide, has been successful in treating sleep apnea patients. The company is planning to ask global regulators to approve the drug for this use in mid-2024.\n- Medicare announced it could pay for weight-loss drugs for some members, which caused a dip in Eli Lilly stocks.\n- The company reported strong sales and earnings growth in the fourth quarter, with sales climbing 28% to top forecasts.\n- Eli Lilly is working to gain approval for its Alzheimer's treatment, donanemab, which removes built-up plaque in the brain. The FDA has said it will hold an advisory committee meeting to discuss the drug's risks and benefits.\n- The company has acquired Point Biopharma, an expert in radioligand treatments for cancer, and Versanis Bio, which has a drug that could improve fat loss while limiting muscle mass loss.", "documents": [{"id": "web-search_1", "snippet": "IBD Digital: 2 Months for $20\n\nPsychological Indicators\n\nStocks Near A Buy Zone\n\nRelative Strength at New High\n\nRising Profit Estimates\n\nIBD Digital: 2 Months for $20\n\nIBD Long-Term Leaders\n\nStocks Funds Are Buying\n\nInvesting Action Plan\n\nIBD 50 Stocks To Watch\n\nIBD Digital: 2 Months for $20\n\nPremium Investing Tools\n\nMagnificent Seven Stocks\n\nIBD Digital: 2 Months for $20\n\nInvesting With IBD Podcast\n\nHow To Invest Videos\n\nGrowth Stories Podcast\n\nIBD Digital: 2 Months for $20\n\nHow To Invest In Stocks\n\n3 Keys To Stock Investing\n\nTracking Stock Market Trends\n\nHow To Read Stock Charts\n\nPremium Online Courses\n\nEducational Resources\n\nInvesting Strategies Video Series\n\nInvesting With IBD Podcast\n\nInvesting Infographics\n\nIBD Digital: 2 Months for $20\n\nSTOCK MARKET FORECAST: 5 Predictions For The Next Decade\n\nYour cart is currently empty. Visit the IBD Store to get started.\n\nIBD Digital: 2 Months for $20\n\nPsychological Indicators\n\nStocks Near A Buy Zone\n\nRelative Strength at New High\n\nRising Profit Estimates\n\nIBD Digital: 2 Months for $20\n\nIBD Long-Term Leaders\n\nStocks Funds Are Buying\n\nInvesting Action Plan\n\nIBD 50 Stocks To Watch\n\nIBD Digital: 2 Months for $20\n\nPremium Investing Tools\n\nMagnificent Seven Stocks\n\nIBD Digital: 2 Months for $20\n\nInvesting With IBD Podcast\n\nHow To Invest Videos\n\nGrowth Stories Podcast\n\nIBD Digital: 2 Months for $20\n\nHow To Invest In Stocks\n\n3 Keys To Stock Investing\n\nTracking Stock Market Trends\n\nHow To Read Stock Charts\n\nPremium Online Courses\n\nEducational Resources\n\nInvesting Strategies Video Series\n\nInvesting With IBD Podcast\n\nInvesting Infographics\n\nIBD Digital: 2 Months for $20\n\nYour cart is currently empty. Visit the IBD Store to get started.\n\nSign In or Subscribe\n\nIs Eli Lilly Stock A Buy After Weight-Loss Drug Succeeds In Sleep Apnea Patients?\n\n12:53 PM ET 04/25/2024\n\nEli Lilly (LLY) stock briefly retook its 50-day line in mid-April after its weight-loss drug, tirzepatide, led to fewer nighttime incidents in people with sleep apnea and obesity. X\n\nSleep apnea is a big market, estimated at about 50 million people in the U.S. On April 17, Eli Lilly said patients who took tirzepatide for a year had 55% to nearly 63% fewer sleep apnea events. The results outperformed a placebo group, and sent Lilly stock above its 50-day moving average, briefly. But the stock later retreated, and closed below that key mark.\n\nStill, the company remains bullish on its chances in obstructive sleep apnea. It's planning to ask global regulators to approve tirzepatide for this use in the middle of this year. Tirzepatide currently sells as a diabetes shot called Mounjaro and in weight loss as Zepbound. Its chief rival is Novo Nordisk (NVO), which sells semaglutide as Ozempic and Wegovy, respectively.\n\nLilly is also working on next-generation drugs, including a daily pill called orforglipron in patients with type 2 diabetes and obesity. And its next-generation drug — which targets three hormones — could stoke even further weight loss. Bank of America Securities analyst Geoff Meacham expects tirzepatide to bring in $62 billion in 2030 and for the next-generation drugs to add $19 billion to that.\n\nBut others are coming and could rock Eli Lilly stock. Viking Therapeutics (VKTX) soared after its weight-loss drug topped Zepbound's Phase 3 results. Recently, Madrigal Pharmaceuticals (MDGL) gained approval for the first-ever MASH treatment. MASH is a metabolic disease associated with obesity. Lilly is also testing tirzepatide in MASH treatment.\n\nEli Lilly is working to gain approval for its Alzheimer's treatment, a potential rival to Biogen (BIIB) and Eisai's (ESAIY) Leqembi. But the Food and Drug Administration said it would hold an advisory committee meeting to discuss the drug's risks and benefits. Analysts noted the FDA will likely focus on brain swelling tied to drugs in this class.\n\nMeanwhile, Lilly locked up its acquisition of Point Biopharma, an expert in radioligand treatments for cancer. The company ties a radioisotope to a molecule capable of finding cancer cells in the body. This allows the drug to deliver targeted radiation directly to the tumor, limiting the impact on healthy tissue.\n\nSo, is Eli Lilly stock a buy right now?\n\nEli Lilly Stock: Bullish Sales Growth\n\nDuring the fourth quarter, Lilly earned an adjusted $2.49 per share on $9.35 billion in sales. Earnings popped 19% and beat expectations for $2.30 a share. Sales climbed 28% to top forecasts for $8.95 billion, according to FactSet.\n\nZepbound was on the market for just weeks in the December quarter. But sales climbed rapidly to $175.8 million. That was more than double the $75 million estimate from analysts polled by FactSet. Another forecast suggested Zepbound could come in with $125 million. Sales from Mounjaro grew nearly eightfold to $2.21 billion, handily beating forecasts.\n\nSales of breast cancer drug Verzenio rocketed 42% to $1.15 billion, but came in below projections for $1.17 billion. Diabetes treatment Jardiance brought in $798.1 million, topping expectations and soaring 30% year over year.\n\nBullish fourth-quarter sales lines up with savvy investing advice, which suggests investors look for companies with recent growth of at least 20% to 25%. But earnings didn't quite hit that bar in the most recent quarterly report.\n\nFor the first quarter, Eli Lilly stock analysts predict earnings of $2.47 per share, surging 52.5%, and for sales to grow 28.4% to $8.94 billion.\n\nLLY Stock: What Are Eli Lilly Yearly Earnings?\n\nIn 2023, Eli Lilly earned $6.32 a share, minus some items, on $34.12 billion in sales. Profit fell 20.4% but topped expectations for $6.23. Sales jumped 20% and came in above forecasts for $33.65 billion, according to FactSet.\n\nNotably, Mounjaro generated $5.16 billion in sales, jetting higher from $482.5 million in 2022 sales. Revenue from Verzenio and Jardiance came in at a respective $3.86 billion and $2.74 billion. Sales of Verzenio surged 56%, while Jardiance sales rocketed 33%.\n\nAfter the fourth-quarter report, Eli Lilly guided to $40.4 billion to $41.6 billion in 2024 sales. But Lilly expects demand for its GLP-1-based drugs will likely \"outpace supply\" this year. The company also calls for adjusted earnings of $12.20 to $12.70 per share. Both measures topped analysts' forecasts.\n\nWall Street expects Mounjaro to bring in $10.23 billion in sales this year, growing more than 98% year over year. Zepbound is projected to generate almost $3.5 billion in sales. In 2029, analysts expect the two drugs to bring in $23.81 billion and $16.36 billion in sales, respectively.\n\nLLY stock analysts also expect Alzheimer's drug donanemab to bring in $139 million in 2024 sales and reaching blockbuster status with $1.47 billion in 2026.\n\nMeanwhile, sales from blockbuster insulins Humalog and Humulin are expected to fall now that Lilly has announced price cuts. Sales of generics-facing Alimta, a cancer drug, are also forecast to drop.\n\nEli Lilly Stock Analysis\n\nEli Lilly stock is forming a flat base with a buy point at 800.78, according to MarketSurge.\n\nShares sank below their 50-day line this month and remained there in morning trades on April 25. Eli Lilly stock is still above its 200-day moving average, however.\n\nEli Lilly stock has a Relative Strength Rating of 93 out of a best-possible 99, IBD Digital shows. This puts shares in the top 7% of all stocks when it comes to 12-month performance. Shares have a Composite Rating of 89, a measure of fundamental and technical metrics.\n\nAlzheimer's Treatment News Hits LLY Stock\n\nEli Lilly is angling for FDA approval of donanemab, a potential Alzheimer's treatment that removes built-up plaque in the brain known as beta amyloid. Beta amyloid is a hallmark of the disease, though experts don't necessarily agree that it's the cause.\n\nThe FDA just said it plans to hold an advisory committee meeting to discuss the effectiveness and safety of donanemab in the study called Trailblazer-ALZ 2. The decision effectively pushes back the approval decision, which was expected before the end of this month.\n\nBiogen's Leqembi gained full approval for Alzheimer's treatment based on its ability to remove amyloid. In mid-July, Lilly said patients who received its drug for 18 months had a 22%-29% slower decline in cognition than placebo recipients.\n\nThe results were even stronger in patients with medium levels of a protein called tau in their brains. Donanemab led to a 35%-36% slower cognitive decline compared with a placebo.\n\nExperts noted that donanemab does a better job of clearing away beta amyloid than Biogen's Leqembi. But that could lead to higher levels of a side effect called amyloid-related imaging abnormalities, or ARIA. This is generally asymptomatic swelling in the brain.\n\nEli Lilly Stock Investors Watch Weight-Loss Drugs\n\nInvestors in Eli Lilly stock are waiting for more from Lilly's efforts in obesity treatment. The FDA has signed off on its tirzepatide in patients with type 2 diabetes and as a weight-loss drug. Lilly also recently launched a direct-to-consumer website to help bolster sales of both.\n\nIn December, Lilly said patients who took Zepbound for eight months lost an average of 20.9% of their body weight. But when a group of patients switch to a placebo, they regained 14% of their weight over a year. Those who stayed on Zepbound lost an additional 5.5% of their weight.\n\nIn another analysis of electronic health records, patients who took tirzepatide for a year were three times more likely than recipients of Novo's semaglutide to lose at least 15% of their body weight. Novo sells semaglutide as diabetes treatments known as Ozempic and Rybelsus, and as a weight-loss drug called Wegovy. Semaglutide recipients were also 2.6 times and 1.8 times more likely to lose at least 10% and 5% of their weight, respectively.\n\nLilly's next-generation approach called retatrutide adds in a third target called the glucagon receptor, and could be an eventual boon for Eli Lilly stock. In theory, this could lead to improved weight loss. Over 24 weeks, overweight patients or those with obesity who received retatrutide lost up to 17.5% of their weight. At 48 weeks, patients lost up to 24.2% of their body weight.\n\nMounjaro had already set a high bar. Last June, Lilly said patients lost up to 15% of their body weight over 72 weeks. Lilly tested the drug in patients with type 2 diabetes and obesity. In patients without diabetes, the drug generated even stronger weight loss, up to 22.5% of their body weight.\n\nLilly is also testing Mounjaro's ability to improve morbidity and mortality in patients with obesity or those who are overweight. The results of that study are expected in late 2027.\n\nIn August, Novo Nordisk said its obesity drug Wegovy cut the risk of cardiovascular events — like heart attack or stroke — in a five-year study. This could help make the case for insurance coverage of weight-loss drugs for patients who have or are at risk of cardiovascular disease. Later in the year, Novo said a weekly shot of Ozempic helped stave off renal impairment and reduced the risk of death due to kidney or cardiovascular disease in patients with type 2 diabetes and chronic kidney disease.\n\nLilly just acquired Versanis Bio, which has a drug that could improve fat loss while limiting muscle mass loss associated with GLP-1 drugs. Further, Lilly entered into a collaboration with Verve Therapeutics (VERV) to test three potential gene-editing approaches to permanently lowering cholesterol.\n\nLess promisingly, on April 10, Lilly said patients who received its diabetes drug, Jardiance, after having a heart attack only had a 10% reduced risk of heart failure or death over 26 months. The results didn't meet statistical significance.\n\nIs LLY Stock A Buy Right Now?\n\nLilly stock isn't currently a buy. Shares recently fell below their 50-day line — a bearish sign — and are still forming a new flat base.\n\nLilly also reported strong sales and earnings growth. Sales were in line with savvy investing advice and both measures well above LLY stock analyst forecasts.\n\nIt will be key to watch how the markets for weight-loss drugs and Alzheimer's treatments unfold.\n\nTo find the best stocks to buy and watch, check out IBD Stock Lists. Make sure to also keep tabs on stocks to buy or sell.\n\nFollow Allison Gatlin on Twitter at @IBD_AGatlin.\n\nIs Moderna Stock A Buy After Unexpectedly Raising Its 2023 Sales Outlook?\n\nIs Pfizer Stock A Buy Or A Sell With Covid-Era Growth In The Rearview?\n\nWatch IBD's Investing Strategies Show For Actionable Market Insights\n\nGet Timely Buy & Sell Alerts With IBD Leaderboard\n\nBest Growth Stocks To Buy And Watch: See Updates To IBD Stock Lists\n\nStocks Retreat With Dow Hit Hardest; Tesla Drops As Executives Get Sacked\n\n3:44 AM ET The Dow Jones was hit hardest of the major indexes in the stock market today. Eli Lilly soared while Tesla...\n\n3:44 AM ET The Dow Jones was hit hardest of the major indexes...\n\nEli Lilly Surges On Guidance Boost After Weight-Loss Drug Obliterates Sales Views\n\nHow To Trade Biotech Stocks: Can These Three Tips Help You Make More Profits?\n\nEarnings Calendar, Analyst Estimates And Stocks To Watch\n\nStocks To Buy And Watch: Top IPOs, Big And Small Caps, Growth Stocks\n\nDow Jones Futures Rise: Nvidia Leads New Buys; Tesla Runs Past Resistance On Elon Musk Move\n\nHow 'Megatrends' Like Weight-Loss Drugs And Smartwatches Are Bolstering ResMed\n\nTech Earnings Continue With Amazon And Apple On Deck\n\nIBD 50 Growth Stocks To Watch\n\nIBD Live with Brian Shannon! Don’t miss Brian Shannon on IBD Live 5/3! Sign up for a 3-month trial to watch live.\n\nIBD 40th Anniversary Sale Celebrate four decades Investor’s Business Daily with 4 months of IBD Digital for only $40.\n\nTrading Summit Sale Extended Missed Saturday’s event? There’s still time to claim offers on MarketSurge and IBD Digital.\n\nTesla Has Best Single Day Gain In More Than Three Years On 'Home Run' China FSD Approval\n\nAs Google Rallies, Here Is What Analysts Expect From It And Nvidia\n\nBillions of dollars are being spent to extract hydrogen energy from water at an industrial scale. Can this green dream come true? (© Dave Cutler) Hydrogen Energy Lags In The Climate Race. But Don't Count It Out.\n\nGet instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20!\n\nGet market updates, educational videos, webinars, and stock analysis.\n\nLearn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content.", "timestamp": "2024-04-30T15:03:49", "title": "Eli Lilly Stock: Is LLY Stock A Buy After Weight-Loss Drug Win In Sleep Apnea? | Investor's Business Daily", "url": "https://www.investors.com/news/technology/eli-lilly-stock-buy-now/"}, {"id": "web-search_3", "snippet": "Skip to Main Content\n\nSkip to Related Content\n\nSign in to view your mail\n\nU.S. markets open in 8 hours 38 minutes\n\nRussell 2000 Futures\n\nEli Lilly and Company (LLY)\n\nNYSE - NYSE Delayed Price. Currency in USD\n\nVisitors trend2W10W9M\n\nAt close: 04:00PM EDT\n\n(+0.40%) After hours:\n\nTrade prices are not sourced from all markets\n\nGain actionable insight from technical analysis on financial instruments, to help optimize your trading strategies\n\nBearishpattern detected\n\nView all chart patterns\n\nForward Dividend & Yield\n\nFair Value is the appropriate price for the shares of a company, based on its earnings and growth rate also interpreted as when P/E Ratio = Growth Rate. Estimated return represents the projected annual return you might expect after purchasing shares in the company and holding them over the default time horizon of 5 years, based on the EPS growth rate that we have projected.\n\nSubscribe to Yahoo Finance Plus to view Fair Value for LLYLearn more\n\nResearch that delivers an independent perspective, consistent methodology and actionable insight\n\nEli Lilly and Company\n\nWeekly Stock ListWe see what we believe are some great opportunities right now in Healthcare -- and we like the sector overall. Argus Director of Research Jim Kelleher, CFA, recently completed his quarterly sector review and raised Healthcare sector to Over-Weight from Market-Weight. The healthcare environment is undergoing rapid transitions, and we now see an unfolding period of significant promise and opportunity. Our newly-favored stance is based on resumption of deferred medical procedures and significant new quality-of-life drugs and treatments. The category is broad and has underperformed the S&P 500 over the past year. The Healthcare sector ETF (XLV) is up 15% over the past year compared to a gain of 31% for the S&P 500. We see opportunity here to pick up some steady companies, with big brands and solid financials. These companies are science-focused and enhance lives. They are innovators. In our list this week, we look across several subsectors within the Healthcare sector and pull out some leaders we like. These stocks also are included in our Focus List and Model Portfolios, as noted below.\n\n4 days agoArgus Research\n\nWeekly Stock ListWe see what we believe are some great opportunities right now in Healthcare -- and we like the sector overall. Argus Director of Research Jim Kelleher, CFA, recently completed his quarterly sector review and raised Healthcare sector to Over-Weight from Market-Weight. The healthcare environment is undergoing rapid transitions, and we now see an unfolding period of significant promise and opportunity. Our newly-favored stance is based on resumption of deferred medical procedures and significant new quality-of-life drugs and treatments. The category is broad and has underperformed the S&P 500 over the past year. The Healthcare sector ETF (XLV) is up 15% over the past year compared to a gain of 31% for the S&P 500. We see opportunity here to pick up some steady companies, with big brands and solid financials. These companies are science-focused and enhance lives. They are innovators. In our list this week, we look across several subsectors within the Healthcare sector and pull out some leaders we like. These stocks also are included in our Focus List and Model Portfolios, as noted below.\n\n4 days ago•Argus ResearchView more\n\nInvestor's Business Daily\n\nMedicare Will Cover Weight-Loss Drugs — For Some. Here's What It Means For Novo, Lilly.\n\nNovo Nordisk and Eli Lilly stocks dipped Thursday after Medicare said it could pay for weight-loss drugs for some members.\n\nMedicare can pay for obesity drugs like Wegovy in certain heart patients\n\nAssociated Press Finance\n\nMedicare Coverage of Zepbound, Wegovy Will Raise Federal Deficit, Official Warns\n\nSubscribe today to get our company alerts\n\nGet the latest breaking news and alerts on the hottest stocks under $15 daily, right at your fingertips. Signup Today! No cost, free VIP newsletter!\n\nUPDATE 1-Wegovy to be covered by US Medicare for heart disease patients\n\nHeart patients insured under the U.S. Medicare program would be covered for Novo Nordisk's weight-loss drug Wegovy as long as it is prescribed to reduce their risk of heart attacks and strokes, the agency overseeing the program said on Thursday. Medicare prescription drug plans administered by private insurers, known as Part D, currently cannot cover obesity drugs. Under the new guidance, however, such drugs would be paid for if they receive U.S. approval for a secondary use that Medicare does cover, the U.S. Centers for Medicare and Medicaid Services(CMS) said.\n\nData DisclaimerHelpSuggestions\n\nTermsandPrivacy Policy\n\nAbout Our AdsSitemap\n\n© 2024 Yahoo. All rights reserved.\n\nYahoo Finance updates are here. Better quotes, news, and tools.", "timestamp": "2024-04-26T06:58:39", "title": "Eli Lilly and Company (LLY) Latest Stock News & Headlines - Yahoo Finance", "url": "https://finance.yahoo.com/quote/LLY/news/"}]}