{"text": "Here is a summary of news relating to MSFT (Microsoft Corporation) from the past week:\n\n- Microsoft reported better-than-anticipated Q3 earnings, powered by growth in its cloud products.\n- Microsoft announced it will open its first regional data centre in Thailand, along with new cloud and AI infrastructure.\n- Microsoft stock outperformed competitors on a strong trading day.\n- Microsoft stock underperformed competitors on a Tuesday session.\n- Microsoft is monetizing AI right now, according to an analyst.\n- Microsoft stock rose by more than 2% after Federal Reserve Chair Jerome Powell ruled out a rate hike as the central bank's next move.", "documents": [{"id": "web-search_1", "snippet": "Skip to Main Content\n\nSkip to Related Content\n\nSign in to view your mail\n\nU.S. markets close in 5 hours 53 minutes\n\nMicrosoft Corporation (MSFT)\n\nNasdaqGS - NasdaqGS Real Time Price. Currency in USD\n\nVisitors trend2W10W9M\n\nAs of 10:07AM EDT. Market open.\n\nMSFT announced a cash dividend of 0.75 with an ex-date of May. 15, 2024\n\nTrade prices are not sourced from all markets\n\nJul 23, 2024 - Jul 29, 2024\n\nForward Dividend & Yield\n\nMicrosoft beats Q3 top and bottom lines on cloud strength\n\nMicrosoft reported better than anticipated Q3 earnings on Thursday, powered by growth in its cloud products.\n\nPCE, big tech, and energy earnings: 3 Things\n\nPCE reading, Microsoft, Alphabet jump on earnings: Yahoo Finance\n\nAdZacks Investment Research\n\nThe 5 stocks Set to Double - Not the ones you expect\n\nExplore the secret behind doubling your investments with these top 5 stock recommendations from industry-leading experts.\n\nAlphabet stock surges on earnings beat, dividend announcement\n\nAlphabet reported Q1 earnings on Thursday that beat estimates. The company also announced its first-ever dividend.\n\nRubrik CEO says he's hungry as ever, while the Microsoft-backed firm sizzles on IPO day\n\nMicrosoft is monetizing AI right now: Analyst\n\nData DisclaimerHelpSuggestions\n\nTermsandPrivacy Policy\n\nAbout Our AdsSitemap\n\n© 2024 Yahoo. All rights reserved.", "timestamp": "2024-04-27T00:03:41", "title": "Microsoft Corporation (MSFT) Stock Price, News, Quote & History - Yahoo Finance", "url": "https://finance.yahoo.com/quote/MSFT/"}, {"id": "web-search_2", "snippet": "Futures & Commodities\n\nEquity and Opportunity\n\nHelp for Low Credit Scores\n\nFind the Credit Card for You\n\nBest Rewards Credit Cards\n\nBest Travel Credit Cards\n\nBest 0% APR Credit Cards\n\nBest Balance Transfer Credit Cards\n\nBest Cash Back Credit Cards\n\nBest Credit Card Welcome Bonuses\n\nBest Credit Cards to Build Credit\n\nFind the Best Personal Loan for You\n\nBest Debt Consolidation Loans\n\nBest Loans to Refinance Credit Card Debt\n\nBest Loans with Fast Funding\n\nBest Small Personal Loans\n\nBest Large Personal Loans\n\nBest Personal Loans to Apply Online\n\nBest Student Loan Refinance\n\nFind the Savings Account for You\n\nBest High Yield Savings Accounts\n\nBest Big Bank Savings Accounts\n\nBest Big Bank Checking Accounts\n\nBest No Fee Checking Accounts\n\nNo Overdraft Fee Checking Accounts\n\nBest Checking Account Bonuses\n\nBest Money Market Accounts\n\nBest Mortgages for Small Down Payment\n\nBest Mortgages for No Down Payment\n\nBest Mortgages with No Origination Fee\n\nBest Mortgages for Average Credit Score\n\nAdjustable Rate Mortgages\n\nAffording a Mortgage\n\nBest Homeowners Insurance\n\nBest Renters Insurance\n\nAll Credit Monitoring\n\nBest Credit Monitoring Services\n\nBest Identity Theft Protection\n\nHow to Boost Your Credit Score\n\nCredit Repair Services\n\nAll Personal Finance\n\nBest Expense Tracker Apps\n\nBest Money Transfer Apps\n\nBest Resale Apps and Sites\n\nBuy Now Pay Later (BNPL) Apps\n\nBest Small Business Savings Accounts\n\nBest Small Business Checking Accounts\n\nBest Credit Cards for Small Business\n\nBest Small Business Loans\n\nBest Tax Software for Small Business\n\nBest Tax Software for Small Businesses\n\nAll Help for Low Credit Scores\n\nBest Credit Cards for Bad Credit\n\nBest Personal Loans for Bad Credit\n\nBest Debt Consolidation Loans for Bad Credit\n\nPersonal Loans if You Don't Have Credit\n\nBest Credit Cards for Building Credit\n\nPersonal Loans for 580 Credit Score or Lower\n\nPersonal Loans for 670 Credit Score or Lower\n\nBest Mortgages for Bad Credit\n\nHow to Boost Your Credit Score\n\nBest Roth IRA Accounts\n\nBest Free Stock Trading Platforms\n\nSearch quotes, news & videos\n\nUpdated Wed, May 1 20243:09 PM EDT\n\nShareShare Article via FacebookShare Article via TwitterShare Article via LinkedInShare Article via Email\n\nDow jumps 500 points as Powell says the Fed's next move is unlikely to be a hike: Live updates\n\nStocks rallied on Wednesday after Federal Reserve Chair Jerome Powell largely ruled out that the central bank's next move could be a hike, easing investor worries that it was losing control of sticky inflation.\n\nThe Dow Jones Industrial Average jumped 500 points, or 1.3%, with a large part of the gains coming in afternoon trading and on the heels of the Fed's latest interest rate decision. The S&P 500 added 1%, while the Nasdaq Composite gained 1.4%.\n\nThe central bank opted to hold rates steady, citing a \"lack of further progress\" in bringing inflation back down toward its 2% goal. However, stock prices rallied as Powell ruled out the likelihood of a hike in a press conference following the decision.\n\n\"I think it's unlikely that the next policy rate move will be a hike,\" he said. \"I'd say it's unlikely.\"\n\nInvestors also reacted positively to the Fed saying it would tap the brakes on one way it tightens conditions for financial markets. Starting in June, the central bank said it will slow the pace at which it allows maturing bond proceeds to roll off its balance sheet without reinvesting them. This is a process known as quantitative tightening.\n\n\"The fact that inflation remains elevated means we're not going to see rate cuts very soon,\" said Sonu Varghese, global macro strategist at Carson Group. \"At the same time, they are going to slow the pace at which they shrink their balance sheet (their massive bond portfolio), which will likely put less upward pressure on bond yields.\"\n\nThe 10-year Treasury yield dropped below 4.6% following Powell's comments, alleviating some investor fears that it may jump back above 5% this year, and restrict the economy. Major technology stocks sensitive to the level of rates and risk appetite led the afternoon gains, with Microsoft and Alphabet gaining more than 2%. Amazon advanced 5% following better-than-expected earnings and revenue in the first quarter, while Meta Platforms jumped 4%.\n\nWall Street is coming off a losing month, with the S&P and the Nasdaq posting losses of more than 4%. The Dow fell 5% for its worst monthly performance since September 2022.\n\nStocks tied to artificial intelligence struggle during Wednesday's session, following disappointing reports from some top AI contenders. Advanced Micro Devices tumbled 7% after issuing an in-line current-quarter revenue forecast, while Super Micro Computer slid 11% on light revenue.\n\nRegional bank stocks surge 2.5% and are on pace to snap a 4-day decline\n\nRegional bank stocks rallied Wednesday, sending the SPDR S&P Regional Banking ETF (KRE) 4% higher in late afternoon trading following the Federal Reserve's latest policy decision to leave interest rates unchanged and scale back its qualitative tightening program.\n\nThat's the first up day for regional bank stocks as a group in five days.\n\nThe largest percentage gains in regional banks came in New York Community Bancorp, up 31%, Axos Financial, higher by 14%, Capitol Federal Financial, ahead 9%, Bancorp Inc., which gained 6% and BankUnited Inc., better by 5.7%.\n\nSPDR S&P Regional Banking ETF over the past month.\n\nDollar index falls to session low\n\nThe dollar index declined 0.1% to 106.09 Wednesday afternoon following the Federal Reserve's decision to maintain its benchmark short-term borrowing rate in a range between 5.25% and 5%. The decision had been widely anticipated by the market.\n\nHowever, the dollar index was still above Tuesday's low of 105.667.\n\n— Hakyung Kim, Gina Francolla\n\nFederal Reserve keeps rates steady, moves to ease the pace of balance sheet reduction\n\nFederal Reserve Bank Chair Jerome Powell announces that interest rates will remain unchanged during a news conference at the bank's William McChesney Martin building on May 01, 2024 in Washington, DC.\n\nChip Somodevilla | Getty Images\n\nThe Federal Reserve on Wednesday kept interest rates steady, deciding not to lower rates as it contends with persistent pricing pressures.\n\nThe central bank kept its benchmark short-term borrowing rate in a targeted range between 5.25% and 5% in what was a widely anticipated move. The federal funds rate has been at that level since July 2023.\n\nThe Federal Open Market Committee voted to ease the pace at which it is lowering bond holdings on the Fed's balance sheet, a move that could signal an incremental easing of monetary policy.\n\nThe S&P 500 was slightly lower following the decision.\n\n— Sarah Min, Jeff Cox\n\nRecent market sell-off is a 'normal pullback,' says Charles Schwab's Gordon\n\nThe recent market pullback is not anything out of the ordinary following a strong multimonth run in equities, according to Charles Schwab's Kevin Gordon.\n\n\"This is all part of a normal pullback after a strong rally since last October,\" said the director and senior investment strategist. \"Relative to prior pullbacks and prior bull markets, this looks pretty normal and pretty healthy.\"\n\nThe consolidation and rotation seen over the past month is also helping remove some \"frothy investor sentiment\" that has been a risk to the market in recent months, he added.\n\nGoldman Sachs' Peter Oppenheimer says diversification is key for investors\n\nPeter Oppenheimer, the chief global equity strategist at Goldman Sachs, believes diversification will be key for investors this year.\n\nTo that end, he recommends investors barbell their portfolios with exposure to both quality growth and deep value stocks.\n\n\"There's some very cheap parts of the markets in value sectors which have been neglected for a very long time, but where you're starting to see some really strong compound cash returns for investors,\" Oppenheimer said on CNBC's \"Money Movers\" on Wednesday. He added that this was especially true in the energy and financials sectors, particularly for European banks.\n\nQuality growth names consist of companies with strong balance sheets, therefore making them less sensitive to rising rates.\n\nLikewise, Oppenheimer also believes investors should broaden their portfolios to ex-U.S. opportunities this year.\n\n\"That doesn't mean to be underweight of the U.S., but to have more broad global exposure because some of the more value orientated markets like Europe, like Japan, are actually holding up or even outperforming relative to the U.S. because they're a lot cheaper and therefore less exposed to the risks of rising rates,\" the strategist added.\n\nViking shares pop more than 10% after cruise line operator's NYSE debut\n\nShares of luxury cruise line operator Viking popped 10.3% after the company's initial public offering on the New York Stock Exchange on Wednesday.\n\nViking started trading at $24 per share under the ticker \"VIK,\" and was last at $26.55 a share during early afternoon trading Wednesday. The company was targeting a $10.4 billion valuation in its IPO, making it the third-largest cruise operator after Royal Caribbean and Carnival.\n\nViking upsized its IPO after existing shareholders decided to sell an additional nine million shares due to strong demand from mutual fund investors, according to a source familiar with the situation, CNBC reported.\n\n— Pia Singh, Seema Mody\n\nThe Dow bucked the other two major indexes' downtrend on Wednesday.\n\nThe blue-chip average added about 0.3% in midday trading. Meanwhile, the broad S&P 500 and technology-heavy Nasdaq Composite slipped 0.3% and 0.4%, respectively.\n\nJohnson & Johnson and 3M led the Dow higher by percent change, climbing more than 4% and 2%, respectively. Boeing and Honeywell were the next-biggest gainers, with each adding about 1.4%.\n\nThose jumps overshadowed slides seen elsewhere. Nike was the worst performer in the average with a drop of nearly 2%, followed by Chevron's loss of almost 1%.\n\nDespite Wednesday's outperformance, the Dow has seen the smallest gain of the three major averages compared with the start of 2024.\n\nSuper Micro Computer, Starbucks, Pfizer among stocks making biggest midday moves\n\nThe logos of Super Micro Computer are pictured at one of the world's largest computer and technology trade shows.\n\nCheck out the companies making headlines in midday trading:\n\nSuper Micro Computer — The server vendor dropped 15% after missing revenue expectations for its fiscal third quarter. However, Super Micro beat analysts' expectations for its adjusted earnings and hiked its revenue guidance for its fiscal 2024 year.\n\nStarbucks — Shares plunged more than 16% after the coffee chain posted weaker-than-expected quarterly results on the top and bottom lines. Starbucks posted adjusted earnings of 68 cents per share on revenue of $8.56 billion. It missed analysts' forecasts of 79 cents per share in earnings and $9.13 billion in revenue, per LSEG.\n\nNew York Community Bank — Shares of the beaten-down regional bank popped more than 31% after CEO Joseph Otting said in a release, \"we have a clear path to profitability over the following two years.\"\n\nFor the full list, read here.\n\nShort interest in 'Magnificent 7' stocks climbed to record $127 billion in April, S3 Partners says\n\nShort interest in the \"Magnificent Seven\" stocks climbed to a record $127 billion in April, S3 Partners managing director of predictive analytics Ihor Dusaniwsky said in a report Wednesday.\n\nBets against the seven (Alphabet, Amazon, Apple, Microsoft, Meta Platforms, Nvidia and Tesla) \"will always be high,\" since they represent \"an easy and cheap way to hedge the tech aspect of a portfolio. But the momentum of the market, especially the tech side, does dictate the majority of the variances of short interest on these seven companies,\" Dusaniwsky said, noting that short interest on the seven averaged $86 billion a month over the past five years but fell as low as $57 billion in 2022.\n\nSo far in 2024, investors have made an estimated $5.6 billion shorting Tesla and $2.4 billion going against Apple, according to S3 mark-to-market data. But they have lost $9.8 billion betting the other way against Nvidia, are down $2.3 billion on Meta and off $2.1 billion on Amazon.\n\nGiven the past week's rebound in the market, S3 has mostly observed short covering in the group, where investors buy back stock to limit their losses. \"We have seen some squeeze related short covering in NVDA which was partially offset with increased short selling in MSFT, AAPL and META,\" S3 said.\n\nS&P 500 has seen 300 trading days since last dropping more than 2%\n\nTraders work on the floor of the New York Stock Exchange during morning trading on April 29, 2024.\n\nMichael M. Santiago | Getty Images\n\nThere have been 300 sessions since the S&P 500 last tumbled more than 2% in one day, according to Strategas.\n\nThat stretch of \"subdued volatility,\" as the firm calls it, is nearing levels last seen in 2017, when the broad index went more than 350 sessions without a slide that big. These periods are typically associated with above-average returns, Strategas' Ryan Grabinski told clients in a note.\n\nStill, he said it is a matter of when — and not if — volatility comes back. \"The real question is what exactly will the catalyst be for that to happen?\" Grabinski said in his Wednesday note.\n\nJob openings fell in April to lowest in more than 3 years\n\nJob openings declined by 325,000 in March, signaling that while hiring is still brisk, demand is decreasing.\n\nThe Labor Department's Job Openings and Labor Turnover Survey released Wednesday shows postings declined to a seasonally adjusted 8.49 million, which represented a 0.2 percentage point decrease to 5.1% as a share of total workers. Openings declined more than 1.1 million from a year ago.\n\nThat was the lowest level since February 2021 and took the ratio of openings to available workers down to 1.3 to 1, below its 2 to 1 peak in early 2022. Hires and separations also decreased on the month.\n\nFed Chair Powell's postmeeting comments could take a 'hawkish shift,' Wolfe Research says\n\nU.S. Federal Reserve Chair Jerome Powell holds a press conference following a two-day meeting of the Federal Open Market Committee on interest rate policy in Washington on March 20, 2024.\n\nElizabeth Frantz | Reuters\n\nFederal Reserve Chair Jerome Powell could take a more hawkish tone in Wednesday's press conference following the central bank's policy meeting, according to Wolfe Research. That would be in line with Powell's more recent comments on inflation after data pointed to persistent pricing pressures.\n\nBut the Wall Street firm anticipates that growth and employment will likely have more of an effect on stocks in the intermediate term, the firm's Chris Senyek wrote Wednesday. Wednesday's Fed meeting precedes the April jobs report that is due out Friday.\n\n\"We expect the FOMC's statement at 2pm ET and Fed Chair Powell's press conference tone to reflect the committee's hawkish shift two weeks ago,\" Senyek wrote. \"That said, looking out over the intermediate-term, we believe that the growth & employment outlook is likely to have a bigger influence on FOMC's decision making and overall equity market returns.\"\n\nISM manufacturing index declines while prices measure spikes\n\nThe manufacturing sector returned to a contraction in April, according to a report Wednesday from the Institute for Supply Management that also showed accelerating inflation pressures.\n\nThe ISM Manufacturing Index declined to 49.2 for the month, off 1.1 points from March, which was the first time the measure moved above the 50 level that indicates expansion since September 2022. Economists surveyed by Dow Jones had been looking for a reading of 50.1.\n\nWithin the survey, the prices index rose to 60.9, a 5.1-point increase and another indication that inflation is proving more intractable than economists and policymakers had been expecting.\n\nCVS Health heads for worst day since 2009\n\nPeople exit the CVS Pharmacy store in Times Square in New York City on March 1, 2024.\n\nEduardo Munoz Alvarez | View Press | Corbis News | Getty Images\n\nCVS Health sank more than 18% on Wednesday and headed for its worst day in nearly 15 years on the back of a disappointing quarter.\n\nThe slump came after the drugstore giant's quarterly results fell short of Wall Street's estimates. CVS also slashed its full-year outlook due to elevated medical costs.\n\nIf shares close at these levels, CVS will register its worst daily performance since Nov. 5, 2009, when shares tumbled more than 20%. It would also mark the company's third-worst trading day on record.\n\nS&P 500, Nasdaq open lower\n\nThe S&P 500 and Nasdaq Composite opened lower Wednesday as Wall Street braced for the Federal Reserve's upcoming rate decision.\n\nThe broad market index slipped 0.15%, along with the Nasdaq. The Dow Jones Industrial Average added 46 points, or 0.1%\n\nStocks making the biggest moves premarket\n\nA Marriott hotel in Austin, Texas, on Feb. 12, 2023.\n\nSergio Flores | Bloomberg | Getty Images\n\nHere are some of the companies making headlines in premarket trading:\n\nPfizer — Shares climbed more than 2% after New York City-based Pfizer beat Wall Street's first-quarter revenue forecast and raised its full-year profit guidance.\n\nCVS Health — Shares tumbled 12% after the drugstore chain and pharmacy benefit manager's first-quarter adjusted earnings and revenue fell short of estimates and it cut its full-year profit outlook, citing higher medical costs.\n\nMarriott International — The hotel chain slipped about 2% on the heels of weak earnings and current-quarter guidance. Marriott earned $2.13 per share, excluding items, in the first quarter, missing the consensus forecast of $2.17 from analysts polled by LSEG.\n\nRead the full list here.\n\nPrivate payrolls add 192,000 workers in April\n\nPrivate payrolls added 192,000 workers in April, according to the latest data from payrolls processing firm ADP.\n\nThe figure came in ahead of the 183,000 additions expected by Dow Jones, but below the 208,000 upward revision for March.\n\n— Jeff Cox, Samantha Subin\n\nAMD drops 7% after providing in-line forecast\n\nPau Barrena | Afp | Getty Images\n\nAMD shares dropped nearly 7% in premarket trading after the chipmaker provided only an in-line forecast for the current quarter.\n\nThe company reported first-quarter sales that were slightly ahead of Wall Street expectations, while AMD expects $4 billion in 2024 artificial intelligence chip sales, up from a $3.5 billion forecast in January.\n\nHowever, since the popular chip stock has already risen 14% in 2024, Tuesday's results were not enough to prevent the stock from sliding.\n\nCVS slides more than 10% after earnings miss\n\nA sign outside of a CVS Pharmacy store in Miami, Florida, on Feb. 7, 2024.\n\nJoe Raedle | Getty Images\n\nShares of CVS Health fell sharply in premarket trading after a first-quarter report missed Wall Street expectations on the top and bottom lines.\n\nThe pharmacy and health-care company reported $1.31 in adjusted earnings per share on $88.44 billion in revenue. Analysts surveyed by LSEG were expecting $1.69 in earnings per share on $89.21 billion in revenue.\n\nThe company also cut its full-year guidance for earnings per share and cash flow.\n\nCVS' health-care benefits segment struggled, with its adjusted operating income falling nearly 60% year over year despite an increase in revenue. The company said the decline was due in part to increased Medicare usage.\n\nThe stock was down more than 11%.\n\nShares of CVS fell sharply after reporting a weaker-than-expected first quarter.\n\nPfizer jumps 2% on strong outlook\n\nPfizer CEO Albert Bourla talks during a press conference with European Commission President Ursula von der Leyen after a visit to oversee the production of the Pfizer-BioNtech Covid-19 vaccine at the factory of U.S. pharmaceutical company Pfizer in Puurs, Belgium, on April 23, 2021.\n\nPfizer shares gained 2% after the drugmaker surpassed revenue expectations and lifted its profit outlook as it benefits from cost-cutting initiatives and strong sales within its non-Covid segments.\n\nThe company reported revenue of $14.88 billion, topping the $14.01 billion expected by analysts polled by LSEG.\n\nFor the fiscal year, Pfizer said it expects adjusted earnings to range between $2.15 and $2.35 a share. That is up from its previous guidance of $2.05 to $2.25 per share.\n\n— Samantha Subin, Annika Kim Constantino\n\nFTSE 100 opens higher\n\nThe London Stock Exchange Group offices are seen in London, England, on Dec. 29, 2017.\n\nToby Melville | Reuters\n\nThe U.K.'s FTSE 100 was 0.2% higher at 8:30 a.m. London time.\n\nMost European bourses are closed for the May Day public holiday. The regional Stoxx 600 index closed lower Tuesday as it clocked its first monthly decline since October.\n\nMicrosoft opens first regional data center in Thailand\n\nTech giant Microsoft announced it will open its first regional data center in Thailand.\n\nThe company said it will also build new cloud and artificial intelligence infrastructure in Thailand, as well as provide AI skilling opportunities for more than 100,000 people\n\nMicrosoft said the data center region will expand the availability of its hyperscale cloud services, \"facilitating enterprise-grade reliability, performance, and compliance with data residency and privacy standards.\"\n\nMitsui's full-year profit falls 6%, shares climb as $1.26 billion buyback announced\n\nJapanese trading house Mitsui and Co. reported a 6.4% fall in profit to 1.08 trillion yen, or $6.84 billion, for its 2023 financial year that ended March 31.\n\nProfit before tax came in at 1.3 trillion yen, down 6.7% year on year, while revenue dipped 6.9% to 13.32 trillion yen compared to the same period last year.\n\nDespite the poorer results, shares of the company climbed 1.23% as it also announced a 200 billion yen share buyback from May 2 to Sept. 20.\n\nMitsui will buy back up to 40 million shares, or 80 million after a share split on July 1.\n\nMoney market data suggests yen strengthening may have been intervention: Reuters\n\nThe sudden strengthening of the yen on Monday is likely due to intervention by Japanese authorities, Reuters reported, citing money market data from the Bank of Japan.\n\nMoney market data revealed that the central bank's projection for Wednesday's money market conditions indicated a 7.56 trillion yen, or $47.91 billion, net receipt of funds.\n\nReuters said this compared with a 2.05 billion yen to 2.30 billion yen estimate from money market brokerages that excludes intervention, adding that currency trades take two days to settle.\n\nOn Monday, the yen weakened to a 34-year low against the greenback, hitting 160.03 before strengthening to about 155 in the space of a few hours.\n\nSouth Korea's exports post sharp increase in April, beat expectations\n\nSouth Korea posted a 13.8% increase in exports in April, a sharp increase compared to the 3.1% rise in March, according to preliminary estimates by the country's customs service.\n\nThe rise also beat the 13.7% increase expected by economists polled by Reuters.\n\nImports to South Korea climbed 5.4%, less than the 6.2% rise expected and a reversal from the 12.3% fall in March.\n\nAs such, the country's trade balance narrowed to $1.53 billion, down from the $4.29 billion recorded in March.\n\nUtilities were the sole winning S&P 500 sector in April\n\nWorkers replace power lines in Monterey Park, California, on Oct. 6, 2023.\n\nFrederic J. Brown | AFP | Getty Images\n\nOf the 11 sectors within the S&P 500, utilities managed to eke out a narrow gain for this month.\n\nUtilities added 1.6% in April, while the other 10 sectors were in the red. Energy managed a narrow loss of 0.9%, while consumer staples, another defensive category, slipped 1.1%.\n\nThe sector's gains were buoyed by NextEra Energy, which advanced 4.8% in April. Consolidated Edison jumped 3.9%, and Dominion Energy gained 3.6%.\n\nUtilities, known for their steady dividends, could come into focus as investors look for income-producing assets to cushion their portfolios during rocky markets. Consider that NextEra Energy touts a dividend yield of 3.1%, while ConEd yields 3.5%.\n\nFed funds won't fall as far or as soon as previously expected, BofA said Tuesday\n\nBank of America on Tuesday pushed back by six months when it expects the Federal Reserve to start lowering interest rates, to December from June, and revised higher where it thinks the benchmark fed funds rate will end when the Fed is through with the next cycle.\n\n\"Following the recent stretch of inflation data that came in firmer than we expected, we revised higher our outlook for inflation in 2024 and, in turn, our outlook for Fed policy,\" wrote U.S. economist Michael Gapen. \"We now expect rate cuts to begin in December, versus June previously, and for the terminal rate in any easing cycle to finish at 3.5%-3.75%, up from 3.0%-3.25% previously.\"\n\nWith the current fed funds rate at 5.25% to 5.50%, Tuesday's move from BofA means the bank is now forecasting no more than seven quarter-point reductions from the Fed, rather than a previous expectation of nine.\n\n\"In short, we think the signal from the recent inflation data is that monetary policy will have to be tighter on average over the forecast horizon — not just in 2024 — to bring inflation down to 2.0%,\" Gapen wrote.\n\nStocks making the biggest moves after hours\n\nThe Starbucks logo is seen on a cup at one of its cafes on April 26, 2024.\n\nJakub Porzycki/ | Nurphoto | Getty Images\n\nCheck out the companies making headlines in extended trading:\n\nStarbucks — Shares slipped almost 10% in extended trading after the coffee chain missed fiscal second-quarter estimates on the top and bottom lines. Starbucks earned 68 cents per share on revenue of $8.56 billion, and missed the forecast from analysts polled by LSEG of 79 cents per share for earnings and $9.13 billion in revenue.\n\nPinterest — Shares surged nearly 19% following an earnings and revenue beat in the first quarter. Pinterest reported adjusted earnings of 20 cents per share, topping forecasts for 13 cents per share, according to LSEG. Revenue growth also accelerated in the quarter.\n\nSuper Micro Computer — Shares dropped nearly 8% after Super Micro Computer posted fiscal third-quarter revenue of $3.85 billion, missing the $3.95 billion consensus estimate, according to LSEG. Adjusted per-share earnings of $6.65 topped the earnings per share estimate of $5.78. The company also issued strong fourth-quarter revenue guidance.\n\nS&P 500 futures open lower Tuesday\n\nFutures tied to the S&P 500 fell Tuesday evening, sliding 0.2%.\n\nMeanwhile, Dow Jones Industrial Average futures traded near the flatline. Nasdaq 100 futures declined 0.4%.", "timestamp": "2024-05-01T19:12:56", "title": "Dow jumps 500 points as Powell says the Fed's next move is unlikely to be a hike: Live updates", "url": "https://www.cnbc.com/2024/04/30/stock-market-today-live-updates.html"}, {"id": "web-search_5", "snippet": "Range Dropdown Markets\n\nLatest News All Times Eastern\n\nscroll up scroll down\n\n11:02a This bank is using AI to work out S&P stock price targets for its millions of customers\n\n10:56a Barron's Snowflake Stock’s Post-Earnings Tumble Reveals the Risks of AI Hype\n\n10:53a New York Community Bancorp ‘is on its own’ to work out accounting mess, analyst says\n\n10:51a My wife and I are physicians with 457(b) plans that we can’t roll over into IRAs. How should we take this money in retirement? \n\n10:49a Consumer sentiment softens at the end of February, but stays at 32-month high\n\n10:43a Barron's Eli Lilly Stock Can Rise 33%, Analyst Says. It’s More Than Weight-Loss Drugs.\n\n10:40a Oil prices move higher on rising Mideast tensions\n\n10:37a Elon Musk sues OpenAI and Sam Altman for putting profits over humanity\n\n10:36a DWAC discloses new lawsuits seeking to block merger with Trump Media & Technology\n\n10:34a Barron's Zscaler Stock Falls After Earnings. ‘Any Dip Is a Buying Opportunity,’ Analyst Says.\n\nSet a price target alert\n\nMar 1, 2024 11:03 a.m. EST Real time quote\n\nToggle Chart Options\n\nVolume: 5.44M 65 Day Avg: 24.57M\n\n410.88 Day Range 414.97\n\n245.73 52 Week Range 420.82\n\nCustomize MarketWatch\n\nHave Watchlists? Log in to see them here or sign up to get started.\n\nCreate Account … or Log In\n\n(Go to Your Watchlist)\n\nNo Items in Watchlist\n\nThere are currently no items in this Watchlist.\n\nCreate a list of the investments you want to track.\n\nCreate Watchlist …or learn more\n\nSomething went wrong while loading Watchlist.\n\nRecently Viewed Tickers\n\nVisit a quote page and your recently viewed tickers will be displayed here.\n\nOverview More Content\n\nDay Range 410.88 - 414.97\n\n52 Week Range 245.73 - 420.82\n\nShares Outstanding 7.43B\n\nRev. per Employee $1.030M\n\nEx-Dividend Date Feb 14, 2024\n\nShort Interest 42.45M 02/15/24\n\n% of Float Shorted 0.58%\n\nAverage Volume 24.57M\n\nBuy Number of Ratings 53 Full Ratings\n\nMarketWatch Dow Jones\n\nElon Musk sues OpenAI and Sam Altman for putting profits over humanity\n\nMar. 1, 2024 at 10:37 a.m. ET by Barbara Kollmeyer\n\nUtilities This Firm Supplies Clean Power to AI Tech Companies. The CEO Wants More Credit.\n\nMar. 1, 2024 at 9:27 a.m. ET by Barron's\n\nAI is fueling a gold rush in new data centers, the hottest buildings in real estate\n\nMar. 1, 2024 at 7:03 a.m. ET by Joy Wiltermuth\n\nTechnology Elon Musk Sues Sam Altman’s OpenAI Over Microsoft Ties\n\nMar. 1, 2024 at 6:52 a.m. ET by Barron's\n\nMicrosoft Corp. stock outperforms competitors on strong trading day\n\nFeb. 29, 2024 at 4:33 p.m. ET by MarketWatch Automation\n\nTechnology Apple Shareholders Reject AI Reporting Proposal and Other Tech News Today\n\nFeb. 29, 2024 at 8:18 a.m. ET by Barron's\n\nMicrosoft Corp. stock outperforms competitors on strong trading day\n\nFeb. 28, 2024 at 4:33 p.m. ET by MarketWatch Automation\n\nTechnology Microsoft Has $50 Billion Ad Opportunity, Barclays Says. There Are Multiple Growth Levers.\n\nFeb. 28, 2024 at 12:25 p.m. ET by Barron's\n\nTechnology Meta Turns to LG to Hit Back at Apple Vision Pro, and Other Technology News Today\n\nFeb. 28, 2024 at 9:58 a.m. ET by Barron's\n\nAre U.S. stocks in a bubble? History says no.\n\nFeb. 27, 2024 at 5:20 p.m. ET by Joseph Adinolfi\n\nMicrosoft Corp. stock underperforms Tuesday when compared to competitors\n\nFeb. 27, 2024 at 4:32 p.m. ET by MarketWatch Automation\n\nMicrosoft to Acquire 10,000 Credits From Biochar Startup Bio-Logical -- OPIS\n\nFeb. 27, 2024 at 3:48 p.m. ET\n\nEven a rare Alphabet non-bull says Wall Street has overreacted on Google AI woes\n\nFeb. 27, 2024 at 3:20 p.m. ET by Emily Bary\n\nTechnology Microsoft Partners With an OpenAI Rival, and Other Technology News Today\n\nFeb. 27, 2024 at 10:58 a.m. ET by Barron's\n\nSony cuts 900 PlayStation jobs after PS5 sales fell short of expectations\n\nFeb. 27, 2024 at 10:30 a.m. ET by Steve Gelsi\n\nMarkets Why Biden’s Antitrust Crusade Against M&A Is a Problem for Stocks, and 5 Other Things to Know Before Markets Open\n\nFeb. 27, 2024 at 6:37 a.m. ET\n\nTechnology U.S. Projected to Make 20% of the World’s Most Advanced Chips by 2030, Commerce Secretary Says\n\nFeb. 26, 2024 at 6:29 p.m. ET by Barron's\n\nMicrosoft Corp. stock outperforms competitors despite losses on the day\n\nFeb. 26, 2024 at 4:32 p.m. ET by MarketWatch Automation\n\nTechnology Alphabet Stock Is ‘Cheap for a Reason.’ It’s Losing Its Competitive Advantage, Analyst Says.\n\nFeb. 26, 2024 at 10:20 a.m. ET by Barron's\n\nTechnology Google-Owner Alphabet Says Its Chips Can Beat Nvidia’s. What This Means for AI.\n\nApr. 6, 2023 at 10:39 a.m. ET by Barron's\n\nNo Headlines Available\n\nNo Headlines Available\n\nNo Headlines Available\n\nOther News Press Releases\n\nMarket Clubhouse Morning Memo - March 1st, 2024 (Trade Strategy For SPY, QQQ, AAPL, MSFT, NVDA, GOOGL, META, And TSLA)\n\nMar. 1, 2024 at 10:13 a.m. ET on Benzinga.com\n\nStock Market News for Mar 1, 2024\n\nMar. 1, 2024 at 9:32 a.m. ET on Zacks.com\n\nMicrosoft Sells Toys for Bob Studio, Eyeing Future Partnerships Amid Gaming Industry Overhaul\n\nMar. 1, 2024 at 9:24 a.m. ET on Benzinga.com\n\nMorning Brew: Dell Technologies Surges on AI Server Demand, Market Eyes Economic Data\n\nMorning Brew: Dell Technologies Surges on AI Server Demand, Market Eyes Economic Data\n\nMar. 1, 2024 at 9:20 a.m. ET on GuruFocus.com\n\nMusk Sues OpenAI, Flags Its Close Relationship with Microsoft\n\nMar. 1, 2024 at 8:30 a.m. ET on TipRanks.com\n\n5 Tech Giants to Buy for Long-Term Gains as Nasdaq Thrives\n\nMar. 1, 2024 at 8:13 a.m. ET on Zacks.com\n\nZacks Market Edge Highlights: NVIDIA, Super Micro Computer, Vertiv Holdings, Alphabet and Microsoft\n\nMar. 1, 2024 at 8:13 a.m. ET on Zacks.com\n\nWIX Gains 55.5% in the Past Year: Will the Rally Continue?\n\nMar. 1, 2024 at 7:33 a.m. ET on Zacks.com\n\nMicrosoft's Windows Is Getting One Of The Best Features Of Apple's Macs\n\nMar. 1, 2024 at 7:26 a.m. ET on Benzinga.com\n\nTech Giants Dive Into Humanoid Robotics: Tesla’s Optimus Leads the Charge\n\nMar. 1, 2024 at 6:51 a.m. ET on TipRanks.com\n\n2 Artificial Intelligence (AI) Stocks That Could Go Parabolic\n\nMar. 1, 2024 at 6:45 a.m. ET on Motley Fool\n\nIs FlexShares Quality Dividend Defensive ETF (QDEF) a Strong ETF Right Now?\n\nMar. 1, 2024 at 6:20 a.m. ET on Zacks.com\n\nIs WisdomTree U.S. Quality Dividend Growth ETF (DGRW) a Strong ETF Right Now?\n\nMar. 1, 2024 at 6:20 a.m. ET on Zacks.com\n\nShould Invesco FTSE RAFI US 1000 ETF (PRF) Be on Your Investing Radar?\n\nMar. 1, 2024 at 6:20 a.m. ET on Zacks.com\n\nElon Musk Says 'Bring It On' To OpenAI, Microsoft, And Bezos' $675M Humanoid Robot Venture, Pitches Tesla's Optimus As A Challenger\n\nMar. 1, 2024 at 6:19 a.m. ET on Benzinga.com\n\nIs Microsoft Stock a Buy Now?\n\nMar. 1, 2024 at 6:10 a.m. ET on Motley Fool\n\n3 Rising Chip Challengers Taking the Fight to Nvidia\n\nMar. 1, 2024 at 6:02 a.m. ET on InvestorPlace.com\n\n3 Artificial Intelligence (AI) Stocks With More Potential Than Any Cryptocurrency\n\nMar. 1, 2024 at 6:00 a.m. ET on Motley Fool\n\nMicrosoft's New Copilot For Finance Is Here To Help You From Data Entry To Strategic Analysis\n\nMar. 1, 2024 at 5:59 a.m. ET on Benzinga.com\n\nElon Musk Sues Sam Altman And OpenAI For 'Refining AGI' To Maximize Profits For Microsoft: 'Stark Betrayal Of Founding Agreement'\n\nMar. 1, 2024 at 5:27 a.m. ET on Benzinga.com\n\nNo Headlines Available\n\nNo Headlines Available\n\nNo Headlines Available\n\nMicrosoft Corp. engages in the development and support of software, services, devices, and solutions. It operates through the following business segments: Productivity and Business Processes, Intelligent Cloud, and More Personal Computing. The Productivity and Business Processes segment consists of Office Commercial (Office 365 subscriptions, the Office 365 portion of Microsoft 365 Commercial subscriptions, and Office licensed on-premises), Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, and Skype for Business, Office Consumer, including Microsoft 365 Consumer subscriptions, Office licensed on-premises, and other Office services, LinkedIn, including Talent Solutions, Marketing Solutions, Premium Subscriptions, Sales Solutions, and Learning Solutions, Dynamics business solutions, including Dynamics 365, comprising a set of intelligent, cloud-based applications across ERP, CRM, Customer Insights, Power Apps, and Power Automate, and on-premises ERP and CRM applications. The Intelligent Cloud segment consists of Server products and cloud services, including Azure and other cloud services, SQL Server, Windows Server, Visual Studio, System Center, and related Client Access Licenses (CALs), and Nuance and GitHub, Enterprise Services, including Enterprise Support Services, Microsoft Consulting Services, and Nuance professional services. The More Personal Computing segment consists of Windows, including Windows OEM licensing and other non-volume licensing of the Windows operating system, Windows Commercial, comprising volume licensing of the Windows operating system, Windows cloud services, and other Windows commercial offerings, patent licensing, and Windows Internet of Things, Devices, including Surface and PC accessories, Gaming, including Xbox hardware and Xbox content and services, comprising digital transactions, Xbox Game Pass and other subscriptions, video games, third-party video game royalties, cloud services, and advertising, Search and news advertising. The company was founded by Paul Gardner Allen and William Henry Gates, III in 1975 and is headquartered in Redmond, WA.\n\nInternational Business Machines Corp.\n\nClose Trending Tickers bar\n\nAbove average volume.\n\nAccess Premium Tools\n\nRecently Viewed Tickers\n\nVisit a quote page and your recently viewed tickers will be displayed here.\n\nAll News Articles Video Podcasts\n\nThis browser is no longer supported at MarketWatch. For the best MarketWatch.com experience, please update to a modern browser.\n\nChrome Safari Firefox Edge", "timestamp": "2024-04-26T22:09:00", "title": "MSFT Stock Price | Microsoft Corp. Stock Quote (U.S.: Nasdaq) | MarketWatch", "url": "https://www.marketwatch.com/investing/stock/msft"}, {"id": "web-search_4", "snippet": "Stocks: Most Actives\n\nHighest Open Interest\n\nHighest Implied Volatility\n\nCommunication Services\n\nBalance Transfer Cards\n\nMarket Domination Overtime\n\nStocks in Translation\n\nGood Buy or Goodbye?\n\nScores and schedules\n\nScores and schedules\n\nWorld Baseball Classic\n\nScores and schedules\n\nScores and schedules\n\nScores and schedules\n\nScores and schedules\n\n© 2024 All rights reserved.\n\nAbout our ads Advertising Careers\n\nYahoo Finance Yahoo Finance\n\nStocks: Most Actives\n\nHighest Open Interest\n\nHighest Implied Volatility\n\nCommunication Services\n\nBalance Transfer Cards\n\nMarket Domination Overtime\n\nStocks in Translation\n\nGood Buy or Goodbye?\n\nBetter quotes, more news, smarter tools. Welcome to the future of finance. Discover What's New\n\nFed holds interest rates steady, cites 'lack of progress' on inflation\n\nStock market today: Stocks rally as Powell soothes rate nerves\n\nKaren Friar and Josh Schafer\n\nUpdated Wed, May 1, 2024, 2:50 PM\n\nUS stocks were higher on Wednesday as investors digested commentary from the Federal Reserve chair Jerome Powell after the central bank held interest rates steady at its latest policy meeting.\n\nThe S&P 500 (^GSPC) rose about 0.8% while Dow Jones Industrial Average (^DJI) and Nasdaq Composite (^IXIC) popped about 1%.\n\nFed officials said in a policy statement Wednesday, “In recent months, there has been a lack of further progress towards the committee’s 2% inflation objective.”\n\nStocks took a noticeable leg higher after Powell said \"it is unlikely the next policy move will be a hike.\"\n\nElsewhere in markets, disappointing after-hours results from chipmaker AMD (AMD) and server maker Super Micro Computer (SMCI) took the shine off hopes for an AI-fueled boost to the sector. AMD shares sank nearly 10% while Super Micro fell more than 16%. The news weighed more broadly on chipmakers like Nvidia (NVDA), which dropped almost 5%.\n\nRead more: What the Fed rate decision means for bank accounts, CDs, loans, and credit cards\n\nMeanwhile, earnings season rolls on. CVS (CVS) shares slid more than 18% in morning trading after the healthcare giant cut its 2024 profit forecast.\n\nStarbucks (SBUX) shares tumbled around 17% in the wake of a bad earnings miss for the coffee chain, which reported late Tuesday.\n\nIn economic data, the latest Job Openings and Labor Turnover Survey (JOLTS) showed job openings declined modestly in March. Elsewhere, the latest ISM Manufacturing data showed activity declined in April, after turning positive the month prior.\n\nWed, May 1, 2024 at 2:47 PM EDT\n\nPowell: \"It is unlikely the next policy move will be a hike\"\n\nStocks took a noticeable leg higher as Federal Reserve chair Jerome Powell said further interest rate hikes aren't likely even though inflation has begun falling slower than initally hoped.\n\n\"It is unlikely the next policy move will be a hike,\" Powell said.\n\nThe S&P 500 (^GSPC) rose about 0.8% while Dow Jones Industrial Average (^DJI) and Nasdaq Composite (^IXIC) popped about 1%.\n\nWed, May 1, 2024 at 2:00 PM EDT\n\nFed holds interest rates steady\n\nThe Federal Reserve held rates steady in a range of 5.25%-5.50% at the conclusion of its two-day policy meeting on Wednesday. The central bank has maintained this range since July after it hiked rates to their highest level in 22 years.\n\nFed Chair Jerome Powell will hold a press conference at 2:30 p.m. ET.\n\nWed, May 1, 2024 at 1:50 PM EDT\n\nA look at stocks before the Fed\n\nThe main driver of markets today is expected to be Federal Reserve chair Jerome Powell's press conference at 2:30 p.m. ET.\n\nEntering the action, stocks have been relatively quiet on Wednesday. The S&P 500 (^GSPC) is down about 0.3%, while Dow Jones Industrial Average (^DJI) is up more than 0.3%. The Nasdaq Composite (^IXIC) is lower by about 0.3%.\n\nIn bonds, the 10-year Treasury yield (^TNX) is sitting at 4.65%, down about 3 basis points on the day.\n\nMeanwhile, Utilities (XLU) are leading the sector action in the S&P 500.\n\nSource: Yahoo Finance\n\nWed, May 1, 2024 at 1:00 PM EDT\n\nWhat to expect from Powell's press conference\n\nThe Federal Reserve will announce its policy decision at 2 p.m. ET, followed by Chair Powell’s press conference at 2:30 p.m. ET.\n\nThe central bank is widely expected to hold rates steady, putting emphasis on what Powell says about the likelihood of interest rate cuts this year.\n\nYahoo Finance's Jennifer Schonberger has the preview:\n\nFed Chairman Jerome Powell is likely to reiterate at his press conference that there is no urgency to act anytime soon.\n\nThe reason: Inflation is stickier than anticipated in 2024.\n\nHis message could be a repeat of a higher-for-longer stance taken a couple of weeks ago when Powell said that it would take \"longer than expected\" to achieve the confidence needed to get inflation down to the central bank’s 2% target.\n\n\"Given the strength of the labor market and progress on inflation so far, it's appropriate to allow restrictive policy further time to work and let the data and the evolving outlook guide us,\" Powell said on April 16.\n\nMarkets reacted to those comments by pulling back their expectations for 2024. Traders now are pricing in just one rate cut for the year, down from the median of three cuts estimated by Fed officials in March.\n\nPowell \"almost has to be somewhat noncommittal because the question of rate cuts and the timing of rate cuts and even the question of a rate hike are all in the air at the moment,\" former Atlanta Fed president Dennis Lockhart told Yahoo Finance Live on Monday.\n\n\"He simply cannot be definitive on any particular path or policy.\"\n\nInvestors will listen for any hints about how Powell's thinking about cuts has changed and what data is needed before the cuts can begin.\n\nThe shift in market expectations comes after three straight months of higher-than-expected inflation readings on two indexes: the Consumer Price Index (CPI) and the Fed’s preferred gauge, the Personal Consumption Expenditures (PCE) Index.\n\nSo-called core PCE, which excludes volatile food and energy prices, rose at a clip of 2.8% year over year for the month of March, which was the same level as February and a tenth of a percent higher than expected.\n\nThe three-month annualized reading on core PCE jumped to 4.4%, a move economists say is enough to concern Fed officials that inflation may be accelerating.\n\nWed, May 1, 2024 at 12:14 PM EDT\n\nStarbucks is having its worst day since 2000\n\nStarbucks (SBUX) shares tumbled about 17% on Wednesday following a disappointing quarterly results update. As of noon on Wednesday, this marked the worst day for the coffee chain's stock since 2000.\n\nThe company missed Wall Street's estimates on a string of important growth metrics, as compiled by Yahoo Finance's Brooke DiPalma:\n\nAdjusted earnings per share: $0.68 versus $0.80 (est.)\n\nRevenue: $8.56 billion versus $9.13 billion (est.)\n\nSame-store sales growth: -4% versus +1.46% (est.)\n\nFoot traffic growth: -6% versus -0.27% (est.)\n\nTicket size growth: 2% versus 2.41% (est.)\n\nUBS analyst Dennis Geiger slashed his price target to $85 from $95 following the release while maintaining a Neutral rating on the stock. Geiger noted that limited visbility into when sales in the US and China are expected to pick back up will \"likely weigh on shares.\"\n\n\"While management presented plans across throughput, innovation, & marketing / promos to support improved occasional customer demand & traffic over time, we expect pressured transactions for at least the remainder of the year,\" Geiger wrote in a note to clients.\n\nWed, May 1, 2024 at 11:17 AM EDT\n\nGood might not be good enough for AI investors right now\n\nAMD's (AMD) latest round of quarterly results reminded investors that not all chipmakers are going to see Nvidia (NVDA) like growth amid the artificial intelligence boom.\n\nThe chipmaker reported it expects current quarter revenue in a range of $5.4 to $6 billion, closely in line with Wall Street's estimates for $5.7 billion.\n\nBut shares fell more than 7% on Wednesday, reflecting that in line reports might not be enough for AI investors after more than 70% run up in AMD stock over the past year.\n\nSpecifically, Wall Street analysts noted that the outlook for AI growth within AMD might not be as robust as some had hoped.\n\nIn a note cutting his price target to $185 from $195, Bank of America research analyst Vivek Arya wrote that AMD bulls might've been disappointed in the company's forecast for MI300 chips in 2024, which came in at $4 billion. While an increase from the prior guide of $3 billion, Arya noted that it felt short of more optimistic outlooks for a range of $5 to $6 billion.\n\nThis comes in contrast to Nvidia's recent run of AI dominance where the company has consistently surprised Wall Street's lofty expectations.\n\n\"We believe NVDA's vertical integration across systems/software will remain tough for AMD to beat,\" Arya wrote.\n\nWedbush analyst Matt Bryson reasoned the price reaction in AMD was investors falling to see the \"forest through the trees\" in the AI story.\n\nBut AMD's move mirrored other drops in the AI trade on Wednesday, pointing to a slowdown in investor enthusiasm around the trade, particularly in names that have rallied heavily over the past year.\n\nSuper Micro Computer (SMCI) shares, which had been up more than 700% over the past year, fell more than 17% on Wednesday after the company reported quarterly revenue of $3.85 billion, short of Wall Street's estimates for $3.95 billion but still reflecting about 200% growth compared the same period a year prior.\n\nThe company also boosted its full-year revenue guidance to a range of $14.7 billion to $15.1 billion, up from a prior range of $14.3 billion to $14.7 billion.\n\nEven the guidance raise didn't appear to be enough for investors after the stock's recent run, reflecting that good might not be good enough in the AI momentum trade right now.\n\nWed, May 1, 2024 at 10:34 AM EDT\n\nUS manufacturing sector sends a challenging signal for the Fed\n\nOn a busy day for markets, let's not overlook the latest data on US manufacturing activity from the Institute for Supply Management.\n\nThe ISM's Manufacturing PMI reading for April came in at 49.2, suggesting a contraction in the sector.\n\nThe report also showed that prices paid for manufacturers rose for the fourth straight month, with this sub-index expanding to a measure of 60.9. The ISM's readings measure the respondents indicating growth minus those indicating contraction.\n\nGrowth slowing and inflation growing again will bring to mind for investors one theme: stagflation.\n\nOf course, we're quite a ways away from this scenario. But the market is generally sensitive right now to an environment that could put the Fed, which has a clear preference to begin lower interest rates, in an even tougher spot with respect to its preferred policy path.\n\nOverall, the ISM's report showed the economy remains in expansion territory; as the firm noted in its report, manufacturing readings above 42.5 generally indicate an economy in expansion.\n\n\"Demand remains at the early stages of recovery, with continuing signs of improving conditions,\" said Tim Fiore, chair of the ISM's survey committee. \"Production execution continued to expand in March, but at a slower rate of growth than in prior months. Suppliers continue to have capacity but work to improve lead times, due to their raw material supply chain disruptions. Thirty-four percent of manufacturing gross domestic product (GDP) contracted in April, up from 30 percent in March.\"\n\nCommentary from respondents to the ISM's survey was similarly mixed — some good, some bad, some frustrated, some hopeful.\n\nBut as one contact in the electrical equipment industry said: \"There has been a lot of volatility in sales. On average, our sales look flat, but the volatility is concerning.\"\n\nAn emerging theme in the US economy, for investors and businesses both.\n\nWed, May 1, 2024 at 10:24 AM EDT\n\nJob openings tick lower in March, quits rate hits lowest level since August 2020\n\nJob openings ticked lower in March as hiring also decreased, reflecting a slight cooling in the US labor market.\n\nNew data from the Bureau of Labor Statistics released Wednesday showed there were about 8.48 million jobs open at the end of March, a decrease from the 8.81 million job openings in February. Economists surveyed by Bloomberg had expected the report to show there were 8.68 million openings in March.\n\nThe Job Openings and Labor Turnover Survey (JOLTS) survey also showed the quits rate, a sign of confidence among workers, fell to 2.1%, its lowest level since August 2020.\n\nMeanwhile, the pace of hiring declined in March. The hiring rate fell to 3.5% in March, down from 3.7% the month prior.\n\nWed, May 1, 2024 at 8:14 AM EDT\n\nAMD takes a drubbing\n\nShares of Advanced Micro Devices (AMD) are taking a beating premarket after earnings last night.\n\nThis looks to be a classic case of a stock priced for perfection and the quarter and outlook not being 110% perfect.\n\nThe company's gaming business looks like it will stay under pressure through 2025, which probably caught the AMD bulls by surprise. It has caused some on the Street to take more measured views on profit potential this year.\n\nAMD CEO Lisa Su did hike her outlook for MI300 AI chip sales to $4 billion for 2024, up from $3.5 billion previously. That has quieted chatter in the market that AMD's new AI chips were inferior to Nvidia (NVDA) in terms of quality.\n\nAll in all, not a brutal Starbucks-like (SBUX) quarter by any means. But the Street wanted more and didn't get it.\n\nWed, May 1, 2024 at 5:42 AM EDT\n\nStarbucks is a disaster right now\n\nI have always been hypercritical of Starbucks (SBUX).\n\nI remember covering the company as a stock analyst and spending weeks inside its stores studying the workflows of each department. It was an extreme exercise that did not win me any fans among Starbucks management (especially with former CEO Howard Schultz), but I was young, didn't give a damn what management thought, and believed it had to be done to make a proper call on the stock.\n\nI cut my rating on Starbucks to Sell in January 2014, citing an increasingly complex operating system that was hurting margins, sales potential, and employee relations. Then I wrote an op-ed on CNBC, leaning into the call in the hopes that investors didn't get burned. That, too, didn't win me any fans at Starbucks.\n\nMore than 10 years later, my job has changed. I have personally evolved (though I am still as intense as I was in 2014, just in different ways), and I no longer drink 15 coffees (five with one energy drink) a day. But as I sit here today pondering Starbucks' awful, awful earnings call last night (the byproduct of a horrendous quarter) and seeing the stock shockingly plunge 12% premarket (this is Starbucks!), Starbucks is mirroring the company I remember in 2014 — one that is throwing 97 pieces of gum at the wall in the hopes something sticks.\n\nAnd that all-over-the-place mentality by management is NOT a good thing for shareholders.\n\nHere's what I didn't like about the quarter and call:\n\nThe company's new products, such as the lavender latte, aren't 100% resonating with consumers. Why? It doesn't taste good (try it, it doesn't!), much like many of the new products they have dropped of late. What is going on in that R&D lab?\n\nThe company feels confused about what to do to bring back steady sales growth. It's now going to introduce drinks with beads, aka pearls, to add texture and compete with boba tea shops. This is coming at the same time it's introducing zero-sugar options, an energy drink, and a tomato and mozzarella sandwich. This all sets up to be an operational nightmare, with its contentious relationships with overworked store employees, and the products may not resonate with consumers. If I want an energy drink, I am going to the cooler section at 7-11.\n\nThe company has ramped up efforts to cater to the evening crowd. Why? We aren't drinking coffee before bed, and we aren't going to Starbucks for a workplace happy hour. It's Starbucks — get us our two coffees before noon quickly (maybe with a discount), don't make them taste burnt, and we're good.\n\nChina's results have fallen off a cliff amid more discounting.\n\nThe company isn't delivering enough value to the occasional, cost-conscious consumer who is reasoning that there is no need to spend $7 on an iced coffee at Starbucks when McDonald's (MCD) coffee tastes surprisingly great.\n\nAs Jefferies analyst Andy Barish pointed out this morning:\n\n\"Many factors at play here including broad consumer tepidness on discretionary restaurant spend, but we think recent menu innovation (Lavender, Oleato) simply haven't been received well, even as management cites success there; note exit rate of out the second quarter into April showed continued headwinds, even with the Lavender launch later in the quarter. We are also skeptical towards the planned slate of new products this year (\"pearls\", energy), and think a re-focus on the core menu and other drivers i.e. value, promos, loyalty, operational improvements, and marketing would be prudent - drivers that appear to be resonating well, all else considered.\"\n\nBarish is on the mark.\n\nCEO Laxman Narasimhan is officially one year into the top job. Every quarter since he took over has been a letdown, if not increasingly more so than the prior one. He and his team have served up a host of excuses, including blaming bad weather on the call last night.\n\nThe bottom line is that the honeymoon is over for Narasimhan, and he now enters the hot seat. If the company doesn't stabilize after a host of new initiatives this summer, he could be taking his favorite Starbucks coffee, the doppio espresso macchiato, out the door of the company's Seattle HQ and into another role elsewhere in 2025.\n\nU.S. markets close in 1h 9m\n\nUS Europe Asia Rates Commodities Currencies Cryptocurrencies\n\nSign in to create a watchlist Sign in\n\nSBUX Starbucks Corporation\n\nNVDA NVIDIA Corporation\n\nCVS CVS Health Corporation\n\nAMD Advanced Micro Devices, Inc.", "timestamp": "2024-05-01T18:51:25", "title": "Stock market today: Stocks rally as Powell soothes rate nerves", "url": "https://finance.yahoo.com/news/stock-market-today-stocks-rally-as-powell-soothes-rate-nerves-113149898.html"}]}