{"text": "Here is a summary of recent news relating to Exxon Mobil Corporation (XOM) stock that may influence a buy/sell decision:\n- California is set to conclude its probe into Exxon's plastic pollution.\n- Exxon leads the industry fight against UN talks seeking a cap on plastic production.\n- Exxon Mobil is worth more than Tesla.\n- Goldman picks top capex and R&D stocks (including Exxon Mobil).\n- Turkey is in talks with ExxonMobil over a multibillion-dollar LNG deal.\n- ExxonMobil stock has a 24% upside, according to one Wall Street analyst.\n- ExxonMobil is one of the world's top dividend payers.\n- ExxonMobil stock was a good buy in 2022, but is it still?\n- Oil prices are on the rise, and dividend giants like ExxonMobil are reaping the benefits.", "documents": [{"id": "web-search_0", "snippet": "Skip to Main Content\n\nSkip to Related Content\n\nSign in to view your mail\n\nExxon Mobil Corporation (XOM)\n\nNYSE - Nasdaq Real Time Price. Currency in USD\n\nVisitors trend2W10W9M\n\nAt close: 04:01PM EDT\n\n(-0.15%) After hours:\n\nTrade prices are not sourced from all markets\n\nGain actionable insight from technical analysis on financial instruments, to help optimize your trading strategies\n\nBullishpattern detected\n\nCommodity Channel Index\n\nView all chart patterns\n\nForward Dividend & Yield\n\nFair Value is the appropriate price for the shares of a company, based on its earnings and growth rate also interpreted as when P/E Ratio = Growth Rate. Estimated return represents the projected annual return you might expect after purchasing shares in the company and holding them over the default time horizon of 5 years, based on the EPS growth rate that we have projected.\n\nSubscribe to Yahoo Finance Plus to view Fair Value for XOMLearn more\n\nResearch that delivers an independent perspective, consistent methodology and actionable insight\n\nExxon Mobil Corporation\n\nAnalyst Report: Exxon Mobil CorporationExxonMobil is an integrated oil and gas company that explores for, produces, and refines oil around the world. In 2023, it produced 2.4 million barrels of liquids and 7.7 billion cubic feet of natural gas per day. At the end of 2023, reserves were 16.9 billion barrels of oil equivalent, 66% of which were liquids. The company is one the world's largest refiners with a total global refining capacity of 4.5 million barrels of oil per day and is one of the world's largest manufacturers of commodity and specialty chemicals.\n\n11 days agoMorningstar\n\nAnalyst Report: Exxon Mobil CorporationExxonMobil is an integrated oil and gas company that explores for, produces, and refines oil around the world. In 2023, it produced 2.4 million barrels of liquids and 7.7 billion cubic feet of natural gas per day. At the end of 2023, reserves were 16.9 billion barrels of oil equivalent, 66% of which were liquids. The company is one the world's largest refiners with a total global refining capacity of 4.5 million barrels of oil per day and is one of the world's largest manufacturers of commodity and specialty chemicals.\n\n11 days ago•MorningstarView more\n\nIs It Too Late to Buy ExxonMobil Stock?\n\nExxon's stock price is up sharply since the early days of 2024, but there are really two ways to think about this energy giant.\n\nDon't Miss Out: Best Stocks Alerts Daily\n\nGet the latest breaking news and alerts on the hottest stocks under $15 daily, right at your fingertips.\n\nIs It Too Late to Buy Chevron Stock?\n\nThe simple answer is yes, but nothing is ever simple on Wall Street, particularly when you are dealing with a volatile commodity like oil.\n\nData DisclaimerHelpSuggestions\n\nTermsandPrivacy Policy\n\nAbout Our AdsSitemap\n\n© 2024 Yahoo. All rights reserved.\n\nYahoo Finance updates are here. Better quotes, news, and tools.", "timestamp": "2024-04-29T09:52:33", "title": "Exxon Mobil Corporation (XOM) Latest Stock News & Headlines - Yahoo Finance", "url": "https://finance.yahoo.com/quote/XOM/news/"}, {"id": "web-search_3", "snippet": "Entering text into the input field will update the search result below\n\nSearch for Symbols, analysts, keywords\n\nXOM Exxon Mobil Corporation\n\nStock Price & OverviewFollow\n\n$120.80-0.23 (-0.19%)3:06 PM 04/24/24\n\nNYSE | $USD | Realtime\n\nExpand For Key Data »\n\nExxon Mobil: Excellent Business, With Near-Term Challenges For The Share Price\n\nCalifornia set to conclude probe into Exxon's 'plastic pollution,' AG says\n\nExxon leads industry fight against UN talks seeking cap on plastic production\n\nThe Great Oil-EV Flippening: Exxon Mobil is worth more than Tesla\n\nExxon Mobil: Maintaining Our Buy, But You May Get A Better Entry Soon\n\nExxon Mobil: What To Expect From Q1 Earnings Results\n\nGoldman picks top capex and R&D stocks\n\nEarnings week ahead: Tesla, Meta Platforms, Google, Microsoft, Intel, Exxon Mobil, and more\n\nEPA approves summer sales of higher-ethanol gasoline blend\n\nCatalyst Watch: Tesla, Boeing and General Motors brace for earnings fireworks\n\nMore News And Analysis »\n\nExxon Mobil Corporation engages in the exploration and production of crude oil and natural gas in the United States and internationally. It operates through Upstream, Energy Products, Chemical Products, and Specialty Products segments. The Upstream segment explores for and produces crude oil and natural gas. The Energy Products segment offers fuels, aromatics, and catalysts, as well as licensing services. It sells its products under the Exxon, Esso, and Mobil brands. The Chemical Products segment manufactures and markets petrochemicals including olefins, polyolefins, and intermediates. The Specialty Products segment offers performance products, including lubricants, basestocks, waxes, synthetics, elastomers, and resins. The company also involves in the manufacturing, trade, transport, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; and pursuit lower-emission business opportunities, including carbon capture and storage, hydrogen, lower-emission fuels, and lithium. Exxon Mobil Corporation was founded in 1870 and is based in Spring, Texas.Hide\n\nIntegrated Oil and Gas\n\n22777 Springwoods Village Parkway\n\nSpring, TX, 77389-1425\n\ncorporate.exxonmobil.com\n\nXOM Earnings Per Share\n\nXOM Dividend Growth History\n\nMore On Dividend Growth »\n\nInvestor Presentations\n\nSee All SEC Filings »\n\nSee All Press Releases »\n\nXOM Income Statement\n\nXOM Cash Flow Statement\n\nXOM Long Term Solvency\n\nYou may be interested in:\n\nExxon Mobil Corporation (XOM) Frequently Asked Questions\n\nTo ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser.\n\nIs this happening to you frequently? Please report it on our feedback forum.\n\nIf you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh.", "timestamp": "2024-04-24T19:08:07", "title": "Exxon Mobil Corporation (XOM) Stock Price, Quote, News & Analysis", "url": "https://seekingalpha.com/symbol/XOM"}, {"id": "web-search_4", "snippet": "Accessibility Log In Help Join The Motley Fool\n\nExxonMobil (NYSE: XOM)\n\nPrice as of April 26, 2024, 11:53 a.m. ET\n\nExxonMobil Return vs. S&P\n\nExxonMobil Company Info\n\nExxon Mobil Corp. engages in the exploration, development, and distribution of oil, gas, and petroleum products. It operates through the following segments: Upstream, Downstream and Chemical. The Upstream segment produces crude oil and natural gas. The Downstream segment manufactures and trades petroleum products. The Chemical segment offers petrochemicals. The company was founded by John D. Rockefeller in 1882 and is headquartered in Irving, TX.\n\nThe Fool has written over 2,600 articles on ExxonMobil.\n\nThese Are Billionaires’ Favorite Energy Stocks\n\nOil and gas dominate the energy holdings of billionaire-led hedge funds.\n\nJack Caporal | Apr 25, 2024\n\nWhat Is Anti-ESG Investing?\n\nRobin Hartill | Apr 22, 2024\n\nExxonMobil Hits All-Time High, Closes in on Half-Trillion-Dollar Market Cap. Has the Stock Market's Leadership Changed?\n\nDaniel Foelber | Apr 21, 2024\n\nThe energy sector has been on an incredible run over the last few years.\n\n2 Top Dividend Stocks to Buy Right Now\n\nJoe Tenebruso | Apr 21, 2024\n\nThese stalwart businesses can help you safeguard your wealth.\n\nHow Much Will ExxonMobil Pay in Dividends This Year?\n\nMatt DiLallo | Apr 16, 2024\n\nThe oil giant is one of the world's top dividend payers.\n\nExxonMobil Stock Has 24% Upside, According to 1 Wall Street Analyst\n\nRich Smith | Apr 15, 2024\n\nExxonMobil stock was a good buy in 2022. Is it still?\n\n2 No-Brainer Oil Dividend Stocks to Buy Right Now With Less Than $500\n\nJustin Pope | Apr 10, 2024\n\nThese two oil and natural gas titans could remain hot for some time.\n\nWhy Oil Stocks ExxonMobil, Pioneer Natural Resources, and Baker Hughes Rallied in March\n\nBilly Duberstein | Apr 7, 2024\n\nOil prices are on the rise, and these dividend giants are reaping the benefits. View More XOM Articles\n\nEnergy Edition: 2021 Review & 2022 Preview\n\nThis is a sector worth watching.\n\nMatt DiLallo | Dec 24, 2021\n\nYear-End Financial Tips\n\nAnd a look at the energy industry.\n\nAlison Southwick and Robert Brokamp | Dec 11, 2020\n\nBottom-Fishing and Trend-Chasing: Exxon's Writedown and Renewable Energy's Surge\n\nJust because a stock has been on a crazy run, that doesn't necessarily make it a winner.\n\nJason Hall | Dec 8, 2020\n\nWhat's Behind ExxonMobil's Recent Multibillion-Dollar Purchase\n\nIs being \"better late than never\" true for America's biggest oil major?\n\nConnor Lott and Sean O'Reilly | Jul 12, 2017 View More XOM Podcasts\n\nEarnings Transcripts\n\nExxonMobil (XOM) Q4 2023 Earnings Call Transcript\n\nXOM earnings call for the period ending December 31, 2023.\n\nMotley Fool Transcribing | Feb 2, 2024\n\nExxonMobil (XOM) Q3 2023 Earnings Call Transcript\n\nXOM earnings call for the period ending September 30, 2023.\n\nMotley Fool Transcribing | Oct 27, 2023\n\nExxonMobil (XOM) Q2 2023 Earnings Call Transcript\n\nXOM earnings call for the period ending June 30, 2023.\n\nMotley Fool Transcribing | Jul 28, 2023\n\nExxonMobil (XOM) Q1 2023 Earnings Call Transcript\n\nXOM earnings call for the period ending March 31, 2023.\n\nMotley Fool Transcribing | Apr 28, 2023 View More XOM Earnings Transcripts\n\nWashington H. Soul Pattinson and Company Limited\n\nPremium Investing Services\n\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n\nView Premium Services", "timestamp": "2024-04-26T16:08:32", "title": "ExxonMobil (XOM) Stock Price, News & Info | The Motley Fool", "url": "https://www.fool.com/quote/nyse/xom/"}, {"id": "web-search_5", "snippet": "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv\n\nSkip to main content\n\ntrading lowerNegativeSPX5,096.64-0.07%Negative\n\ntrading higherPositiveIXIC15,927.90+2.03%Positive\n\ntrading higherPositiveDJI38,307.56+0.18%Positive\n\ntrading higherPositiveSTOXX508.34+0.07%Positive\n\ntrading higherPositiveFTSE8,147.03+0.09%Positive\n\ntrading higherPositiveN22537,934.76+0.81%PositiveGet real-time market data from LSEG\n\nExxon Mobil CorpXOM.N\n\nOfficial Data Partner\n\ntrading higher119.22USD\n\nAs of Apr 29, 2024. Values delayed up to 15 minutes\n\n3 Month Average Trading Volume\n\n2.23 mean rating - 26 analysts\n\nP/E Excl. Extra Items (TTM)\n\nPrice To Sales (TTM)\n\nPrice To Book (Quarterly)\n\nPrice To Cash Flow (Per Share TTM)\n\nTotal Debt/Total Equity (Quarterly)\n\nLong Term Debt/Equity (Quarterly)\n\nReturn On Investment (TTM)\n\nReturn On Equity (TTM)\n\nAbout Exxon Mobil Corp (XOM.N)\n\nExxon Mobil Corporation is an international energy and petrochemical company. The Company’s primary businesses include exploration for, and production of, crude oil and natural gas; manufacture, trade, transport and sale of crude oil, natural gas, petroleum products, petrochemicals, and a variety of specialty products; and pursuit of lower-emission business opportunities including carbon capture and storage, hydrogen, lower-emission fuels, and lithium. Its segments include Upstream, Energy Products, Chemical Products, and Specialty Products. The Upstream segment explores for and produces crude oil and natural gas. The Energy Products, Chemical Products, and Specialty Products segments manufactures and sells petroleum products and petrochemicals. Energy Products include fuels, aromatics, and catalysts and licensing. Its Chemical Products consists of olefins, polyolefins, and intermediates. Its Specialty Products include finished lubricants, synthetics, and elastomers and resins.\n\n22777 SPRINGWOODS VILLAGE PARKWAY SPRING, TX 77389-1425 United States\n\nhttps://corporate.exxonmobil.com/\n\nOil & Gas Operations\n\nExecutive Leadership\n\nChairman of the Board, President, Chief Executive Officer\n\nChief Financial Officer, Senior Vice President\n\nPresident - ExxonMobil Global Projects Company\n\nSenior Vice President\n\nSenior Vice President\n\nVice President, General Counsel, Secretary\n\nVice President, Controller\n\nVice President - Tax, Treasurer\n\nVice President - Corporate Strategic Planning\n\nLead Independent Director\n\nDina Powell Mccormick\n\nNon-Executive Director\n\nMichael J. Angelakis\n\nIndependent Director\n\nIndependent Director\n\nIndependent Director\n\nIndependent Director\n\nIndependent Director\n\nIndependent Director\n\nIndependent Director\n\nAlexander A. Karsner\n\nIndependent Director\n\nIndependent Director\n\nIndependent Director\n\nIncome Statement table\n\nCash from Operating Activities\n\nFinancing Cash Flow Items\n\nCash from Investing Activities\n\nCash from Operating Activities\n\nFinancing Cash Flow Items\n\nCash from Investing Activities\n\nSource: LSEG, opens new tab - data delayed by at least 15 minutes\n\nOfficial Data Partner\n\nSource: LSEG, opens new tab - data delayed by at least 15 minutes\n\nBusinesscategoryGlobal upstream sector set for deals worth $150 bln over rest of 2024, report says6:31 PM UTC\n\nSustainabilitycategoryNorway's wealth fund falls short on climate ambitions, NGO says1:25 PM UTC\n\nBreakingviewscategoryExxon and gas markets tell different stories11:59 AM UTC\n\nBusinesscategoryTurkey in talks with ExxonMobil over multibillion-dollar LNG deal, FT reportsApril 28, 2024\n\nMarketscategoryWall Street shares close up as megacap tech stocks rallyApril 27, 2024\n\nMarketscategoryHess sets May 28 shareholder vote on Chevron buyoutApril 26, 2024\n\nMarketscategoryEarnings for Big Oil backpedal as natgas prices tumbleApril 26, 2024\n\nMarketscategoryCanada's Imperial Oil gets earnings boost from higher production\n\nCanada's Imperial Oil reported a higher-than-expected quarterly profit on Friday thanks to robust production, although maintenance activities weighed on its refinery throughput volumes.April 26, 2024", "timestamp": "2024-04-29T19:34:47", "title": "XOM.N - | Stock Price & Latest News | Reuters", "url": "https://www.reuters.com/markets/companies/XOM.N"}]}