{"text": "Here is some recent news relating to the stock symbol XLU:\n- Citi Equity Analyst Ryan Levine believes that AI is \"the real emerging story\" that will \"create a demand growth for the industry at large.\"\n- The Biden administration has imposed sweeping regulations on power plants.\n- AI is set to overhaul the utilities market.\n- The near-term outlook for the utility sector is not promising.\n- Duke Energy was the least shorted utility stock in March.", "documents": [{"id": "web-search_0", "snippet": "Skip to Main Content\n\nSkip to Related Content\n\nSign in to view your mail\n\nUtilities Select Sector SPDR Fund (XLU)\n\nNYSEArca - NYSEArca Delayed Price. Currency in USD\n\nVisitors trend2W10W9M\n\nAt close: 04:00PM EDT\n\n(-0.24%) After hours:\n\nTrade prices are not sourced from all markets\n\nYTD Daily Total Return\n\nUtilities: Where AI fits into the future of this sector play\n\nThe utilities sector (XLU) has remained nearly flat year-to-date when compared to the massive gains seen in other sectors in 2024, such as technology. Citi Equity Analyst Ryan Levine believes that the utilities sector's poor performance has gone on for too long, pointing to AI as \"the real emerging story\" that will \"create a demand growth for the industry at large.\" \"There's two groups of companies — companies on the regulated utility side and then on the unregulated side,\" Levine explains to Yahoo Finance. \"On the regulated side, companies as you articulate in terms of close proximity to the data center buildout. So we identify Georgia as a state that's very attractive and are recommending Southern Company (SO) on that theme.\" For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. Editor's note: This article was written by Luke Carberry Mogan.\n\nToday's lowest price! Magnetic phone case!\n\nApril is usually worst month for chip stocks. Will this continue?\n\nMarkets' Volatility Index (^VIX) is surging ahead by over 10% Tuesday morning, the second trading session in April. The month has historically been a period of \"unwinding\" momentum for stocks, according to BTIG Managing Director and Chief Market Technician Jonathan Krinsky. Krinsky joins Yahoo Finance Live to discuss whether the month — which is also the beginning of 2024's second quarter — could put a pause on year-to-date gains across markets and industries like the semiconductor landscape: \"It's actually the worst month of the year on average for long-short momentum strategies. We're seeing areas like semis, which have had an amazing run starting to pull back. And then you're seeing areas like utilities which have lagged over the last few months start to actually perform well. There's different parts of the market doing different things. But, ultimately when you get that kind of momentum, that correlation break, that's when you see the rising Vix like we're seeing today.\" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan.\n\nData DisclaimerHelpSuggestions\n\nTermsandPrivacy Policy\n\nAbout Our AdsSitemap\n\n© 2024 Yahoo. All rights reserved.", "timestamp": "2024-04-26T00:06:53", "title": "Utilities Select Sector SPDR Fund (XLU) Stock Price, News, Quote & History - Yahoo Finance", "url": "https://finance.yahoo.com/quote/XLU/"}, {"id": "web-search_1", "snippet": "Entering text into the input field will update the search result below\n\nSearch for Symbols, analysts, keywords\n\nXLU Utilities Select Sector SPDR® Fund ETF\n\nETF Price & OverviewFollow\n\n$67.020.83 (+1.25%)11:34 AM 04/29/24\n\nNYSEARCA | $USD | Realtime\n\nExpand For Key Data »\n\nBiden administration imposes sweeping regulations on power plants\n\nBig Tech earnings power S&P to best week since October 2023; focus turns to Fed meet\n\nYoY core PCE supports the status quo Fed Funds rate until later in the year - WF\n\nAll S&P Utility stocks are above 50-day MA, less than 10% of Info Tech names are\n\nWall Street's April pullback intensifies as S&P 500 notches worst week in over a year\n\nAI is set to overhaul the utilities market - CFA Institute\n\nXLU: The Near-Term Outlook For The Utility Sector Is Not Promising (Rating Downgrade)\n\nS&P 500 notches worst weekly performance since October on sticky inflation woes\n\nDuke Energy least shorted utility stock in March\n\nSeeking Alpha's top Quant picks in Energy and Utilities as Q1 earnings approaches\n\nMore News And Analysis »\n\nXLU Dividend Growth History\n\nMore On Dividend Growth »\n\nYou may be interested in:\n\nUtilities Select Sector SPDR® Fund ETF (XLU) Frequently Asked Questions\n\nTo ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser.\n\nIs this happening to you frequently? Please report it on our feedback forum.\n\nIf you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh.", "timestamp": "2024-04-29T15:37:35", "title": "Utilities Select Sector SPDR® Fund ETF (XLU) Stock Price, Quote, News & Analysis", "url": "https://seekingalpha.com/symbol/XLU"}]}