{"text": "Here is some recent news relating to the stock symbol XLF:\n- The S&P 500 slumped more than 4% in April, ending a five-month winning streak due to inflation concerns.\n- 15 out of 23 financial stocks delivered EPS wins, with stable consumer demand.\n- BofA saw clients retract $2 billion last week as the S&P dropped.\n- CleanSpark topped the week's financial gainers, while Coinbase fell the most.\n- Wall Street's April pullback intensified as the S&P 500 had its worst week in over a year.\n- 15 out of 20 S&P 500 financial stocks delivered EPS wins, and a rebound in investment banking aided major U.S. banks.", "documents": [{"id": "web-search_1", "snippet": "Entering text into the input field will update the search result below\n\nSearch for Symbols, analysts, keywords\n\nXLF Financial Select Sector SPDR® Fund ETF\n\nETF Price & OverviewFollow\n\n$40.750.38 (+0.95%)3:08 PM 05/01/24\n\nNYSEARCA | $USD | Realtime\n\nExpand For Key Data »\n\nS&P 500 slumps more than 4% in April, snaps five-month win streak on inflation woes\n\nRiot Platforms jumps, Kinsale Capital drops: weekly financials roundup\n\nBig Tech earnings power S&P to best week since October 2023; focus turns to Fed meet\n\n15 out of 23 financial stocks deliver EPS wins, amid stable consumer demand - Earnings Scorecard\n\nAll S&P Utility stocks are above 50-day MA, less than 10% of Info Tech names are\n\nBofA watched clients retract $2B last week as the S&P dropped\n\nCleanSpark tops week's financial gainers, while Coinbase falls the most\n\nWall Street's April pullback intensifies as S&P 500 notches worst week in over a year\n\n15 out of 20 S&P 500 financial stocks deliver EPS wins, rebound in investment banking aids major U.S. banks - Earnings Scorecard\n\n14 companies with a near-term catalyst around 1Q earnings - MS\n\nMore News And Analysis »\n\nXLF Dividend Growth History\n\nMore On Dividend Growth »\n\nYou may be interested in:\n\nFinancial Select Sector SPDR® Fund ETF (XLF) Frequently Asked Questions\n\nTo ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser.\n\nIs this happening to you frequently? Please report it on our feedback forum.\n\nIf you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh.", "timestamp": "2024-05-01T19:08:29", "title": "Financial Select Sector SPDR® Fund ETF (XLF) Stock Price, Quote, News & Analysis", "url": "https://seekingalpha.com/symbol/XLF"}]}