{"text": "In the past week, there have been a few events that may influence a buy/sell decision for XLRE:\n\n- Real estate stocks finished in the green as analysts turned positive and earnings surprised to the upside.\n- Wall Street's April pullback intensified as the S&P 500 notched its worst week in over a year.\n- Rents hold the key in core inflation cooling and the Fed's rate moves, according to BNP Paribas.\n- Stocks tumbled on Thursday after the latest U.S. economic data showed a sharp slowdown in growth and pointed to persistent inflation.\n- The Dow Jones Industrial Average slid 375.12 points, or 0.98%, to close at 38,085.80, weighed down by steep declines in Caterpillar and IBM. The S&P 500 and Nasdaq Composite also lost 0.46% and 0.64%, respectively.\n- The GDP report showed the personal consumption expenditures price index increased at a 3.4% pace, raising concerns about persistent inflation and questioning the Federal Reserve's ability to cut rates anytime soon.", "documents": [{"id": "web-search_3", "snippet": "Entering text into the input field will update the search result below\n\nSearch for Symbols, analysts, keywords\n\nXLRE The Real Estate Select Sector SPDR Fund ETF\n\nETF Price & OverviewFollow\n\n$36.45-0.42 (-1.14%)1:26 PM 04/30/24\n\nNYSEARCA | $USD | Realtime\n\nExpand For Key Data »\n\nReal estate stocks finish in green as analysts turn positive, earnings surprise to upside\n\nBig Tech earnings power S&P to best week since October 2023; focus turns to Fed meet\n\nAll S&P Utility stocks are above 50-day MA, less than 10% of Info Tech names are\n\nU.S. equities see the largest net buying since late February - GS\n\nReal estate stocks continue on downward trajectory as market's April pullback intensifies\n\nWall Street's April pullback intensifies as S&P 500 notches worst week in over a year\n\nRents hold the key in core inflation cooling and the Fed's rates moves - BNP Paribas\n\n8 REITs increase dividend payouts in March, says report\n\nCapital offering activities by equity REITs rise by 14% M/M in March\n\nShort interest on S&P 500 real estate stocks advance in March\n\nMore News And Analysis »\n\nXLRE Dividend Growth History\n\nMore On Dividend Growth »\n\nYou may be interested in:\n\nThe Real Estate Select Sector SPDR Fund ETF (XLRE) Frequently Asked Questions\n\nTo ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser.\n\nIs this happening to you frequently? Please report it on our feedback forum.\n\nIf you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh.", "timestamp": "2024-04-30T17:33:24", "title": "The Real Estate Select Sector SPDR Fund ETF (XLRE) Stock Price, Quote, News & Analysis", "url": "https://seekingalpha.com/symbol/XLRE"}, {"id": "web-search_5", "snippet": "Futures & Commodities\n\nEquity and Opportunity\n\nHelp for Low Credit Scores\n\nFind the Credit Card for You\n\nBest Rewards Credit Cards\n\nBest Travel Credit Cards\n\nBest 0% APR Credit Cards\n\nBest Balance Transfer Credit Cards\n\nBest Cash Back Credit Cards\n\nBest Credit Card Welcome Bonuses\n\nBest Credit Cards to Build Credit\n\nFind the Best Personal Loan for You\n\nBest Debt Consolidation Loans\n\nBest Loans to Refinance Credit Card Debt\n\nBest Loans with Fast Funding\n\nBest Small Personal Loans\n\nBest Large Personal Loans\n\nBest Personal Loans to Apply Online\n\nBest Student Loan Refinance\n\nFind the Savings Account for You\n\nBest High Yield Savings Accounts\n\nBest Big Bank Savings Accounts\n\nBest Big Bank Checking Accounts\n\nBest No Fee Checking Accounts\n\nNo Overdraft Fee Checking Accounts\n\nBest Checking Account Bonuses\n\nBest Money Market Accounts\n\nBest Mortgages for Small Down Payment\n\nBest Mortgages for No Down Payment\n\nBest Mortgages with No Origination Fee\n\nBest Mortgages for Average Credit Score\n\nAdjustable Rate Mortgages\n\nAffording a Mortgage\n\nBest Homeowners Insurance\n\nBest Renters Insurance\n\nAll Credit Monitoring\n\nBest Credit Monitoring Services\n\nBest Identity Theft Protection\n\nHow to Boost Your Credit Score\n\nCredit Repair Services\n\nAll Personal Finance\n\nBest Expense Tracker Apps\n\nBest Money Transfer Apps\n\nBest Resale Apps and Sites\n\nBuy Now Pay Later (BNPL) Apps\n\nBest Small Business Savings Accounts\n\nBest Small Business Checking Accounts\n\nBest Credit Cards for Small Business\n\nBest Small Business Loans\n\nBest Tax Software for Small Business\n\nBest Tax Software for Small Businesses\n\nAll Help for Low Credit Scores\n\nBest Credit Cards for Bad Credit\n\nBest Personal Loans for Bad Credit\n\nBest Debt Consolidation Loans for Bad Credit\n\nPersonal Loans if You Don't Have Credit\n\nBest Credit Cards for Building Credit\n\nPersonal Loans for 580 Credit Score or Lower\n\nPersonal Loans for 670 Credit Score or Lower\n\nBest Mortgages for Bad Credit\n\nHow to Boost Your Credit Score\n\nBest Roth IRA Accounts\n\nBest Free Stock Trading Platforms\n\nSearch quotes, news & videos\n\nDow closes lower by more than 370 points as inflation, growth worries resurface: Live updates\n\nPublished Thu, Apr 25 202410:40 AM EDTUpdated Moments Ago\n\nBrian Evans@BrianSyndicatesWATCH LIVE\n\nTraders work during the opening bell at the New York Stock Exchange.\n\nJohannes Eisele | AFP | Getty Images\n\nStocks tumbled Thursday after the latest U.S. economic data showed a sharp slowdown in growth and pointed to persistent inflation.\n\nThe Dow Jones Industrial Average slid 375.12 points, or 0.98%, to close at 38,085.80, weighed down by steep declines in Caterpillar and IBM. The S&P 500 dropped 0.46% to finish the session at 5,048.42, and the Nasdaq Composite lost 0.64% to 15,611.76.\n\nU.S. gross domestic product expanded 1.6% in the first quarter, the Bureau of Economic Analysis said. Economists polled by Dow Jones forecast GDP growth would come in at 2.4%.\n\nAlong with the downbeat growth rate for the quarter, the report showed the personal consumption expenditures price index increased at a 3.4% pace, well above the previous quarter's 1.8% advance. This raised concern over persistent inflation and put into question whether the Federal Reserve will be able to cut rates anytime soon. Taken together, both findings suggest a stagflationary environment — that is, a combination of slowing economic growth and rising inflation — and could add another headwind for policymakers moving forward.\n\n\"In the short term, the numbers don't appear to be a green light for either bulls or bears...the uncertainty is unlikely to ease pressures in a market experiencing its deepest pullback since last year,\" said Chris Larkin, managing director of trading and investing at E*Trade from Morgan Stanley.\n\nFollowing the GDP print, traders moved down expectations for an easing of Federal Reserve monetary policy. Fed funds futures trading data suggests there will be just one interest rate cut this year, according to the CME FedWatch Tool.\n\nThe lackluster GDP added further pressure to an already-tense market contending with concerns over a pullback in growth among technology earnings.\n\nMeta plunged 10.5% after the social media giant issued light revenue guidance for the second quarter. International Business Machines also fell 8.3% after missing consensus estimates for first-quarter revenue.\n\n\"For all of the attention given to generative AI in the past nine months, the failure of Meta to attain its revenue growth projections in Q1 is raising questions about whether the monetization of this technology is as easy as what traders were led to believe by management,\" said Thierry Wizman, global FX and rates strategist at Macquarie.\n\nMeta's report raises concern ahead of other big tech releases. Microsoft and Alphabet are slated to post earnings after the close Thursday.\n\nCorrection: An earlier version misstated the day's move for the Nasdaq Composite.\n\n4:11 p.m.: Stocks close lower, Dow slides more than 300 points\n\nStocks closed lower on Thursday, with gross domestic product data fueling growth concerns and pressuring equities.\n\nThe Dow Jones Industrial Average pulled back 375.12 points, or 0.98%, to close at 38,085.80. The S&P 500 slipped 0.46% to finish the session at 5,048.42, while the Nasdaq Composite lost 0.64% to 15,611.76.\n\n3:30 p.m.: Investor bullishness below historical average for first time since early November\n\nIndividual investor bullishness toward the outlook for stock prices slid to 32.1% in the latest week, the lowest since early November, which was also the last time enthusiasm was below the historical average of 37.5%. That marked the end of 25 straight weeks when bullishness was above normal.\n\nThe weekly survey from the American Association of Individual Investors showed neutral sentiment regarding the next six months surged to 33.9% from 27.8%. The historical average is 31.5%.\n\nBearish opinion was little changed at 33.9% vs. 34.0% last week (and an historical average of 31% for a second week).\n\n3:01 p.m.: Federal Reserve is 'boxed in a corner' after GDP report, strategist says\n\nThe softer-than-expected GDP report puts the Fed in a bind with inflation readings heating up, said Mike Cornacchioli, Citizens Private Wealth senior VP for investment strategy.\n\n\"The GDP report was two-pronged: bad and ugly,\" Cornacchioli said.\n\nAnd while the GDP pricing data is just one way to look at inflation, the upward trendline is now becoming clear, Cornacchioli said.\n\n\"I think we've moved past seeing this uptick in inflation being transitory. It's now a real concern, and continuing data is reinforcing that, which is what the PCE price data shows us. The Fed is kind of boxed in a corner here,\" he added.\n\n2:34 p.m.: Stagflation fears are overblown, says BMO's Yung-Yu Ma\n\nAlthough GDP in the January-through-March period grew less than expected — while the inflation posted its biggest gain in a year — the economy is at little risk of falling into stagflation, according to BMO Wealth Management chief investment officer Yung-Yu Ma.\n\n\"We actually think growth is going to hold up pretty well,\" Ma said. Much of the detractors of GDP growth were volatile one-time items, such as inventories, Ma noted, as well as underscoring strength in consumer and business spending.\n\n\"We see a pretty healthy and stable growth environment; we aren't especially concerned about growth pulling back much throughout this year. We actually think there's a good prospect for acceleration as we go throughout the year,\" said Ma.\n\nMa forecasts prices for most services and goods to moderate in the remainder of 2024. \"This GDP report might might actually mark a high point of worry for both inflation concerns and growth this year. We think both are going to turn the corner positive direction,\" Ma said. \"It might take a little bit of time, but we we don't we don't see these trends persisting throughout this year.\"\n\nWith a forecast for a healthy growth environment, albeit a relatively neutral environment for inflation with regards to the Federal Reserve, Ma believes there is still a favorable backdrop for equities in 2024. \"It's not as favorable — but it's still a backdrop that we wouldn't recommend investors take an overly conservative or cautious stance in the face of this outlook,\" Ma said.\n\n1:30 p.m.: Tech investor stands by Meta Platforms, but says stock needs to 'find support'\n\nTechnology investor Paul Meeks is standing by Meta Platforms despite Thursday's sell-off, but said it's too soon to snatch up shares just yet.\n\nThe stock needs to \"find support for at least a few trading session, so I'm more confident that the short-term selling has been exhausted,\" said the co-chief investment officer and portfolio manager at Harvest Portfolio Management.\n\nMeeks considers himself a long-term owner of the stock, but said he's waiting for more earnings reports to trickle in. This includes results from his favorite AI names Nvidia and Advanced Micro Devices.\n\n1:15 p.m.: Meta's AI spending could benefit these stocks\n\nMeta Platforms is down nearly 12% in midday training as investors react to the news that it will take a while to see the full benefits of the company's rising investments in artificial intelligence. But one company's loss could be another's gain. As Meta's spending could turn into bigger revenue at Super Micro, Arista Networks, Pure Storage, Broadcom and AMD, according to Wells Fargo.\n\nAnalyst Aaron Rakers estimates Meta was an approximately 10% customer for Super Micro in the fourth quarter of 2023, and for Pure Storage last year.\n\nArista Networks, which makes ethernet-based AI cables and other products, received about 21% of last year's revenue from Meta, he said.\n\nRakers also said Meta has been using Broadcom's custom networking chips and was one of the first customers for its new AI chip, the MI300X.\n\nChip stocks were trading higher on Thursday, against the broader market's steep decline.\n\n—Kristina Partsinevelos, Christina Cheddar Berk\n\n12:41 p.m.: Check out the stocks making headlines in midday trading:\n\nVictoria's Secret — Shares dropped 3.5% after Goldman Sachs initiated coverage of the stock with a sell rating, saying it sees a \"tough macro and ongoing competitive pressure\" for the lingerie company in the near term. Longer term, the firm is constructive on the company's loyalty initiatives and renewed merchandise focus.\n\nMeta Platforms — The Facebook-parent company plunged more than 11%. Meta reported lighter-than-expected second-quarter revenue guidance on Wednesday, and CEO Mark Zuckerberg spoke about spending in areas such as AI and mixed reality that are not currently profitable.\n\nTech stocks — Shares of major tech giants dropped on Thursday as Meta's lackluster revenue outlook led to declines across the sector. Microsoft and Alphabet shares dropped roughly 3% and 2%, respectively, ahead of their earnings due after the bell. Amazon's stock price shed 2%.\n\nMonster Beverage — JPMorgan downgraded Monster Beverage to neutral from overweight due to \"cost pressure,\" pushing shares roughly 3% lower.\n\nFor the full list, read here.\n\n12:40 p.m.: Developed markets are showing signs of pressure from escalating geopolitical tensions, falling expectations of rate cuts and a recent equity sell off.\n\nAll of the major EPFR-tracked Developed Markets Equity Fund groups, with the exception of Canada Equity Funds, experienced net redemptions during the week ending April 17, according to EPFR.\n\nDuring the period, U.S. equity funds saw their third outflow in five weeks.\n\n12 p.m.: Thursday sell-off pulls Dow into negative territory on the week\n\nThursday's drop yanked the Dow below its flatline for the week, underscoring the magnitude of the daily loss.\n\nThe blue-chip average tumbled more than 1.5% in late morning trading. It was now down about 0.4% on the week, despite pacing for a gain of more than 1% heading into the session.\n\nWith that decline, the Dow sat within 0.5% of its flatline for 2024.\n\nWhile the S&P 500 and Nasdaq Composite also fell in Thursday's session, both remained on track to end the week higher. The broad S&P 500 was poised to finish up by 0.8%, while the technology-heavy Nasdaq was heading toward a 1% gain.\n\n11: 24 a.m.: Chipmaker ETFs are a rare bright spot for investors Thursday\n\nSemiconductor ETFs are performing well on Thursday even as the broader market struggles.\n\nThe VanEck Semiconductor ETF (SMH) was up about 0.7% on the session, while the Invesco PHLX Semiconductor ETF (SOXQ) was up about 0.9%.\n\nThe iShares Semiconductor ETF (SOXX) added about 0.5%.Nvidia was helping to lead the group higher, rising more than 2%. The chip giant had a 10% sell-off of its own last week, but is starting to claw back those losses.\n\n10:46 a.m.: IBM and Caterpillar lead Dow lower\n\nThe Dow has dived almost 700 points in early Thursday trading, putting the blue-chip average on track for its worst day this year.\n\nIBM and Caterpillar led the 30-stock index into the red, dropping more than 9% and 7%, respectively, on the back of earnings. Both missed analyst estimates for revenue in the quarter.\n\nBig technology names Microsoft and Amazon were the next worst performers, shedding nearly 4% and 3%, respectively.\n\nMore than two out of every three Dow stocks traded down in the session. Merck, which reported better-than-anticipated earnings this morning, and UnitedHealth bucked the downtrend, with each up more than 1% in the session\n\n10:22 a.m.: Meta shares on pace for worst day since October 2022\n\nMeta Platforms shares plummeted 11.34% on Thursday. The losses put the stock on pace for its worst day since October 27, 2022, when Meta declined 24.56%.\n\nShares fell after Meta issued weak revenue guidance that overshadowed its better-than-expected earnings in the first quarter. The sell-off intensified following CEO Mark Zuckerberg's comments on the company's long-term investments in artificial intelligence and the metaverse.\n\nMeta shares on Thursday\n\n10:04 a.m.: New York Stock Exchange decliners lead advancers 10-1\n\nAbout 10 stocks traded lower at the New York Stock Exchange on Thursday for every one advancer, as the latest GDP report and new tech earnings dampened investor sentiment. Overall, 2,386 NYSE-listed stocks fell, while 210 advanced.\n\n9:52 a.m.: The U.S. GDP report was the 'worst of both worlds,' investor says\n\nA disappointing U.S. GDP print could spell trouble ahead for the equity market if inflation continues to prove sticky, one investor said.\n\n\"This report was the worst of both worlds: economic growth is slowing and inflationary pressures are persisting,\" wrote Chris Zaccarelli, investment chief at Independent Advisor Alliance.\n\n\"The Fed wants to see inflation start coming down in a persistent manner, but the market wants to see economic growth and corporate profits increasing, so if neither are headed in the right direction then that's going to be bad news for markets,\" he continued.\n\nThe data also raises the stakes for the personal consumption expenditures report that is set to release Friday. Investors are hoping the PCE report, which is the Fed's preferred measure of inflation, will show an improvement in pricing pressures after the March consumer inflation report came in hotter than expected.\n\n9:33 a.m.: Stocks fall after GDP data shows slowing economic growth\n\nStocks opened lower on Thursday, with equities selling off after fresh gross domestic product data signaled signs of slowing economic growth.\n\nThe Dow Jones Industrial Average pulled back 500 points, or 1.3%. The S&P 500 pulled back 1.4%, while the Nasdaq Composite lost 2.3%.\n\n8:58 a.m.: 10-year Treasury yield jumps to highest level since November\n\nThe 10-year Treasury yield broke above 4.7% following the GDP report, hitting its highest level since November.\n\nThe benchmark Treasury rate topped 4.7% on Thursday.\n\nWhile slowing economic growth could be a factor that pushes the Federal Reserve toward rate cuts, the rising prices shown in the GDP report could cause the central bank to hold rates steady until inflation recedes.\n\n8:51 a.m.: Gross domestic product slowed in the first quarter\n\nU.S. gross domestic product slowed in the first quarter, the Bureau of Economic Analysis said Thursday, which weigh on stock futures before the opening bell.\n\nGDP expanded 1.6% in the first quarter, while economists polled by Dow Jones forecast growth of 2.4%.", "timestamp": "2024-04-29T21:52:58", "title": "Dow closes lower by more than 370 points as inflation, growth worries resurface: Live updates", "url": "https://www.cnbc.com/2024/04/25/dow-drops-more-than-600-points-on-inflation-and-growth-concerns-live-updates.html"}]}