{"text": "Linde plc (LIN) has been downgraded at Citigroup and UBS due to slower profit growth and valuation. The average price target from 30 ratings is $474.57.", "documents": [{"id": "web-search_1", "snippet": "Entering text into the input field will update the search result below\n\nSearch for Symbols, analysts, keywords\n\nStock Price & OverviewFollow\n\n$450.323.52 (+0.79%)9:41 AM 04/18/24\n\nNASDAQ | $USD | Realtime\n\nExpand For Key Data »\n\nBASF, Linde launch world's first large-scale electrically heated steam cracker\n\nAlbemarle remains the most heavily shorted materials stock in March\n\nSteel Dynamics, Dow among top materials picks ahead of Q1 earnings; Albemarle gets a Sell\n\nGlobal Stock leaders for 2030 in Greentech - UBS\n\nLinde downgraded at Citigroup on valuation\n\nIFF upgraded at Citigroup on rising profit margin\n\nStock losers of Republican policy if Trump wins - GS\n\nNewmont, Martin Marietta Materials among top materials movers in Q1 as sector gains momentum\n\nLinde downgraded at UBS on slower profit growth, valuation\n\nAlbemarle, FMC, Celanese most shorted S&P 500 materials stocks in February\n\nMore News And Analysis »\n\nLinde plc operates as an industrial gas company in the Americas, Europe, the Middle East, Africa, Asia, and South Pacific. It offers atmospheric gases, including oxygen, nitrogen, argon, and rare gases; and process gases, such as carbon dioxide, helium, hydrogen, electronic gases, specialty gases, and acetylene. The company also designs and constructs turnkey process plants for third-party customers, as well as for the gas businesses in various locations, such as air separation, hydrogen, synthesis, olefin, and natural gas plants. It serves a range of industries, including healthcare, chemicals and energy, manufacturing, metals and mining, food and beverage, and electronics. The company was founded in 1879 and is based in Woking, the United Kingdom.Hide\n\nForge, 43 Church Street West\n\nLIN Earnings Per Share\n\nLIN Dividend Growth History\n\nMore On Dividend Growth »\n\nInvestor Presentations\n\nSee All SEC Filings »\n\nSee All Press Releases »\n\nLIN Income Statement\n\nLIN Cash Flow Statement\n\nLIN Long Term Solvency\n\nYou may be interested in:\n\nLinde plc (LIN) Frequently Asked Questions\n\nTo ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser.\n\nIs this happening to you frequently? Please report it on our feedback forum.\n\nIf you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh.", "timestamp": "2024-04-28T17:57:29", "title": "Linde plc (LIN) Stock Price, Quote, News & Analysis", "url": "https://seekingalpha.com/symbol/LIN"}, {"id": "web-search_3", "snippet": "Search News & Quotes\n\nTopicsStock PicksLists & RankingsMagazineDataAdvisorPenta\n\nAverage price target from 30 ratings: $474.57\n\nDay Range439.46 - 445.69\n\n52 Wk Range350.60 - 477.71\n\n1.58M (65.96% of Avg)\n\nShort Interest Change\n\nDow Jones Industrial AverageS&P 500NasdaqS&P 400 Mid CapRussell 2000Remove Comparison\n\nAir Products & Chemicals Inc.\n\nDuPont de Nemours Inc.\n\nEastman Chemical Co.\n\nHangzhou Oxygen Plant Group Co. Ltd. A\n\nEIDP Inc. $3.50 Cum. Pfd.\n\nEIDP Inc. $4.50 Cum. Pfd.\n\nOverviewCompany & PeopleFinancialsResearch & RatingsStockGraderAdvanced Chart\n\nNotes & Data Providers\n\nStocks: Real-time U.S. stock quotes reflect trades reported through Nasdaq only; comprehensive quotes and volume reflect trading in all markets and are delayed at least 15 minutes. International stock quotes are delayed as per exchange requirements. Fundamental company data and analyst estimates provided by FactSet. Copyright 2019© FactSet Research Systems Inc. All rights reserved. Source: FactSet\n\nIndexes: Index quotes may be real-time or delayed as per exchange requirements; refer to time stamps for information on any delays. Source: FactSet\n\nMarkets Diary: Data on U.S. Overview page represent trading in all U.S. markets and updates until 8 p.m. See Closing Diaries table for 4 p.m. closing data. Sources: FactSet, Dow Jones\n\nStock Movers: Gainers, decliners and most actives market activity tables are a combination of NYSE, Nasdaq, NYSE American and NYSE Arca listings. Sources: FactSet, Dow Jones\n\nETF Movers: Includes ETFs & ETNs with volume of at least 50,000. Sources: FactSet, Dow Jones\n\nBonds: Bond quotes are updated in real-time. Sources: FactSet, Tullett Prebon\n\nCurrencies: Currency quotes are updated in real-time. Sources: FactSet, Tullett Prebon\n\nCommodities & Futures: Futures prices are delayed at least 10 minutes as per exchange requirements. Change value during the period between open outcry settle and the commencement of the next day's trading is calculated as the difference between the last trade and the prior day's settle. Change value during other periods is calculated as the difference between the last trade and the most recent settle. Source: FactSet\n\nData are provided 'as is' for informational purposes only and are not intended for trading purposes. FactSet (a) does not make any express or implied warranties of any kind regarding the data, including, without limitation, any warranty of merchantability or fitness for a particular purpose or use; and (b) shall not be liable for any errors, incompleteness, interruption or delay, action taken in reliance on any data, or for any damages resulting therefrom. Data may be intentionally delayed pursuant to supplier requirements.\n\nMutual Funds & ETFs: All of the mutual fund and ETF information contained in this display, with the exception of the current price and price history, was supplied by Lipper, A Refinitiv Company, subject to the following: Copyright 2019© Refinitiv. All rights reserved. Any copying, republication or redistribution of Lipper content, including by caching, framing or similar means, is expressly prohibited without the prior written consent of Lipper. Lipper shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon.\n\nCryptocurrencies: Cryptocurrency quotes are updated in real-time. Sources: CoinDesk (Bitcoin), Kraken (all other cryptocurrencies)\n\nCalendars and Economy: 'Actual' numbers are added to the table after economic reports are released. Source: Kantar Media\n\nBarron's Stock Screen\n\nSubscribe to Barron's\n\nThe Wall Street Journal\n\nInvestor's Business Daily\n\nFinancial News London\n\nCorporate Subscriptions\n\nInvesting in Education\n\nPress & Media Inquiries\n\nManage Notifications\n\nTerms of Use Updated\n\nCopyright © 2024 Dow Jones & Company, Inc. All Rights Reserved.", "timestamp": "2024-04-28T12:02:40", "title": "LIN | Linde PLC Stock Overview (U.S.: Nasdaq) | Barron's", "url": "https://www.barrons.com/market-data/stocks/lin"}]}