{"text": "I was unable to find any recent news relating to XLV stock within the past week. However, I did find some older news stories that may still be relevant to your buy/sell decision:\n\n- XLV seeks to replicate the total return of the Consumer Services Select Sector of the S&P 500 Index.\n- XLV's investment objective is to provide investment results that correspond generally to the price and yield performance of the S&P Health Care Select Sector Index.\n- XLV had a strong 2022, but healthcare stocks are stumbling out of the gate in 2023.\n- The Biden administration has issued a new ruling against junk health insurance.", "documents": [{"id": "web-search_5", "snippet": "Accessibility Log In Help Join The Motley Fool\n\nSelect Sector SPDR Trust - The Health Care Select Sector SPDR Fund (NYSEMKT: XLV)\n\nPrice as of April 23, 2024, 3:36 p.m. ET\n\nSelect Sector SPDR Trust - The Health Care Select Sector SPDR Fund Return vs. S&P\n\nSelect Sector SPDR Trust - The Health Care Select Sector SPDR Fund Company Info\n\nSeeks to replicate the total return of the Consumer Services Select Sector of the S&P 500 Index. It unbundles the benchmark S&P 500 and gives the investor ownership in particular sectors of industries represented by a specified Select Sector Index.\n\nInvesting in Sector ETFs\n\nA Diversified Strategy\n\nAnders Bylund | Mar 2, 2023\n\nThis Low-Risk ETF Can Turn $39,000 Into $1 Million in 25 Years\n\nFunneling money into this fund can drastically simplify your investing strategy.\n\nDavid Jagielski | Feb 2, 2023\n\nHere's Why Healthcare Stocks Are Falling This Week\n\nTodd Campbell | Sep 22, 2020\n\nJustice Ruth Bader Ginsburg's death jeopardizes Obamacare's future, and that puts healthcare companies' revenue at risk.\n\n3 Sector Funds That Look Likely to Bounce Back in 2020\n\nDan Caplinger | Jan 11, 2020\n\nThese industries lagged the market last year, but the headwinds that held them back may be dissipating.\n\n5 Top Healthcare ETFs\n\nKeith Speights | Oct 26, 2019\n\nThese exchange-traded funds offer investors an easy way to potentially profit from growth in the healthcare sector.\n\nThe 3 Best Sector SPDR ETFs of 2018\n\nDan Caplinger | Jan 5, 2019\n\nFind out which industries performed the best last year.\n\nHow to Invest in Pharmaceutical Stocks: A Beginner's Guide\n\nMotley Fool Staff | Jul 3, 2018\n\nHere's all you need to start investing in pharmaceutical stocks today.\n\nHow to Invest in Healthcare Stocks the Easy Way\n\nDan Caplinger | Mar 24, 2018\n\nHere are several smart ways to invest in the companies that keep people healthy. View More XLV Articles\n\nJefferies Financial Group\n\nBrookfield Corporation\n\nInteractive Brokers Group\n\nPremium Investing Services\n\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n\nView Premium Services", "timestamp": "2024-04-23T19:52:49", "title": "Select Sector SPDR Trust - The Health Care Select Sector SPDR Fund (XLV) Stock Price, News & Info | The Motley Fool", "url": "https://www.fool.com/quote/nysemkt/xlv/"}, {"id": "web-search_1", "snippet": "SPDR Select Sector Fund - Health Care (XLV): Price and Financial Metrics ETF\n\n$139.96 0.04 (0.03%) Quote Time: Apr 26 6:30pm\n\nSPDR Select Sector Fund - Health Care (XLV): $139.96\n\nAdd XLV to Watchlist Sign Up\n\nCategory: Health & Biotech ETFs\n\n#1 of 42 in category\n\nSee All 'A' Rated Buy ETFs\n\nXLV Price/Volume Stats - 7 Best ETFs for the NEXT Bull Market\n\nXLV Stock Price Chart Interactive Chart >\n\nSPDR Select Sector Fund - Health Care (XLV) ETF Bio\n\nThe investment objective of the SPDR Health Care Select Sector Fund ETF is to provide investment results that correspond generally to the price and yield performance of the S&P Health Care Select Sector Index.\n\nMost Popular Stories View All\n\n• When is the Next Bull Run for Stocks?\n\n• 3 Gold Stocks to Buy Poised for Success\n\n• 3 Internet Stocks Poised up for Rapid Growth in April\n\n• TXN vs. INTC Earnings Alert - Which Chip Stock Will Surge Ahead?\n\n• Updated 2024 Stock Market Outlook View All Top stories\n\nJoin thousands of investors who get the latest news, insights and top rated picks from StockNews.com!\n\nState Street Global Advisors\n\nHealth Care Select Sector Index\n\nAssets Under Management (AUM)\n\nNet Asset Value (NAV)\n\nXLV Latest News Stream\n\nLoading, please wait...\n\nUNITEDHEALTH GROUP INC\n\nTHERMO FISHER SCIENTIFIC INC\n\nRead More 'XLV' Stories Here\n\nLoading, please wait... View Full XLV Dividend History", "timestamp": "2024-04-26T22:50:27", "title": "XLV -- Is Its Stock Price A Worthy Investment? Learn More.", "url": "https://stocknews.com/stock/XLV/"}, {"id": "web-search_0", "snippet": "The Wall Street Journal\n\n日本語 (Japanese)\n\nOther Products from WSJ\n\nThe Wall Street Journal\n\nHealth Care Select Sector SPDR ETF XLV (U.S.: NYSE Arca)\n\nAT CLOSE 4:00 PM EST 01/17/23\n\nAFTER HOURS 7:46 PM EST 01/17/23\n\nAFTER HOURS Vol 45,531\n\n65 Day Avg Vol 7,710,300\n\n1 Day Range 134.64 - 135.6121\n\n52 Week Range 118.75 - 143.42 (06/16/22 - 04/08/22)\n\nAdvanced Charting Compare\n\nCompare to Benchmark:\n\nPrior Close 135.45 (01/13/23)\n\nInvestment Information XLV\n\n* Expense ratio updated annually from fund's year-end report.\n\nThe Fund seeks to provide investment results that, before expenses, correspond generally to the price and yield performance of the Health Care Select Sector Index. Under normal market conditions, the fund generally invests substantially all, but at least 95%, of its total assets in the securities comprising the Index.\n\nYTD 1YR 3YR 5YR 10YR\n\n3, 5, and 10 Year Returns are Annualized\n\n12/19/2022 - 01/18/2023\n\nNews Health Care Select Sector SPDR ETFXLV\n\nBarron's Healthcare Stocks, a Star Last Year, Are Stumbling Out of the Gate\n\nBarron's Healthcare Stocks, a Star Last Year, Are Stumbling Out of the Gate\n\nBarron's Healthcare Stocks Had a Strong 2022. It Isn't Too Late to Buy.\n\nBarron's Movin' On: What's Ahead for Every Sector of the S&P 500\n\nMarketWatch.com Democratic incumbent Warnock wins Georgia's Senate runoff election — here's why it matters\n\nMarketWatch.com Why today's Georgia Senate runoff election between Herschel Walker and Raphael Warnock matters\n\nBarron's Stocks Are Clawing Their Way Back. Consider These Moves for 2023.\n\nNAV $135.49 (01/13/23)\n\nShares Outstanding 307.22 M\n\nLatest Dividend $0.556125998 (12/22/22)\n\nAvg Price/Book Ratio 8.15\n\nThe total number of shares of a security that have been sold short and not yet repurchased.\n\nPercentage change in short interest from the previous report to the most recent report. Exchanges report short interest twice a month.\n\nTotal short positions relative to the number of shares available to trade.\n\nShort Interest (12/30/22)\n\nShares Sold Short 18.50 M\n\nChange from Last 18.75%\n\nMoney Flow Uptick/Downtick Ratio\n\nMoney flow measures the relative buying and selling pressure on a stock, based on the value of trades made on an \"uptick\" in price and the value of trades made on a \"downtick\" in price. The up/down ratio is calculated by dividing the value of uptick trades by the value of downtick trades. Net money flow is the value of uptick trades minus the value of downtick trades. Our calculations are based on comprehensive, delayed quotes.\n\nManagement Company State Street Global Advisors\n\nManager Name/Start Year Feehily (2010)\n\nManager Name/Start Year Schneider (2015)\n\nManager Name/Start Year Hancock (2017)\n\nInception Date 12/16/98\n\nPhone Number 866-732-8673\n\n% of Total Portfolio\n\nUnitedHealth Group Inc.\n\nThermo Fisher Scientific Inc.\n\nBristol Myers Squibb Co.\n\nSector Allocations XLV\n\nNon Classified Equity\n\nDistribution History XLV\n\nNotes & Data Providers\n\nStocks: Real-time U.S. stock quotes reflect trades reported through Nasdaq only; comprehensive quotes and volume reflect trading in all markets and are delayed at least 15 minutes. International stock quotes are delayed as per exchange requirements. Fundamental company data and analyst estimates provided by FactSet. Copyright © FactSet Research Systems Inc. All rights reserved. Source: FactSet\n\nIndexes: Index quotes may be real-time or delayed as per exchange requirements; refer to time stamps for information on any delays. Source: FactSet\n\nMarkets Diary: Data on U.S. Overview page represent trading in all U.S. markets and updates until 8 p.m. See Closing Diaries table for 4 p.m. closing data. Sources: FactSet, Dow Jones\n\nStock Movers: Gainers, decliners and most actives market activity tables are a combination of NYSE, Nasdaq, NYSE American and NYSE Arca listings. Sources: FactSet, Dow Jones\n\nETF Movers: Includes ETFs & ETNs with volume of at least 50,000. Sources: FactSet, Dow Jones\n\nBonds: Bond quotes are updated in real-time. Sources: FactSet, Tullett Prebon\n\nCurrencies: Currency quotes are updated in real-time. Sources: FactSet, Tullett Prebon\n\nCommodities & Futures: Futures prices are delayed at least 10 minutes as per exchange requirements. Change value during the period between open outcry settle and the commencement of the next day's trading is calculated as the difference between the last trade and the prior day's settle. Change value during other periods is calculated as the difference between the last trade and the most recent settle. Source: FactSet\n\nData are provided 'as is' for informational purposes only and are not intended for trading purposes. FactSet (a) does not make any express or implied warranties of any kind regarding the data, including, without limitation, any warranty of merchantability or fitness for a particular purpose or use; and (b) shall not be liable for any errors, incompleteness, interruption or delay, action taken in reliance on any data, or for any damages resulting therefrom. Data may be intentionally delayed pursuant to supplier requirements.\n\nMutual Funds & ETFs: All of the mutual fund and ETF information contained in this display, with the exception of the current price and price history, was supplied by Lipper, A Refinitiv Company, subject to the following: Copyright © Refinitiv. All rights reserved. Any copying, republication or redistribution of Lipper content, including by caching, framing or similar means, is expressly prohibited without the prior written consent of Lipper. Lipper shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon.\n\nCryptocurrencies: Cryptocurrency quotes are updated in real-time. Sources: CoinDesk (Bitcoin), Kraken (all other cryptocurrencies)\n\nCalendars and Economy: 'Actual' numbers are added to the table after economic reports are released. Source: Kantar Media", "timestamp": "2024-04-15T12:39:45", "title": "XLV | Health Care Select Sector SPDR ETF Stock Price, Quotes and News - WSJ", "url": "https://www.wsj.com/market-data/quotes/etf/XLV/"}, {"id": "web-search_2", "snippet": "Entering text into the input field will update the search result below\n\nSearch for Symbols, analysts, keywords\n\nJoin the Seeking Alpha community\n\nCreate a free account to gain access to news, analysis, and real-time alerts on the stocks you follow. Create free account\n\nJoin the Seeking Alpha community\n\nCreate a free account to gain access to news, analysis, and real-time alerts on the stocks you follow. Create free account\n\nJoin the Seeking Alpha community\n\nCreate a free account to gain access to news, analysis, and real-time alerts on the stocks you follow. Create free account\n\nXLV Health Care Select Sector SPDR® Fund ETF\n\nETF Price & OverviewFollow\n\n$147.730.02 (+0.01%)4:00 PM 03/28/24\n\nNYSEARCA | $USD | Post-Market: $147.73 8:00 PM\n\nExpand For Key Data »\n\nEli Lilly tops S&P 500 healthcare sector in Q1 as weight loss frenzy continues\n\nS&P 500 delivers best Q1 in five years, driven by rate cut bets and megacap gains\n\nBiden administration issues new ruling against junk health insurance\n\nXLV: Fundamentals Don't Support Overweighting Health Care\n\nS&P 500 soars to best week of 2024 after Fed reignites Wall Street rally\n\nFinancials had the biggest net buying last week since August 2021 - BofA\n\nS&P 500 is broadening out from the Magnificent 7 - Citi\n\nHealth Care Select Sector SPDR ETF declares quarterly distribution of $0.5229\n\nS&P 500 notches two-week losing streak ahead of key Fed rate decision, updated dot plot\n\nBig Six tech stocks’ EPS projections for 2024 are up 26.3% - UBS\n\nMore News And Analysis »\n\nXLV Dividend Growth History\n\nMore On Dividend Growth »\n\nTo ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser.\n\nIs this happening to you frequently? Please report it on our feedback forum.\n\nIf you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh.", "timestamp": "2024-04-30T13:58:07", "title": "Health Care Select Sector SPDR® Fund ETF (XLV) Stock Price, Quote, News & Analysis", "url": "https://seekingalpha.com/symbol/XLV"}]}