{"text": "Within the past week, there has been news of the completion of the conversion of over $123 million of principal and interest under the 4.00% unsecured convertible debenture of Auxly Cannabis Group Inc. (XLY.TO). The company has also amended its amended and restated investor rights agreement dated July 6, 2021.\n\nIn other news, Citi has downgraded the tech sector from Overweight to Market Weight and upgraded the consumer discretionary sector to Overweight. This could be seen as a positive indicator for XLY as the market is said to be 'evolving away from tech and cyclical leadership'.", "documents": [{"id": "web-search_0", "snippet": "Canada markets close in 3 hours 7 minutes\n\nTECH LEADS STOCKS LOWER AMID MIXED EARNINGS, RATE CUT WORRIES\n\nTech was worst performing sector in S&P 500 morning trading; Nvidia down more than 2%\n\nAuxly Cannabis Group Inc. (XLY.TO)\n\nToronto - Toronto Real Time Price. Currency in CAD\n\nAs of 11:54AM EDT. Market open.\n\nMay 13, 2024 - May 17, 2024\n\nForward Dividend & Yield\n\nAUXLY ANNOUNCES COMPLETION OF CONVERSION OF OVER $123 MILLION OF PRINCIPAL AND INTEREST UNDER IMPERIAL DEBENTURE\n\nAuxly Cannabis Group Inc. (TSX: XLY) (OTCQB: CBWTF) (\"Auxly\" or the \"Company\") a leading consumer packaged goods company in the cannabis products market, is pleased to announce the completion of the conversion of $123.4 million of principal and accrued interest under the 4.00% unsecured convertible debenture of the Company due September 25, 2026 (the \"Debenture\") and the amendment to the amended and restated investor rights agreement dated July 6, 2021 (the \"Investor Rights Agreement\") with 1213\n\nThe $50 Billion Market You’ve Never Heard of\n\nStock alert: This company is backed by the biggest names in sports and media. Get the name and symbol right now.\n\nMost actively traded companies on the Toronto Stock Exchange\n\nTORONTO — Some of the most active companies traded Wednesday on the Toronto Stock Exchange: Toronto Stock Exchange (22,107.08, up 194.56 points): Argonaut Gold Inc. (TSX:AR). Mining. Up 10 cents, or 31.67 per cent, to 39.5 cents on 35.0 million shares. TC Energy Corp. (TSX:TRP). Energy. Down $1.11, or 2.02 per cent, to $53.80 on 19.2 million shares. Canopy Growth Corp. (TSX:WEED). Health care. Up $3.18, or 32.55 per cent, to $12.95 on 11.8 million shares. Auxly Cannabis Corp. (TSX:XLY). Health c\n\nData DisclaimerHelpSuggestions\n\nTermsandPrivacy Policy\n\n© 2024 Yahoo. All rights reserved.", "timestamp": "2024-04-17T16:53:19", "title": "Auxly Cannabis Group Inc. (XLY.TO) Stock Price, News, Quote & History - Yahoo Finance", "url": "https://ca.finance.yahoo.com/quote/XLY.TO/"}, {"id": "web-search_3", "snippet": "Exclusive news, data and analytics for financial market professionalsLearn more aboutRefinitiv\n\nSkip to main content\n\ntrading lowerNegativeSPX5,005.57-0.48%Negative\n\ntrading lowerNegativeIXIC15,775.65-0.82%Negative\n\ntrading lowerNegativeDJI38,627.99-0.37%Negative\n\ntrading higherPositiveSTOXX491.59+0.62%Positive\n\ntrading higherPositiveFTSE7,711.71+1.50%Positive\n\ntrading higherPositiveN22538,487.24+0.86%PositiveGet real-time market data from LSEG\n\nAuxly Cannabis Group IncXLY.TO\n\nOfficial Data Partner\n\ntrading higher0.01CAD\n\nAs of Feb 16, 2024. Values delayed up to 15 minutes\n\n3 Month Average Trading Volume\n\n3.00 mean rating - 1 analysts\n\nP/E Excl. Extra Items (TTM)\n\nPrice To Sales (TTM)\n\nPrice To Book (Quarterly)\n\nPrice To Cash Flow (Per Share TTM)\n\nTotal Debt/Total Equity (Quarterly)\n\nLong Term Debt/Equity (Quarterly)\n\nReturn On Investment (TTM)\n\nReturn On Equity (TTM)\n\nAbout Auxly Cannabis Group Inc (XLY.TO)\n\nAuxly Cannabis Group Inc. is a Canada-based consumer packaged goods company in the cannabis products market. The Company is focused on developing, manufacturing and distributing branded cannabis products. The Company's brands include Parcel, Back Forty, Foray, Dosecann and Kolab Project. It provides various products, including vaporizers, edibles, dried flowers, pre-rolls, capsules and oils and concentrates. The Company's subsidiaries include Auxly Charlottetown Inc., Auxly Ottawa Inc., Auxly Annapolis Inc., Auxly Annapolis OG Inc., and Auxly Leamington Inc.\n\n777 Richmond St. W, Unit 002 TORONTO, ON M6J 0C2 Canada\n\nhttps://www.auxly.com/\n\nBiotechnology & Drugs\n\nExecutive Leadership\n\nIndependent Chairman of the Board\n\nChief Executive Officer, Director\n\nBrian William Schmitt\n\nChief Financial Officer\n\nChief People Officer\n\nSenior Vice President - Commercial\n\nGeneral Counsel, Company Secretary\n\nChief Creative Officer\n\nIndependent Director\n\nIndependent Director\n\nMurray Henry Mcgowan\n\nIndependent Director\n\nIndependent Director\n\nIncome Statement table\n\nCash from Operating Activities\n\nFinancing Cash Flow Items\n\nCash from Investing Activities\n\nCash from Operating Activities\n\nFinancing Cash Flow Items\n\nCash from Investing Activities\n\nSource: LSEG, opens new tab - data delayed by at least 15 minutes\n\nOfficial Data Partner\n\nSource: LSEG, opens new tab - data delayed by at least 15 minutes", "timestamp": "2024-02-17T19:34:34", "title": "XLY.TO - | Stock Price & Latest News | Reuters", "url": "https://www.reuters.com/markets/companies/XLY.TO/"}, {"id": "web-search_5", "snippet": "Skip to Main Content\n\nSkip to Related Content\n\nSign in to view your mail\n\nU.S. markets close in 4 hours 12 minutes\n\nAuxly Cannabis Group Inc. (XLY.TO)\n\nToronto - Toronto Real Time Price. Currency in CAD\n\nAs of 11:27AM EST. Market open.\n\nGain actionable insight from technical analysis on financial instruments, to help optimize your trading strategies\n\nNeutralpattern detected\n\nView all chart patterns\n\nForward Dividend & Yield\n\nFair Value is the appropriate price for the shares of a company, based on its earnings and growth rate also interpreted as when P/E Ratio = Growth Rate. Estimated return represents the projected annual return you might expect after purchasing shares in the company and holding them over the default time horizon of 5 years, based on the EPS growth rate that we have projected.\n\nSubscribe to Yahoo Finance Plus to view Fair Value for XLY.TOLearn more\n\nResearch that delivers an independent perspective, consistent methodology and actionable insight\n\nTrulieve CEO is 'cautiously optimistic' on states' upcoming cannabis legislation\n\nTrulieve CEO Kim Rivers sits down with Yahoo Finance Live to discuss the cannabis company's latest earnings report and outlook ahead of cannabis regulation bills.\n\nBearish: Analysts Just Cut Their Auxly Cannabis Group Inc. (TSE:XLY) Revenue and EPS estimates\n\nOne thing we could say about the analysts on Auxly Cannabis Group Inc. ( TSE:XLY ) - they aren't optimistic, having...\n\nThese Analysts Think Auxly Cannabis Group Inc.'s (TSE:XLY) Sales Are Under Threat\n\nToday is shaping up negative for Auxly Cannabis Group Inc. ( TSE:XLY ) shareholders, with the analysts delivering a...\n\n© 2023 Yahoo. All rights reserved.\n\nData DisclaimerHelpSuggestions\n\nTermsandPrivacy Policy\n\nYour Privacy Choices\n\nAbout Our AdsSitemap", "timestamp": "2023-02-09T16:48:12", "title": "Auxly Cannabis Group Inc. (XLY.TO) Latest Stock News & Headlines - Yahoo Finance", "url": "https://finance.yahoo.com/quote/XLY.TO/news/"}, {"id": "web-search_1", "snippet": "Skip to Main Content\n\nSkip to Related Content\n\nSign in to view your mail\n\nU.S. markets close in 5 hours 38 minutes\n\nConsumer Discretionary Select Sector SPDR Fund (XLY)\n\nNYSEArca - Nasdaq Real Time Price. Currency in USD\n\nVisitors trend2W10W9M\n\nAs of 10:22AM EDT. Market open.\n\nTrade prices are not sourced from all markets\n\nYTD Daily Total Return\n\nMarket is 'evolving' towards consumer discretionary: Strategist\n\nIn the first quarter of 2024, many of the AI-led tech companies performed well, with some of the Magnificent Seven experiencing a fall from grace. With some uncertainty moving ahead, and a potential pullback from historic highs, Citi has downgraded the tech sector from Overweight to Market Weight, citing a broadening out of market gains, while upgrading the consumer discretionary sector to Overweight. Citi US Equity Strategist Scott Chronert joins Yahoo Finance to break down the calls for these sectors and take a look into how the market may perform moving forward. Chronert elaborates on his position: \"The market's evolving, the market's evolving away from the tech and cyclical leadership that we've had since early November. We think we're starting to see signs that the market is gradually positioning in favor of those parts of the market that should at the margin benefit from an eventual Fed [Federal Reserve] pivot, consumer [discretionary] is front and center on that. \" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino\n\nAdOnline Shopping Tools\n\nAmazon's Worst Nightmare: Thousands Canceling Prime for...\n\nThis simple trick can save tons of money on Amazon, but most Prime members are ignoring it.\n\nThe S&P 500 is up 5 months straight — and history favors momentum\n\nThe S&P 500 has had a remarkable run over the past five months, chalking up a 25% gain. But contrary to feelings that things have risen too quickly, history says that strength begets strength.\n\nData DisclaimerHelpSuggestions\n\nTermsandPrivacy Policy\n\nAbout Our AdsSitemap\n\n© 2024 Yahoo. All rights reserved.", "timestamp": "2024-04-30T15:07:22", "title": "Consumer Discretionary Select Sector SPDR Fund (XLY) Stock Price, News, Quote & History - Yahoo Finance", "url": "https://finance.yahoo.com/quote/XLY/"}]}