{"text": "Here is a summary of recent news and events that could influence a buy/sell decision for JPM stock:\n- JPMorgan Chase & Co. (JPM) recently announced a dividend of $1.15 per share, payable on April 30, 2024.\n- The company's stock price fell 6.5% after providing guidance that disappointed investors.\n- JPMorgan's CEO, Jamie Dimon, stated that the U.S. economy is booming but warned of the potential negative consequences of fiscal dominance.\n- The company's credit card charge-off rate improved in March.\n- The average price target from 26 ratings is $193.53, with a 52-week range of $123.11 - $185.20.\n- JPMorgan Chase is one of the largest and most complex financial institutions in the United States, with nearly $3.9 trillion in assets.", "documents": [{"id": "web-search_0", "snippet": "Skip to Main Content\n\nSkip to Related Content\n\nSign in to view your mail\n\nU.S. markets close in 1 hour 21 minutes\n\nJPMorgan Chase & Co. (JPM)\n\nNYSE - Nasdaq Real Time Price. Currency in USD\n\nVisitors trend2W10W9M\n\nAs of 02:39PM EDT. Market open.\n\nJPM announced a cash dividend of 1.15 with an ex-date of Apr. 4, 2024\n\nTrade prices are not sourced from all markets\n\nGain actionable insight from technical analysis on financial instruments, to help optimize your trading strategies\n\nNeutralpattern detected\n\nCommodity Channel Index\n\nView all chart patterns\n\nForward Dividend & Yield\n\nFair Value is the appropriate price for the shares of a company, based on its earnings and growth rate also interpreted as when P/E Ratio = Growth Rate. Estimated return represents the projected annual return you might expect after purchasing shares in the company and holding them over the default time horizon of 5 years, based on the EPS growth rate that we have projected.\n\nSubscribe to Yahoo Finance Plus to view Fair Value for JPMLearn more\n\nResearch that delivers an independent perspective, consistent methodology and actionable insight\n\nJP Morgan Chase & Co.\n\nAnalyst Report: JPMorgan Chase & Co.JPMorgan Chase is one of the largest and most complex financial institutions in the United States, with nearly $3.9 trillion in assets. It is organized into four major segments--consumer and community banking, corporate and investment banking, commercial banking, and asset and wealth management. JPMorgan operates, and is subject to regulation, in multiple countries.\n\n7 days agoMorningstar\n\nAnalyst Report: JPMorgan Chase & Co.JPMorgan Chase is one of the largest and most complex financial institutions in the United States, with nearly $3.9 trillion in assets. It is organized into four major segments--consumer and community banking, corporate and investment banking, commercial banking, and asset and wealth management. JPMorgan operates, and is subject to regulation, in multiple countries.\n\n7 days ago•MorningstarView more\n\nJPMorgan Chase & Co's Dividend Analysis\n\nJPMorgan Chase & Co (NYSE:JPM) recently announced a dividend of $1.15 per share, payable on 2024-04-30, with the ex-dividend date set for 2024-04-04. As investors look forward to this upcoming payment, the spotlight also shines on the company's dividend history, yield, and growth rates. Using the data from GuruFocus, let's look into JPMorgan Chase & Co's dividend performance and assess its sustainability.\n\nSubscribe today to get our company alerts\n\nGet the latest breaking news and alerts on the hottest stocks under $15 daily, right at your fingertips. Signup Today! No cost, free VIP newsletter!\n\nThe Wall Street Journal\n\nChase Bank to Let Advertisers Target Customers Based on Spending Data\n\nThe JPMorgan Chase bank’s new unit called Chase Media Solutions will let marketers tempt Chase customers with targeted deals and discounts related to their spending history.\n\nData DisclaimerHelpSuggestions\n\nTermsandPrivacy Policy\n\nAbout Our AdsSitemap\n\n© 2024 Yahoo. All rights reserved.\n\nYahoo Finance updates are here. Better quotes, news, and tools.", "timestamp": "2024-04-22T21:58:45", "title": "JPMorgan Chase & Co. (JPM) Latest Stock News & Headlines - Yahoo Finance", "url": "https://finance.yahoo.com/quote/JPM/news/"}, {"id": "web-search_1", "snippet": "Entering text into the input field will update the search result below\n\nSearch for Symbols, analysts, keywords\n\nJPM JPMorgan Chase & Co.\n\nStock Price & OverviewFollow\n\n$192.75-0.33 (-0.17%)2:53 PM 04/25/24\n\nNYSE | $USD | Realtime\n\nExpand For Key Data »\n\nJPMorgan: Solid Dividend Growth Stock With More Upside Potential\n\nCFTC said to be probing big banks' confidential agreements in swaps, clearing businesses\n\nJPMorgan CEO Jamie Dimon: U.S. economy is booming, but beware of fiscal dominance\n\nRegulators said to revive bid to rein in Wall Street bonus payouts\n\n12 call buying candidates to leverage analyst days - GS\n\nMorgan Stanley, HSBC said to cut Asia investment-banking jobs\n\nTop 10 best-performing bank stocks of 2024 as earnings results roll in\n\nJPMorgan Chase credit card charge-off rate improves in March\n\nGoldman Sachs stock climbs after Q1 earnings impress with core strength\n\nJPMorgan: Why Being Cautious Was Right And Still Is Right\n\nMore News And Analysis »\n\nJPMorgan Chase & Co. operates as a financial services company worldwide. It operates through four segments: Consumer & Community Banking (CCB), Corporate & Investment Bank (CIB), Commercial Banking (CB), and Asset & Wealth Management (AWM). The CCB segment offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The CIB segment provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research. This segment also offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. The CB segment provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. The AWM segment offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.Hide\n\nwww.jpmorganchase.com\n\nJPM Earnings Per Share\n\nJPM Dividend Growth History\n\nMore On Dividend Growth »\n\nInvestor Presentations\n\nSee All SEC Filings »\n\nSee All Press Releases »\n\nJPM Income Statement\n\nJPM Cash Flow Statement\n\nYou may be interested in:\n\nJPMorgan Chase & Co. (JPM) Frequently Asked Questions\n\nTo ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser.\n\nIs this happening to you frequently? Please report it on our feedback forum.\n\nIf you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh.", "timestamp": "2024-04-25T18:57:53", "title": "JPMorgan Chase & Co. (JPM) Stock Price, Quote, News & Analysis", "url": "https://seekingalpha.com/symbol/JPM"}, {"id": "web-search_4", "snippet": "Accessibility Log In Help Join The Motley Fool\n\nJPMorgan Chase (NYSE: JPM)\n\nPrice as of May 1, 2024, 2:47 p.m. ET\n\nJPMorgan Chase Return vs. S&P\n\nJPMorgan Chase Company Info\n\nProvides investment banking, financial services for consumers, small business and commercial banking, financial transaction processing, asset management and private equity\n\nThe Fool has written over 3,600 articles on JPMorgan Chase.\n\nWhat Is a Medallion Stamp Guarantee?\n\nMotley Fool Staff | Apr 30, 2024\n\nWhat Is a Buy-Side Analyst?\n\nMatt Frankel | Apr 30, 2024\n\n3 Things Billionaire CEO Jamie Dimon Wants You to Know\n\nJeremy Bowman | Apr 21, 2024\n\nThe JPMorgan Chase CEO dropped some pearls of wisdom in his latest shareholder letter.\n\nBull Market Buys: 3 Dow Stocks to Own for the Long Run\n\nJames Brumley | Apr 21, 2024\n\nIf you don't know where to begin your search for long-term blue chip holdings, the 30 stocks that make up the Dow Jones Industrial Average are a great starting point.\n\nThese 2 Financial Stocks Just Raised Their Dividends\n\nEric Volkman | Apr 17, 2024\n\nThe pair both declared substantial improvements to their shareholder payouts.\n\nWhy Is JPMorgan Chase Down Following Earnings? Here Are 4 Things Investors Need to Know.\n\nCourtney Carlsen | Apr 16, 2024\n\nThe stock price of the largest bank in the U.S. fell 6.5% after providing guidance that disappointed investors.\n\n1 Wall Street Analyst Thinks JPMorgan Chase Stock Is Going to $215. Is It a Buy Around $183?\n\nEric Volkman | Apr 15, 2024\n\nThe company posted double-digit gains in its first quarter, but investors were disquieted by another number.\n\nIs JPMorgan Chase Stock a Buy On This Dip?\n\nJames Brumley | Apr 15, 2024\n\nInvestors panicked following disappointing 2024 guidance. They're not seeing the bigger picture. View More JPM Articles\n\nWhat to Watch This Earnings Season\n\nJPMorgan's stellar quarter is just the start.\n\nMotley Fool Staff | Jul 24, 2023\n\nBank News and a New Normal for Investors to Consider\n\nThree of the four largest bank failures in U.S. history have happened in the past two months.\n\nChris Hill | May 11, 2023\n\nThe Fed, Interest Rates, and What This Team of Investors Is Watching\n\nPlus: Big bank earnings and much more.\n\nChris Hill | Jan 27, 2022\n\nBig Banks Make a Big Splash in Q1\n\nThe biggest banks recently reported their latest results, and the numbers are very strong.\n\nMatt Frankel | May 4, 2021 View More JPM Podcasts\n\nEarnings Transcripts\n\nJPMorgan Chase (JPM) Q1 2024 Earnings Call Transcript\n\nJPM earnings call for the period ending March 31, 2024.\n\nMotley Fool Transcribing | Apr 12, 2024\n\nJPMorgan Chase (JPM) Q4 2023 Earnings Call Transcript\n\nJPM earnings call for the period ending December 31, 2023.\n\nMotley Fool Transcribing | Jan 12, 2024\n\nJPMorgan Chase (JPM) Q3 2023 Earnings Call Transcript\n\nJPM earnings call for the period ending September 30, 2023.\n\nMotley Fool Transcribing | Oct 13, 2023\n\nJPMorgan Chase (JPM) Q2 2023 Earnings Call Transcript\n\nJPM earnings call for the period ending June 30, 2023.\n\nMotley Fool Transcribing | Jul 14, 2023 View More JPM Earnings Transcripts\n\nPremium Investing Services\n\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n\nView Premium Services", "timestamp": "2024-05-01T19:03:25", "title": "JPMorgan Chase (JPM) Stock Price, News & Info | The Motley Fool", "url": "https://www.fool.com/quote/nyse/jpm/"}, {"id": "web-search_3", "snippet": "IBD Digital: 2 Months for $20\n\nPsychological Indicators\n\nStocks Near A Buy Zone\n\nRelative Strength at New High\n\nRising Profit Estimates\n\nIBD Digital: 2 Months for $20\n\nIBD Long-Term Leaders\n\nStocks Funds Are Buying\n\nInvesting Action Plan\n\nIBD 50 Stocks To Watch\n\nIBD Digital: 2 Months for $20\n\nPremium Investing Tools\n\nMagnificent Seven Stocks\n\nIBD Digital: 2 Months for $20\n\nInvesting With IBD Podcast\n\nHow To Invest Videos\n\nGrowth Stories Podcast\n\nIBD Digital: 2 Months for $20\n\nHow To Invest In Stocks\n\n3 Keys To Stock Investing\n\nTracking Stock Market Trends\n\nHow To Read Stock Charts\n\nPremium Online Courses\n\nEducational Resources\n\nInvesting Strategies Video Series\n\nInvesting With IBD Podcast\n\nInvesting Infographics\n\nIBD Digital: 2 Months for $20\n\nBREAKING: As Fed Pivots To Rate Cuts, Will Stocks Enjoy 1999-Like Boom?\n\nYour cart is currently empty. Visit the IBD Store to get started.\n\nIBD Digital: 2 Months for $20\n\nPsychological Indicators\n\nStocks Near A Buy Zone\n\nRelative Strength at New High\n\nRising Profit Estimates\n\nIBD Digital: 2 Months for $20\n\nIBD Long-Term Leaders\n\nStocks Funds Are Buying\n\nInvesting Action Plan\n\nIBD 50 Stocks To Watch\n\nIBD Digital: 2 Months for $20\n\nPremium Investing Tools\n\nMagnificent Seven Stocks\n\nIBD Digital: 2 Months for $20\n\nInvesting With IBD Podcast\n\nHow To Invest Videos\n\nGrowth Stories Podcast\n\nIBD Digital: 2 Months for $20\n\nHow To Invest In Stocks\n\n3 Keys To Stock Investing\n\nTracking Stock Market Trends\n\nHow To Read Stock Charts\n\nPremium Online Courses\n\nEducational Resources\n\nInvesting Strategies Video Series\n\nInvesting With IBD Podcast\n\nInvesting Infographics\n\nIBD Digital: 2 Months for $20\n\nYour cart is currently empty. Visit the IBD Store to get started.\n\nSign In or Subscribe\n\nIs The Biggest Bank Stock By Market Cap A Buy After Reclaiming This Support Level?\n\n06:22 PM ET 08/10/2022\n\nJPMorgan Chase's (JPM) shares rebounded Wednesday, retaking their 50-day line, after inflation showed signs of easing. So is JPM stock worth buying right now? X\n\nThe CPI inflation rate came in at 8.5%. That was down from June's 9.1%, as gas prices and shipping rates fell, and retailers began to cut prices to clear goods like clothing.\n\nThe bank's second-quarter results, reported last month, missed estimates. CEO Jamie Dimon warned that rising prices and higher interest rates could hurt what was still a strong U.S. economy.\n\n\"The U.S. economy continues to grow and both the job market and consumer spending, and their ability to spend, remain healthy,\" Dimon said in a statement.\n\n\"But geopolitical tension, high inflation, waning consumer confidence, the uncertainty about how high rates have to go and the never-before-seen quantitative tightening and their effects on global liquidity, combined with the war in Ukraine and its harmful effect on global energy and food prices are very likely to have negative consequences on the global economy sometime down the road,\" he continued.\n\nThe Federal Reserve has raised interest rates in an effort to head off rising prices, with the hopes that higher borrowing costs will keep the economy from overheating. Higher rates from the Fed can lift banks' bottom lines, as those rate hikes prompt banks to hike interest on things like credit cards and auto loans. But the Fed risks damaging the economy if consumers can't stomach rising borrowing costs.\n\nJPMorgan is the biggest U.S. bank by market value. But despite the bank's reputation, JPMorgan stock has largely trailed the S&P 500 since 1986. Here's a breakdown of the JPM stock chart and financials.\n\nIBD 50 Growth Stocks To Watch: Find The Best Stocks To Buy And Track\n\nJPM Stock Fundamental Analysis\n\nJPMorgan stock has a 29 Composite Rating, on a 1-99 scale, with 99 tops. Its EPS Rating stands at 65.\n\nIBD encourages investors to focus on stocks with Composite Ratings of 90 or higher.\n\nThe stock's SMR Rating is a B, with 'A' the highest possible rating.\n\nJPMorgan Stock Technical Analysis\n\nJPM stock is currently trading at around 118.\n\nThe stock and its relative strength line have rebounded in recent days. Longer term, the RS line shows that JPM stock has largely moved in line with the market going back to 1998, or even 1986.\n\nThat's also a problem for banking giants such as Citigroup (C), Goldman Sachs (GS) and Bank of America (BAC). While bank stocks benefit in tandem with the economy, if the economy is doing well, so will the stock market generally.\n\nLong-term outperformance has been ephemeral for JPM stock, even though it has generally outperformed its big peers.\n\nPut another way, if you bought the SPDR S&P 500 ETF (SPY) back in 1998, you'd have the same or better returns with far less risk.\n\nJPMorgan stock and its rivals can have periods of outperformance, as they did near the end of 2019. JPM stock, Goldman Sachs, Bank of America and others outperformed the market from April 2016 to March 2017, with most of those gains following former President Trump's surprise election victory.\n\nIBD Stock Of The Day: See How To Find, Track And Buy The Best Stocks\n\nJPMorgan has a market value of around $348 billion, according to MarketSmith. Its business is a one-stop financial shop for Wall Street and Main Street. But the stock is not in a base.\n\nBottom line: JPM stock is not a buy right now, based on IBD's chart analysis.\n\nLike other big banks, JPMorgan also has a poor record when it comes to beating the market for long stretches.\n\nCheck out IBD Stock Lists and other IBD content to find dozens of the best stocks to buy or watch.\n\nFollow Bill Peters on Twitter at @IBD_BPeters.\n\nYOU MIGHT ALSO LIKE:\n\nBanks And Financial Stocks: Latest News And Analysis\n\nInverted Yield Curve Sparks Recession Fears; What You Need To Know\n\nInvesting in Stocks 101: The Beginning Investor's Guide To Making More Money\n\nMarketSmith Provides Investors With Cool Tools\n\nS&P 500 Index: Track S&P News, Stocks To Watch And SPDR ETFs\n\n1/29/2024 What is the latest performance of the S&P 500 index? Which stocks are moving on the S&P 500 today? Check...\n\n1/29/2024 What is the latest performance of the S&P 500 index?...\n\nBanks And Financial Stocks: Latest News And Analysis\n\nCryptocurrency Prices And News: Bitcoin Price Rebounds To $43,000 As ETF Aftermath Continues\n\nBest Online Brokers: Great Service Still Matters Most In An AI-Fueled Investment World\n\nBest Online Brokers Survey: What It Takes To Make The Grade\n\nMerrill Edge Wants To Inspire Success Stories\n\nBest Online Brokers List: These 4 Brokerages Top Their Peers\n\nThese Stocks Led Dow's Run to 38,000. It's Not Who You Expect.\n\nWells Fargo Trying To Close In On Key Technical Benchmark\n\nFree Online Investing Workshop Join us for the Virtual Trading Summit and learn the fundamentals of smart investing!\n\nInvesting Insights You Can Trust Get 2 months of IBD Digital for $20, or add Barron’s + MarketWatch for $5/month more.\n\nFree Cryptocurrency Guide Curious about all the new Bitcoin ETFs? Check out IBD’s infographic explainer.\n\nA new survey reveals which online stock brokers are making their clients most happy. (© Gary Neill) Best Online Brokers: Great Service Still Matters Most In An AI-Fueled Investment World\n\nBest Online Brokers List: These 4 Brokerages Top Their Peers\n\nScore An Easy $5,000 Just For Opening This Brokerage Account\n\nGet instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20!\n\nGet market updates, educational videos, webinars, and stock analysis.\n\nLearn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content.", "timestamp": "2024-01-30T14:42:12", "title": "JPM Stock: Is JPMorgan Chase A Buy After Reclaiming This Support Level?| Investor's Business Daily", "url": "https://www.investors.com/news/jpm-stock-buy-now/"}, {"id": "web-search_5", "snippet": "Search News & Quotes\n\nTopicsStock PicksLists & RankingsMagazineDataAdvisorPenta\n\nJPMorgan Chase & Co.\n\nAbout JPMorgan Chase & Co.\n\nJPMorgan Chase & Co. is a financial holding company, which engages in the provision of financial and investment banking services. The firm offers a range of investment banking products and services in all capital markets, including advising on corporate strategy and structure, capital raising in equity and debt markets, risk management, market making in cash secu...See Full Profile\n\nAverage price target from 26 ratings: $193.53\n\nDay Range182.48 - 184.46\n\n52 Wk Range123.11 - 185.20\n\n7.15M (77.76% of Avg)\n\nShort Interest Change\n\nJPMorgan Chase & Co.\n\nBank of America Corp.\n\nRoyal Bank of Canada\n\nToronto-Dominion Bank\n\nHSBC Holdings PLC (UK Reg)\n\nMitsubishi UFJ Financial Group Inc.\n\nOverviewCompany & PeopleFinancialsResearch & RatingsStockGraderAdvanced Chart\n\nChairman & Chief Executive Officer\n\nIndependent Director\n\nPresident & Chief Operating Officer\n\nIndependent Director\n\nChief Financial Officer & Executive VP\n\nIndependent DirectorSee All on Company & People\n\n-126.26BSee All Financials\n\nNotes & Data Providers\n\nStocks: Real-time U.S. stock quotes reflect trades reported through Nasdaq only; comprehensive quotes and volume reflect trading in all markets and are delayed at least 15 minutes. International stock quotes are delayed as per exchange requirements. Fundamental company data and analyst estimates provided by FactSet. Copyright 2019© FactSet Research Systems Inc. All rights reserved. Source: FactSet\n\nIndexes: Index quotes may be real-time or delayed as per exchange requirements; refer to time stamps for information on any delays. Source: FactSet\n\nMarkets Diary: Data on U.S. Overview page represent trading in all U.S. markets and updates until 8 p.m. See Closing Diaries table for 4 p.m. closing data. Sources: FactSet, Dow Jones\n\nStock Movers: Gainers, decliners and most actives market activity tables are a combination of NYSE, Nasdaq, NYSE American and NYSE Arca listings. Sources: FactSet, Dow Jones\n\nETF Movers: Includes ETFs & ETNs with volume of at least 50,000. Sources: FactSet, Dow Jones\n\nBonds: Bond quotes are updated in real-time. Sources: FactSet, Tullett Prebon\n\nCurrencies: Currency quotes are updated in real-time. Sources: FactSet, Tullett Prebon\n\nCommodities & Futures: Futures prices are delayed at least 10 minutes as per exchange requirements. Change value during the period between open outcry settle and the commencement of the next day's trading is calculated as the difference between the last trade and the prior day's settle. Change value during other periods is calculated as the difference between the last trade and the most recent settle. Source: FactSet\n\nData are provided 'as is' for informational purposes only and are not intended for trading purposes. FactSet (a) does not make any express or implied warranties of any kind regarding the data, including, without limitation, any warranty of merchantability or fitness for a particular purpose or use; and (b) shall not be liable for any errors, incompleteness, interruption or delay, action taken in reliance on any data, or for any damages resulting therefrom. Data may be intentionally delayed pursuant to supplier requirements.\n\nMutual Funds & ETFs: All of the mutual fund and ETF information contained in this display, with the exception of the current price and price history, was supplied by Lipper, A Refinitiv Company, subject to the following: Copyright 2019© Refinitiv. All rights reserved. Any copying, republication or redistribution of Lipper content, including by caching, framing or similar means, is expressly prohibited without the prior written consent of Lipper. Lipper shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon.\n\nCryptocurrencies: Cryptocurrency quotes are updated in real-time. Sources: CoinDesk (Bitcoin), Kraken (all other cryptocurrencies)\n\nCalendars and Economy: 'Actual' numbers are added to the table after economic reports are released. Source: Kantar Media\n\nBarron's Stock Screen\n\nSubscribe to Barron's\n\nThe Wall Street Journal\n\nInvestor's Business Daily\n\nFinancial News London\n\nCorporate Subscriptions\n\nInvesting in Education\n\nPress & Media Inquiries\n\nManage Notifications\n\nSubscriber Agreement & Terms of Use\n\nCopyright © 2024 Dow Jones & Company, Inc. All Rights Reserved.", "timestamp": "2024-04-10T14:35:40", "title": "JPM | JPMorgan Chase & Co. Stock Overview (U.S.: NYSE) | Barron's", "url": "https://www.barrons.com/market-data/stocks/jpm"}]}