{"text": "Here is a summary of news and events from the past week that may influence a buy/sell decision for the stock symbol XLE:\n\n- Energy stocks, including XLE, soared in March, with the Energy Select Sector SPDR Fund (XLE) up about 11% for the month. This surge was attributed to rising oil prices, fuelled by concerns about supply and Russia's output cuts.\n- Truist upgraded the energy sector to overweight as technicals improved, indicating a positive outlook for XLE.\n- The US restricted oil and gas drilling across Alaska's North Slope in a new regulation, which could impact XLE's performance.\n- Oil prices could face increased uncertainty, according to TD Securities, potentially affecting XLE's performance.\n- Goldman Sachs began shifting away from the tech sector, which could impact XLE as investors seek alternative investment opportunities.\n- The Dow Jones Industrial Average jumped 500 points on Wednesday, with the S&P 500 and Nasdaq Composite also gaining, after Federal Reserve Chair Jerome Powell ruled out a rate hike, easing investor worries about inflation.\n- Regional bank stocks surged 2.5% on Wednesday, with the SPDR S&P Regional Banking ETF (KRE) up 4%, following the Federal Reserve's decision to maintain interest rates.\n- Short interest in the \"Magnificent Seven\" stocks, including Alphabet, Amazon, Apple, Microsoft, Meta Platforms, Nvidia, and Tesla, climbed to a record $127 billion in April, indicating high investor interest in these tech stocks.\n- The recent market pullback is considered a \"normal pullback\" by Charles Schwab's Kevin Gordon, suggesting that the current market conditions are not cause for significant concern.\n- Goldman Sachs' Peter Oppenheimer recommends investors diversify their portfolios with exposure to both quality growth and deep value stocks, including the energy sector.", "documents": [{"id": "web-search_0", "snippet": "Skip to Main Content\n\nSkip to Related Content\n\nSign in to view your mail\n\nRussell 2000 Futures\n\nEnergy Select Sector SPDR Fund (XLE)\n\nNYSEArca - Nasdaq Real Time Price. Currency in USD\n\nVisitors trend2W10W9M\n\nAt close: 04:00PM EDT\n\n(-0.07%) After hours:\n\nTrade prices are not sourced from all markets\n\nYTD Daily Total Return\n\nEnergy stocks lead March gains in sign of broadening market rally\n\nEnergy stocks are the biggest winners this month as oil prices push higher. It's a sign the market rally is broadening beyond just Big Tech.\n\nAdBrightLifeDaily.com| Search Ads\n\nKiller New Hyundai Santa Fe Is Perfect For Seniors (Take...\n\nEnergy stocks soared in March\n\nEnergy stocks popped in March, with the Energy Select Sector SPDR Fund (XLE) up about 11% for the month. The stocks have benefited from the rise in oil prices (CL=F, BZ=F), which have been fueled by concerns about supply, especially after Russia ordered output cuts. Yahoo Finance's Ines Ferré breaks down what's happening in the sector. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Stephanie Mikulich.\n\nData DisclaimerHelpSuggestions\n\nTermsandPrivacy Policy\n\nAbout Our AdsSitemap\n\n© 2024 Yahoo. All rights reserved.\n\nYahoo Finance updates are here. Better quotes, news, and tools.", "timestamp": "2024-04-15T12:15:43", "title": "Energy Select Sector SPDR Fund (XLE) Stock Price, News, Quote & History - Yahoo Finance", "url": "https://finance.yahoo.com/quote/XLE/"}, {"id": "web-search_1", "snippet": "Entering text into the input field will update the search result below\n\nSearch for Symbols, analysts, keywords\n\nXLE Energy Select Sector SPDR® Fund ETF\n\nETF Price & OverviewFollow\n\n$95.29-1.34 (-1.39%)11:58 AM 04/26/24\n\nNYSEARCA | $USD | Realtime\n\nExpand For Key Data »\n\nAll S&P Utility stocks are above 50-day MA, less than 10% of Info Tech names are\n\nExxon leads industry fight against UN talks seeking cap on plastic production\n\nOil rally fades as fears ease over Israel-Iran hostilities; week ends lower\n\nWall Street's April pullback intensifies as S&P 500 notches worst week in over a year\n\nThe Energy sector is looking attractive again - SSGA\n\nU.S. restricts oil and gas drilling across Alaska's North Slope in new regulation\n\nTruist upgrades energy sector to overweight as technicals improve\n\n14 companies with a near-term catalyst around 1Q earnings - MS\n\nOil prices could face increased uncertainty – TD Securities\n\nShort interest on energy stocks up in March; APA and EQT most shorted, COP least shorted\n\nMore News And Analysis »\n\nXLE Dividend Growth History\n\nMore On Dividend Growth »\n\nYou may be interested in:\n\nEnergy Select Sector SPDR® Fund ETF (XLE) Frequently Asked Questions\n\nTo ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser.\n\nIs this happening to you frequently? Please report it on our feedback forum.\n\nIf you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh.", "timestamp": "2024-04-26T16:02:58", "title": "Energy Select Sector SPDR® Fund ETF (XLE) Stock Price, Quote, News & Analysis", "url": "https://seekingalpha.com/symbol/XLE"}, {"id": "web-search_2", "snippet": "Futures & Commodities\n\nEquity and Opportunity\n\nHelp for Low Credit Scores\n\nFind the Credit Card for You\n\nBest Rewards Credit Cards\n\nBest Travel Credit Cards\n\nBest 0% APR Credit Cards\n\nBest Balance Transfer Credit Cards\n\nBest Cash Back Credit Cards\n\nBest Credit Card Welcome Bonuses\n\nBest Credit Cards to Build Credit\n\nFind the Best Personal Loan for You\n\nBest Debt Consolidation Loans\n\nBest Loans to Refinance Credit Card Debt\n\nBest Loans with Fast Funding\n\nBest Small Personal Loans\n\nBest Large Personal Loans\n\nBest Personal Loans to Apply Online\n\nBest Student Loan Refinance\n\nFind the Savings Account for You\n\nBest High Yield Savings Accounts\n\nBest Big Bank Savings Accounts\n\nBest Big Bank Checking Accounts\n\nBest No Fee Checking Accounts\n\nNo Overdraft Fee Checking Accounts\n\nBest Checking Account Bonuses\n\nBest Money Market Accounts\n\nBest Mortgages for Small Down Payment\n\nBest Mortgages for No Down Payment\n\nBest Mortgages with No Origination Fee\n\nBest Mortgages for Average Credit Score\n\nAdjustable Rate Mortgages\n\nAffording a Mortgage\n\nBest Homeowners Insurance\n\nBest Renters Insurance\n\nAll Credit Monitoring\n\nBest Credit Monitoring Services\n\nBest Identity Theft Protection\n\nHow to Boost Your Credit Score\n\nCredit Repair Services\n\nAll Personal Finance\n\nBest Expense Tracker Apps\n\nBest Money Transfer Apps\n\nBest Resale Apps and Sites\n\nBuy Now Pay Later (BNPL) Apps\n\nBest Small Business Savings Accounts\n\nBest Small Business Checking Accounts\n\nBest Credit Cards for Small Business\n\nBest Small Business Loans\n\nBest Tax Software for Small Business\n\nBest Tax Software for Small Businesses\n\nAll Help for Low Credit Scores\n\nBest Credit Cards for Bad Credit\n\nBest Personal Loans for Bad Credit\n\nBest Debt Consolidation Loans for Bad Credit\n\nPersonal Loans if You Don't Have Credit\n\nBest Credit Cards for Building Credit\n\nPersonal Loans for 580 Credit Score or Lower\n\nPersonal Loans for 670 Credit Score or Lower\n\nBest Mortgages for Bad Credit\n\nHow to Boost Your Credit Score\n\nBest Roth IRA Accounts\n\nBest Free Stock Trading Platforms\n\nSearch quotes, news & videos\n\nEnergy Select Sector SPDR Fund XLE:NYSE Arca\n\nRT Quote | Last NYSE Arca, VOL From CTA | USD\n\n52 Week High Date04/12/24\n\n52 Week Low Date06/01/23\n\n10 Day Average Volume15.63M\n\n1 Year % Change12.43Show Events\n\n52 Week High Date04/12/24\n\n52 Week Low Date06/01/23\n\n10 Day Average Volume15.63M\n\n1 Year % Change12.43\n\nEx Div Date03/18/2024\n\nLatest On Energy Select Sector SPDR Fund\n\nALL CNBCINVESTING CLUBPRO\n\nOakmark's Bill Nygren shares his value opportunities in the current marketApril 16, 2024CNBC.com\n\nEnergy rallying while other sectors drop 'not a good situation for the market': Bespoke's HickeyApril 11, 2024CNBC.com\n\nUsing options to capitalize on higher oil prices as summer approachesApril 8, 2024CNBC.com\n\nEnergy price spike has more to go, predicts Oil Price Information Global HeadApril 5, 2024CNBC.com\n\nEnergy might be the 'story of the summer,' one CIO says. How to play itApril 2, 2024CNBC.com\n\nContent From Our Affiliates\n\nEnergy Select Sector SPDR: Pivot pointsApril 26, 2024TipRanks\n\nExperts Say Higher Interest Rates May Help These Stock Market Sectors April 19, 2024TipRanks\n\nEnergy Sector Upgraded to Overweight by TruistApril 18, 2024TipRanks\n\nXLE, VDE, FENY: 3 Must-Know ETFs as Energy Stocks SurgeApril 15, 2024TipRanks\n\nGoldman Sachs Begins Shifting Away from Tech SectorApril 10, 2024TipRanks\n\nOakmark's Bill Nygren shares his value opportunities in the current market", "timestamp": "2024-04-29T13:57:12", "title": "Check out Energy Select Sector SPDR Fund's stock price (XLE) in real time", "url": "https://www.cnbc.com/quotes/XLE"}, {"id": "web-search_3", "snippet": "Futures & Commodities\n\nEquity and Opportunity\n\nHelp for Low Credit Scores\n\nFind the Credit Card for You\n\nBest Rewards Credit Cards\n\nBest Travel Credit Cards\n\nBest 0% APR Credit Cards\n\nBest Balance Transfer Credit Cards\n\nBest Cash Back Credit Cards\n\nBest Credit Card Welcome Bonuses\n\nBest Credit Cards to Build Credit\n\nFind the Best Personal Loan for You\n\nBest Debt Consolidation Loans\n\nBest Loans to Refinance Credit Card Debt\n\nBest Loans with Fast Funding\n\nBest Small Personal Loans\n\nBest Large Personal Loans\n\nBest Personal Loans to Apply Online\n\nBest Student Loan Refinance\n\nFind the Savings Account for You\n\nBest High Yield Savings Accounts\n\nBest Big Bank Savings Accounts\n\nBest Big Bank Checking Accounts\n\nBest No Fee Checking Accounts\n\nNo Overdraft Fee Checking Accounts\n\nBest Checking Account Bonuses\n\nBest Money Market Accounts\n\nBest Mortgages for Small Down Payment\n\nBest Mortgages for No Down Payment\n\nBest Mortgages with No Origination Fee\n\nBest Mortgages for Average Credit Score\n\nAdjustable Rate Mortgages\n\nAffording a Mortgage\n\nBest Homeowners Insurance\n\nBest Renters Insurance\n\nAll Credit Monitoring\n\nBest Credit Monitoring Services\n\nBest Identity Theft Protection\n\nHow to Boost Your Credit Score\n\nCredit Repair Services\n\nAll Personal Finance\n\nBest Expense Tracker Apps\n\nBest Money Transfer Apps\n\nBest Resale Apps and Sites\n\nBuy Now Pay Later (BNPL) Apps\n\nBest Small Business Savings Accounts\n\nBest Small Business Checking Accounts\n\nBest Credit Cards for Small Business\n\nBest Small Business Loans\n\nBest Tax Software for Small Business\n\nBest Tax Software for Small Businesses\n\nAll Help for Low Credit Scores\n\nBest Credit Cards for Bad Credit\n\nBest Personal Loans for Bad Credit\n\nBest Debt Consolidation Loans for Bad Credit\n\nPersonal Loans if You Don't Have Credit\n\nBest Credit Cards for Building Credit\n\nPersonal Loans for 580 Credit Score or Lower\n\nPersonal Loans for 670 Credit Score or Lower\n\nBest Mortgages for Bad Credit\n\nHow to Boost Your Credit Score\n\nBest Roth IRA Accounts\n\nBest Free Stock Trading Platforms\n\nSearch quotes, news & videos\n\nUpdated Wed, May 1 20243:09 PM EDT\n\nShareShare Article via FacebookShare Article via TwitterShare Article via LinkedInShare Article via Email\n\nDow jumps 500 points as Powell says the Fed's next move is unlikely to be a hike: Live updates\n\nStocks rallied on Wednesday after Federal Reserve Chair Jerome Powell largely ruled out that the central bank's next move could be a hike, easing investor worries that it was losing control of sticky inflation.\n\nThe Dow Jones Industrial Average jumped 500 points, or 1.3%, with a large part of the gains coming in afternoon trading and on the heels of the Fed's latest interest rate decision. The S&P 500 added 1%, while the Nasdaq Composite gained 1.4%.\n\nThe central bank opted to hold rates steady, citing a \"lack of further progress\" in bringing inflation back down toward its 2% goal. However, stock prices rallied as Powell ruled out the likelihood of a hike in a press conference following the decision.\n\n\"I think it's unlikely that the next policy rate move will be a hike,\" he said. \"I'd say it's unlikely.\"\n\nInvestors also reacted positively to the Fed saying it would tap the brakes on one way it tightens conditions for financial markets. Starting in June, the central bank said it will slow the pace at which it allows maturing bond proceeds to roll off its balance sheet without reinvesting them. This is a process known as quantitative tightening.\n\n\"The fact that inflation remains elevated means we're not going to see rate cuts very soon,\" said Sonu Varghese, global macro strategist at Carson Group. \"At the same time, they are going to slow the pace at which they shrink their balance sheet (their massive bond portfolio), which will likely put less upward pressure on bond yields.\"\n\nThe 10-year Treasury yield dropped below 4.6% following Powell's comments, alleviating some investor fears that it may jump back above 5% this year, and restrict the economy. Major technology stocks sensitive to the level of rates and risk appetite led the afternoon gains, with Microsoft and Alphabet gaining more than 2%. Amazon advanced 5% following better-than-expected earnings and revenue in the first quarter, while Meta Platforms jumped 4%.\n\nWall Street is coming off a losing month, with the S&P and the Nasdaq posting losses of more than 4%. The Dow fell 5% for its worst monthly performance since September 2022.\n\nStocks tied to artificial intelligence struggle during Wednesday's session, following disappointing reports from some top AI contenders. Advanced Micro Devices tumbled 7% after issuing an in-line current-quarter revenue forecast, while Super Micro Computer slid 11% on light revenue.\n\nRegional bank stocks surge 2.5% and are on pace to snap a 4-day decline\n\nRegional bank stocks rallied Wednesday, sending the SPDR S&P Regional Banking ETF (KRE) 4% higher in late afternoon trading following the Federal Reserve's latest policy decision to leave interest rates unchanged and scale back its qualitative tightening program.\n\nThat's the first up day for regional bank stocks as a group in five days.\n\nThe largest percentage gains in regional banks came in New York Community Bancorp, up 31%, Axos Financial, higher by 14%, Capitol Federal Financial, ahead 9%, Bancorp Inc., which gained 6% and BankUnited Inc., better by 5.7%.\n\nSPDR S&P Regional Banking ETF over the past month.\n\nDollar index falls to session low\n\nThe dollar index declined 0.1% to 106.09 Wednesday afternoon following the Federal Reserve's decision to maintain its benchmark short-term borrowing rate in a range between 5.25% and 5%. The decision had been widely anticipated by the market.\n\nHowever, the dollar index was still above Tuesday's low of 105.667.\n\n— Hakyung Kim, Gina Francolla\n\nFederal Reserve keeps rates steady, moves to ease the pace of balance sheet reduction\n\nFederal Reserve Bank Chair Jerome Powell announces that interest rates will remain unchanged during a news conference at the bank's William McChesney Martin building on May 01, 2024 in Washington, DC.\n\nChip Somodevilla | Getty Images\n\nThe Federal Reserve on Wednesday kept interest rates steady, deciding not to lower rates as it contends with persistent pricing pressures.\n\nThe central bank kept its benchmark short-term borrowing rate in a targeted range between 5.25% and 5% in what was a widely anticipated move. The federal funds rate has been at that level since July 2023.\n\nThe Federal Open Market Committee voted to ease the pace at which it is lowering bond holdings on the Fed's balance sheet, a move that could signal an incremental easing of monetary policy.\n\nThe S&P 500 was slightly lower following the decision.\n\n— Sarah Min, Jeff Cox\n\nRecent market sell-off is a 'normal pullback,' says Charles Schwab's Gordon\n\nThe recent market pullback is not anything out of the ordinary following a strong multimonth run in equities, according to Charles Schwab's Kevin Gordon.\n\n\"This is all part of a normal pullback after a strong rally since last October,\" said the director and senior investment strategist. \"Relative to prior pullbacks and prior bull markets, this looks pretty normal and pretty healthy.\"\n\nThe consolidation and rotation seen over the past month is also helping remove some \"frothy investor sentiment\" that has been a risk to the market in recent months, he added.\n\nGoldman Sachs' Peter Oppenheimer says diversification is key for investors\n\nPeter Oppenheimer, the chief global equity strategist at Goldman Sachs, believes diversification will be key for investors this year.\n\nTo that end, he recommends investors barbell their portfolios with exposure to both quality growth and deep value stocks.\n\n\"There's some very cheap parts of the markets in value sectors which have been neglected for a very long time, but where you're starting to see some really strong compound cash returns for investors,\" Oppenheimer said on CNBC's \"Money Movers\" on Wednesday. He added that this was especially true in the energy and financials sectors, particularly for European banks.\n\nQuality growth names consist of companies with strong balance sheets, therefore making them less sensitive to rising rates.\n\nLikewise, Oppenheimer also believes investors should broaden their portfolios to ex-U.S. opportunities this year.\n\n\"That doesn't mean to be underweight of the U.S., but to have more broad global exposure because some of the more value orientated markets like Europe, like Japan, are actually holding up or even outperforming relative to the U.S. because they're a lot cheaper and therefore less exposed to the risks of rising rates,\" the strategist added.\n\nViking shares pop more than 10% after cruise line operator's NYSE debut\n\nShares of luxury cruise line operator Viking popped 10.3% after the company's initial public offering on the New York Stock Exchange on Wednesday.\n\nViking started trading at $24 per share under the ticker \"VIK,\" and was last at $26.55 a share during early afternoon trading Wednesday. The company was targeting a $10.4 billion valuation in its IPO, making it the third-largest cruise operator after Royal Caribbean and Carnival.\n\nViking upsized its IPO after existing shareholders decided to sell an additional nine million shares due to strong demand from mutual fund investors, according to a source familiar with the situation, CNBC reported.\n\n— Pia Singh, Seema Mody\n\nThe Dow bucked the other two major indexes' downtrend on Wednesday.\n\nThe blue-chip average added about 0.3% in midday trading. Meanwhile, the broad S&P 500 and technology-heavy Nasdaq Composite slipped 0.3% and 0.4%, respectively.\n\nJohnson & Johnson and 3M led the Dow higher by percent change, climbing more than 4% and 2%, respectively. Boeing and Honeywell were the next-biggest gainers, with each adding about 1.4%.\n\nThose jumps overshadowed slides seen elsewhere. Nike was the worst performer in the average with a drop of nearly 2%, followed by Chevron's loss of almost 1%.\n\nDespite Wednesday's outperformance, the Dow has seen the smallest gain of the three major averages compared with the start of 2024.\n\nSuper Micro Computer, Starbucks, Pfizer among stocks making biggest midday moves\n\nThe logos of Super Micro Computer are pictured at one of the world's largest computer and technology trade shows.\n\nCheck out the companies making headlines in midday trading:\n\nSuper Micro Computer — The server vendor dropped 15% after missing revenue expectations for its fiscal third quarter. However, Super Micro beat analysts' expectations for its adjusted earnings and hiked its revenue guidance for its fiscal 2024 year.\n\nStarbucks — Shares plunged more than 16% after the coffee chain posted weaker-than-expected quarterly results on the top and bottom lines. Starbucks posted adjusted earnings of 68 cents per share on revenue of $8.56 billion. It missed analysts' forecasts of 79 cents per share in earnings and $9.13 billion in revenue, per LSEG.\n\nNew York Community Bank — Shares of the beaten-down regional bank popped more than 31% after CEO Joseph Otting said in a release, \"we have a clear path to profitability over the following two years.\"\n\nFor the full list, read here.\n\nShort interest in 'Magnificent 7' stocks climbed to record $127 billion in April, S3 Partners says\n\nShort interest in the \"Magnificent Seven\" stocks climbed to a record $127 billion in April, S3 Partners managing director of predictive analytics Ihor Dusaniwsky said in a report Wednesday.\n\nBets against the seven (Alphabet, Amazon, Apple, Microsoft, Meta Platforms, Nvidia and Tesla) \"will always be high,\" since they represent \"an easy and cheap way to hedge the tech aspect of a portfolio. But the momentum of the market, especially the tech side, does dictate the majority of the variances of short interest on these seven companies,\" Dusaniwsky said, noting that short interest on the seven averaged $86 billion a month over the past five years but fell as low as $57 billion in 2022.\n\nSo far in 2024, investors have made an estimated $5.6 billion shorting Tesla and $2.4 billion going against Apple, according to S3 mark-to-market data. But they have lost $9.8 billion betting the other way against Nvidia, are down $2.3 billion on Meta and off $2.1 billion on Amazon.\n\nGiven the past week's rebound in the market, S3 has mostly observed short covering in the group, where investors buy back stock to limit their losses. \"We have seen some squeeze related short covering in NVDA which was partially offset with increased short selling in MSFT, AAPL and META,\" S3 said.\n\nS&P 500 has seen 300 trading days since last dropping more than 2%\n\nTraders work on the floor of the New York Stock Exchange during morning trading on April 29, 2024.\n\nMichael M. Santiago | Getty Images\n\nThere have been 300 sessions since the S&P 500 last tumbled more than 2% in one day, according to Strategas.\n\nThat stretch of \"subdued volatility,\" as the firm calls it, is nearing levels last seen in 2017, when the broad index went more than 350 sessions without a slide that big. These periods are typically associated with above-average returns, Strategas' Ryan Grabinski told clients in a note.\n\nStill, he said it is a matter of when — and not if — volatility comes back. \"The real question is what exactly will the catalyst be for that to happen?\" Grabinski said in his Wednesday note.\n\nJob openings fell in April to lowest in more than 3 years\n\nJob openings declined by 325,000 in March, signaling that while hiring is still brisk, demand is decreasing.\n\nThe Labor Department's Job Openings and Labor Turnover Survey released Wednesday shows postings declined to a seasonally adjusted 8.49 million, which represented a 0.2 percentage point decrease to 5.1% as a share of total workers. Openings declined more than 1.1 million from a year ago.\n\nThat was the lowest level since February 2021 and took the ratio of openings to available workers down to 1.3 to 1, below its 2 to 1 peak in early 2022. Hires and separations also decreased on the month.\n\nFed Chair Powell's postmeeting comments could take a 'hawkish shift,' Wolfe Research says\n\nU.S. Federal Reserve Chair Jerome Powell holds a press conference following a two-day meeting of the Federal Open Market Committee on interest rate policy in Washington on March 20, 2024.\n\nElizabeth Frantz | Reuters\n\nFederal Reserve Chair Jerome Powell could take a more hawkish tone in Wednesday's press conference following the central bank's policy meeting, according to Wolfe Research. That would be in line with Powell's more recent comments on inflation after data pointed to persistent pricing pressures.\n\nBut the Wall Street firm anticipates that growth and employment will likely have more of an effect on stocks in the intermediate term, the firm's Chris Senyek wrote Wednesday. Wednesday's Fed meeting precedes the April jobs report that is due out Friday.\n\n\"We expect the FOMC's statement at 2pm ET and Fed Chair Powell's press conference tone to reflect the committee's hawkish shift two weeks ago,\" Senyek wrote. \"That said, looking out over the intermediate-term, we believe that the growth & employment outlook is likely to have a bigger influence on FOMC's decision making and overall equity market returns.\"\n\nISM manufacturing index declines while prices measure spikes\n\nThe manufacturing sector returned to a contraction in April, according to a report Wednesday from the Institute for Supply Management that also showed accelerating inflation pressures.\n\nThe ISM Manufacturing Index declined to 49.2 for the month, off 1.1 points from March, which was the first time the measure moved above the 50 level that indicates expansion since September 2022. Economists surveyed by Dow Jones had been looking for a reading of 50.1.\n\nWithin the survey, the prices index rose to 60.9, a 5.1-point increase and another indication that inflation is proving more intractable than economists and policymakers had been expecting.\n\nCVS Health heads for worst day since 2009\n\nPeople exit the CVS Pharmacy store in Times Square in New York City on March 1, 2024.\n\nEduardo Munoz Alvarez | View Press | Corbis News | Getty Images\n\nCVS Health sank more than 18% on Wednesday and headed for its worst day in nearly 15 years on the back of a disappointing quarter.\n\nThe slump came after the drugstore giant's quarterly results fell short of Wall Street's estimates. CVS also slashed its full-year outlook due to elevated medical costs.\n\nIf shares close at these levels, CVS will register its worst daily performance since Nov. 5, 2009, when shares tumbled more than 20%. It would also mark the company's third-worst trading day on record.\n\nS&P 500, Nasdaq open lower\n\nThe S&P 500 and Nasdaq Composite opened lower Wednesday as Wall Street braced for the Federal Reserve's upcoming rate decision.\n\nThe broad market index slipped 0.15%, along with the Nasdaq. The Dow Jones Industrial Average added 46 points, or 0.1%\n\nStocks making the biggest moves premarket\n\nA Marriott hotel in Austin, Texas, on Feb. 12, 2023.\n\nSergio Flores | Bloomberg | Getty Images\n\nHere are some of the companies making headlines in premarket trading:\n\nPfizer — Shares climbed more than 2% after New York City-based Pfizer beat Wall Street's first-quarter revenue forecast and raised its full-year profit guidance.\n\nCVS Health — Shares tumbled 12% after the drugstore chain and pharmacy benefit manager's first-quarter adjusted earnings and revenue fell short of estimates and it cut its full-year profit outlook, citing higher medical costs.\n\nMarriott International — The hotel chain slipped about 2% on the heels of weak earnings and current-quarter guidance. Marriott earned $2.13 per share, excluding items, in the first quarter, missing the consensus forecast of $2.17 from analysts polled by LSEG.\n\nRead the full list here.\n\nPrivate payrolls add 192,000 workers in April\n\nPrivate payrolls added 192,000 workers in April, according to the latest data from payrolls processing firm ADP.\n\nThe figure came in ahead of the 183,000 additions expected by Dow Jones, but below the 208,000 upward revision for March.\n\n— Jeff Cox, Samantha Subin\n\nAMD drops 7% after providing in-line forecast\n\nPau Barrena | Afp | Getty Images\n\nAMD shares dropped nearly 7% in premarket trading after the chipmaker provided only an in-line forecast for the current quarter.\n\nThe company reported first-quarter sales that were slightly ahead of Wall Street expectations, while AMD expects $4 billion in 2024 artificial intelligence chip sales, up from a $3.5 billion forecast in January.\n\nHowever, since the popular chip stock has already risen 14% in 2024, Tuesday's results were not enough to prevent the stock from sliding.\n\nCVS slides more than 10% after earnings miss\n\nA sign outside of a CVS Pharmacy store in Miami, Florida, on Feb. 7, 2024.\n\nJoe Raedle | Getty Images\n\nShares of CVS Health fell sharply in premarket trading after a first-quarter report missed Wall Street expectations on the top and bottom lines.\n\nThe pharmacy and health-care company reported $1.31 in adjusted earnings per share on $88.44 billion in revenue. Analysts surveyed by LSEG were expecting $1.69 in earnings per share on $89.21 billion in revenue.\n\nThe company also cut its full-year guidance for earnings per share and cash flow.\n\nCVS' health-care benefits segment struggled, with its adjusted operating income falling nearly 60% year over year despite an increase in revenue. The company said the decline was due in part to increased Medicare usage.\n\nThe stock was down more than 11%.\n\nShares of CVS fell sharply after reporting a weaker-than-expected first quarter.\n\nPfizer jumps 2% on strong outlook\n\nPfizer CEO Albert Bourla talks during a press conference with European Commission President Ursula von der Leyen after a visit to oversee the production of the Pfizer-BioNtech Covid-19 vaccine at the factory of U.S. pharmaceutical company Pfizer in Puurs, Belgium, on April 23, 2021.\n\nPfizer shares gained 2% after the drugmaker surpassed revenue expectations and lifted its profit outlook as it benefits from cost-cutting initiatives and strong sales within its non-Covid segments.\n\nThe company reported revenue of $14.88 billion, topping the $14.01 billion expected by analysts polled by LSEG.\n\nFor the fiscal year, Pfizer said it expects adjusted earnings to range between $2.15 and $2.35 a share. That is up from its previous guidance of $2.05 to $2.25 per share.\n\n— Samantha Subin, Annika Kim Constantino\n\nFTSE 100 opens higher\n\nThe London Stock Exchange Group offices are seen in London, England, on Dec. 29, 2017.\n\nToby Melville | Reuters\n\nThe U.K.'s FTSE 100 was 0.2% higher at 8:30 a.m. London time.\n\nMost European bourses are closed for the May Day public holiday. The regional Stoxx 600 index closed lower Tuesday as it clocked its first monthly decline since October.\n\nMicrosoft opens first regional data center in Thailand\n\nTech giant Microsoft announced it will open its first regional data center in Thailand.\n\nThe company said it will also build new cloud and artificial intelligence infrastructure in Thailand, as well as provide AI skilling opportunities for more than 100,000 people\n\nMicrosoft said the data center region will expand the availability of its hyperscale cloud services, \"facilitating enterprise-grade reliability, performance, and compliance with data residency and privacy standards.\"\n\nMitsui's full-year profit falls 6%, shares climb as $1.26 billion buyback announced\n\nJapanese trading house Mitsui and Co. reported a 6.4% fall in profit to 1.08 trillion yen, or $6.84 billion, for its 2023 financial year that ended March 31.\n\nProfit before tax came in at 1.3 trillion yen, down 6.7% year on year, while revenue dipped 6.9% to 13.32 trillion yen compared to the same period last year.\n\nDespite the poorer results, shares of the company climbed 1.23% as it also announced a 200 billion yen share buyback from May 2 to Sept. 20.\n\nMitsui will buy back up to 40 million shares, or 80 million after a share split on July 1.\n\nMoney market data suggests yen strengthening may have been intervention: Reuters\n\nThe sudden strengthening of the yen on Monday is likely due to intervention by Japanese authorities, Reuters reported, citing money market data from the Bank of Japan.\n\nMoney market data revealed that the central bank's projection for Wednesday's money market conditions indicated a 7.56 trillion yen, or $47.91 billion, net receipt of funds.\n\nReuters said this compared with a 2.05 billion yen to 2.30 billion yen estimate from money market brokerages that excludes intervention, adding that currency trades take two days to settle.\n\nOn Monday, the yen weakened to a 34-year low against the greenback, hitting 160.03 before strengthening to about 155 in the space of a few hours.\n\nSouth Korea's exports post sharp increase in April, beat expectations\n\nSouth Korea posted a 13.8% increase in exports in April, a sharp increase compared to the 3.1% rise in March, according to preliminary estimates by the country's customs service.\n\nThe rise also beat the 13.7% increase expected by economists polled by Reuters.\n\nImports to South Korea climbed 5.4%, less than the 6.2% rise expected and a reversal from the 12.3% fall in March.\n\nAs such, the country's trade balance narrowed to $1.53 billion, down from the $4.29 billion recorded in March.\n\nUtilities were the sole winning S&P 500 sector in April\n\nWorkers replace power lines in Monterey Park, California, on Oct. 6, 2023.\n\nFrederic J. Brown | AFP | Getty Images\n\nOf the 11 sectors within the S&P 500, utilities managed to eke out a narrow gain for this month.\n\nUtilities added 1.6% in April, while the other 10 sectors were in the red. Energy managed a narrow loss of 0.9%, while consumer staples, another defensive category, slipped 1.1%.\n\nThe sector's gains were buoyed by NextEra Energy, which advanced 4.8% in April. Consolidated Edison jumped 3.9%, and Dominion Energy gained 3.6%.\n\nUtilities, known for their steady dividends, could come into focus as investors look for income-producing assets to cushion their portfolios during rocky markets. Consider that NextEra Energy touts a dividend yield of 3.1%, while ConEd yields 3.5%.\n\nFed funds won't fall as far or as soon as previously expected, BofA said Tuesday\n\nBank of America on Tuesday pushed back by six months when it expects the Federal Reserve to start lowering interest rates, to December from June, and revised higher where it thinks the benchmark fed funds rate will end when the Fed is through with the next cycle.\n\n\"Following the recent stretch of inflation data that came in firmer than we expected, we revised higher our outlook for inflation in 2024 and, in turn, our outlook for Fed policy,\" wrote U.S. economist Michael Gapen. \"We now expect rate cuts to begin in December, versus June previously, and for the terminal rate in any easing cycle to finish at 3.5%-3.75%, up from 3.0%-3.25% previously.\"\n\nWith the current fed funds rate at 5.25% to 5.50%, Tuesday's move from BofA means the bank is now forecasting no more than seven quarter-point reductions from the Fed, rather than a previous expectation of nine.\n\n\"In short, we think the signal from the recent inflation data is that monetary policy will have to be tighter on average over the forecast horizon — not just in 2024 — to bring inflation down to 2.0%,\" Gapen wrote.\n\nStocks making the biggest moves after hours\n\nThe Starbucks logo is seen on a cup at one of its cafes on April 26, 2024.\n\nJakub Porzycki/ | Nurphoto | Getty Images\n\nCheck out the companies making headlines in extended trading:\n\nStarbucks — Shares slipped almost 10% in extended trading after the coffee chain missed fiscal second-quarter estimates on the top and bottom lines. Starbucks earned 68 cents per share on revenue of $8.56 billion, and missed the forecast from analysts polled by LSEG of 79 cents per share for earnings and $9.13 billion in revenue.\n\nPinterest — Shares surged nearly 19% following an earnings and revenue beat in the first quarter. Pinterest reported adjusted earnings of 20 cents per share, topping forecasts for 13 cents per share, according to LSEG. Revenue growth also accelerated in the quarter.\n\nSuper Micro Computer — Shares dropped nearly 8% after Super Micro Computer posted fiscal third-quarter revenue of $3.85 billion, missing the $3.95 billion consensus estimate, according to LSEG. Adjusted per-share earnings of $6.65 topped the earnings per share estimate of $5.78. The company also issued strong fourth-quarter revenue guidance.\n\nS&P 500 futures open lower Tuesday\n\nFutures tied to the S&P 500 fell Tuesday evening, sliding 0.2%.\n\nMeanwhile, Dow Jones Industrial Average futures traded near the flatline. Nasdaq 100 futures declined 0.4%.", "timestamp": "2024-05-01T19:12:56", "title": "Dow jumps 500 points as Powell says the Fed's next move is unlikely to be a hike: Live updates", "url": "https://www.cnbc.com/2024/04/30/stock-market-today-live-updates.html"}]}